; ModuleID = 'std::os::env'
source_filename = "std::os::env"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }

$std.os.env.get_var = comdat any

$std.os.env.get_var_temp = comdat any

$std.os.env.set_var = comdat any

$std.os.env.get_home_dir = comdat any

$std.os.env.get_config_dir = comdat any

$std.os.env.new_get_config_dir = comdat any

$std.os.env.clear_var = comdat any

$std.os.env.executable_path = comdat any

$std.os.env.new_executable_path = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

@.panic_msg = internal constant [34 x i8] c"@require \22name.len > 0\22 violated.\00", align 1
@.file = internal constant [7 x i8] c"env.c3\00", align 1
@.func = internal constant [8 x i8] c"get_var\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8
@std.core.mem.allocator.thread_temp_allocator = extern_weak thread_local global ptr, align 8
@"std.core.builtin.SearchResult$MISSING" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.core.builtin.SearchResult" to i64), %"char[]" { ptr @.fault, i64 7 }, i64 1 }, comdat, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DIR", linkageName: "new_get_config_dir.DIR", scope: !2, file: !2, line: 98, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "env.c3", directory: "/usr/local/lib/c3/std/os")
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !4)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !5, identifier: "char[]")
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !4, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !4, baseType: !10, size: 64, align: 64, offset: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !11)
!11 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 2, !"wchar_size", i32 4}
!15 = !{i32 4, !"PIE Level", i32 2}
!16 = !{i32 4, !"PIC Level", i32 2}
!17 = !{i32 1, !"uwtable", i32 2}
!18 = !{i32 2, !"frame-pointer", i32 2}
!19 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !20, globals: !30, splitDebugInlining: false)
!20 = !{!21}
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !22, file: !2, line: 26, baseType: !26, size: 32, align: 32, elements: !27)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !2, file: !2, line: 20, size: 192, align: 64, elements: !23, identifier: "std.io.path.PathImp")
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !22, file: !2, line: 22, baseType: !3, size: 128, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !22, file: !2, line: 23, baseType: !21, size: 32, align: 32, offset: 128)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29}
!28 = !DIEnumerator(name: "WIN32", value: 0)
!29 = !DIEnumerator(name: "POSIX", value: 1)
!30 = !{!0}
!31 = distinct !DISubprogram(name: "get_var", linkageName: "std.os.env.get_var", scope: !2, file: !2, line: 12, type: !32, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !43)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !36, !3, !37}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !35)
!35 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !38, identifier: "Allocator")
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !37, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !37, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!43 = !{}
!44 = !DILocalVariable(name: "name", arg: 1, scope: !31, file: !2, line: 12, type: !3)
!45 = !DILocation(line: 12, column: 27, scope: !31)
!46 = !DILocalVariable(name: "allocator", arg: 2, scope: !31, file: !2, line: 12, type: !37)
!47 = !DILocation(line: 12, column: 43, scope: !31)
!48 = !DILocation(line: 9, column: 11, scope: !49)
!49 = distinct !DILexicalBlock(scope: !31, file: !2, line: 12, column: 77)
!50 = !DILocalVariable(name: "current", scope: !51, file: !2, line: 592, type: !53, align: 8)
!51 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !52, file: !52, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19, retainedNodes: !43)
!52 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !54, size: 64, align: 64, dwarfAddressSpace: 0)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !55, identifier: "std.core.mem.allocator.TempAllocator")
!55 = !{!56, !57, !70, !71, !72}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !54, file: !2, line: 12, baseType: !37, size: 128, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !54, file: !2, line: 13, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !60, identifier: "std.core.mem.allocator.TempAllocatorPage")
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !59, file: !2, line: 24, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !59, file: !2, line: 25, baseType: !40, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !59, file: !2, line: 26, baseType: !10, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !2, line: 27, baseType: !10, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !59, file: !2, line: 28, baseType: !10, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !2, line: 29, baseType: !67, align: 8, offset: 320)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 0, lowerBound: 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !54, file: !2, line: 14, baseType: !10, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !54, file: !2, line: 15, baseType: !10, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !2, line: 16, baseType: !67, align: 8, offset: 320)
!73 = !DILocation(line: 592, column: 17, scope: !51, inlinedAt: !74)
!74 = !DILocation(line: 12, column: 77, scope: !31)
!75 = !DILocation(line: 396, column: 6, scope: !76, inlinedAt: !78)
!76 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !77, file: !77, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19)
!77 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!78 = !DILocation(line: 592, column: 27, scope: !51, inlinedAt: !74)
!79 = !DILocation(line: 398, column: 3, scope: !80, inlinedAt: !78)
!80 = distinct !DILexicalBlock(scope: !76, file: !77, line: 397, column: 2)
!81 = !DILocation(line: 400, column: 9, scope: !76, inlinedAt: !78)
!82 = !DILocalVariable(name: "original", scope: !51, file: !2, line: 594, type: !53, align: 8)
!83 = !DILocation(line: 594, column: 18, scope: !51, inlinedAt: !74)
!84 = !DILocation(line: 594, column: 29, scope: !51, inlinedAt: !74)
!85 = !DILocation(line: 595, column: 7, scope: !51, inlinedAt: !74)
!86 = !DILocation(line: 595, column: 18, scope: !51, inlinedAt: !74)
!87 = !DILocation(line: 595, column: 45, scope: !51, inlinedAt: !74)
!88 = !DILocalVariable(name: "mark", scope: !51, file: !2, line: 597, type: !10, align: 8)
!89 = !DILocation(line: 597, column: 6, scope: !51, inlinedAt: !74)
!90 = !DILocation(line: 597, column: 13, scope: !51, inlinedAt: !74)
!91 = !DILocalVariable(name: "val", scope: !92, file: !2, line: 17, type: !93, align: 8)
!92 = distinct !DILexicalBlock(scope: !31, file: !2, line: 13, column: 1)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !7, align: 8)
!94 = !DILocation(line: 17, column: 11, scope: !92)
!95 = !DILocation(line: 17, column: 30, scope: !92)
!96 = !DILocation(line: 17, column: 17, scope: !92)
!97 = !DILocation(line: 18, column: 10, scope: !92)
!98 = !DILocation(line: 18, column: 25, scope: !92)
!99 = !DILocation(line: 18, column: 16, scope: !92)
!100 = !DILocation(line: 18, column: 38, scope: !92)
!101 = !DILocation(line: 600, column: 17, scope: !102, inlinedAt: !74)
!102 = distinct !DILexicalBlock(scope: !51, file: !52, line: 599, column: 2)
!103 = !DILocation(line: 600, column: 3, scope: !102, inlinedAt: !74)
!104 = !DILocation(line: 602, column: 39, scope: !102, inlinedAt: !74)
!105 = !DILocation(line: 603, column: 9, scope: !102, inlinedAt: !74)
!106 = !DILocation(line: 600, column: 17, scope: !107, inlinedAt: !74)
!107 = distinct !DILexicalBlock(scope: !51, file: !52, line: 599, column: 2)
!108 = !DILocation(line: 600, column: 3, scope: !107, inlinedAt: !74)
!109 = !DILocation(line: 602, column: 39, scope: !107, inlinedAt: !74)
!110 = !DILocation(line: 603, column: 9, scope: !107, inlinedAt: !74)
!111 = distinct !DISubprogram(name: "get_var_temp", linkageName: "std.os.env.get_var_temp", scope: !2, file: !2, line: 37, type: !112, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !43)
!112 = !DISubroutineType(types: !113)
!113 = !{!34, !36, !3}
!114 = !DILocalVariable(name: "name", arg: 1, scope: !111, file: !2, line: 37, type: !3)
!115 = !DILocation(line: 37, column: 32, scope: !111)
!116 = !DILocation(line: 396, column: 6, scope: !117, inlinedAt: !118)
!117 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !77, file: !77, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19)
!118 = !DILocation(line: 39, column: 23, scope: !111)
!119 = !DILocation(line: 398, column: 3, scope: !120, inlinedAt: !118)
!120 = distinct !DILexicalBlock(scope: !117, file: !77, line: 397, column: 2)
!121 = !DILocation(line: 400, column: 9, scope: !117, inlinedAt: !118)
!122 = !DILocation(line: 39, column: 9, scope: !111)
