; ModuleID = 'std::net::tcp'
source_filename = "std::net::tcp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%Socket = type { i32, i32, [128 x i8] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.net.tcp.connect = comdat any

$std.net.tcp.connect_async = comdat any

$std.net.tcp.connect_to = comdat any

$std.net.tcp.connect_async_to = comdat any

$std.net.tcp.listen = comdat any

$std.net.tcp.accept = comdat any

$std.net.tcp.listen_to = comdat any

$"$ct.std.net.tcp.TcpSocket" = comdat any

$"$ct.std.net.Socket" = comdat any

$"$ct.std.net.tcp.TcpServerSocket" = comdat any

$"$ct.char" = comdat any

$"$ct.std.net.IpProtocol" = comdat any

$"std.net.IpProtocol$ai_family" = comdat any

$"std.net.NetError$INVALID_URL" = comdat any

$"std.net.NetError$URL_TOO_LONG" = comdat any

$"std.net.NetError$INVALID_SOCKET" = comdat any

$"std.net.NetError$GENERAL_ERROR" = comdat any

$"std.net.NetError$INVALID_IP_STRING" = comdat any

$"std.net.NetError$ADDRINFO_FAILED" = comdat any

$"std.net.NetError$CONNECT_FAILED" = comdat any

$"std.net.NetError$LISTEN_FAILED" = comdat any

$"std.net.NetError$ACCEPT_FAILED" = comdat any

$"std.net.NetError$WRITE_FAILED" = comdat any

$"std.net.NetError$READ_FAILED" = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "tcp.c3", directory: "/usr/local/lib/c3/std/net")
!9 = !{!10, !19}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SocketOption", scope: !8, file: !8, line: 87, baseType: !11, size: 8, align: 8, elements: !12)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "REUSEADDR", value: 0, isUnsigned: true)
!14 = !DIEnumerator(name: "REUSEPORT", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "KEEPALIVE", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "BROADCAST", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "OOBINLINE", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "DONTROUTE", value: 5, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpProtocol", scope: !8, file: !8, line: 5, baseType: !11, size: 8, align: 8, elements: !20)
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "UNSPECIFIED", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "IPV4", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "IPV6", value: 2, isUnsigned: true)
!24 = distinct !DISubprogram(name: "connect", linkageName: "std.net.tcp.connect", scope: !8, file: !8, line: 8, type: !25, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !57)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !29, !43, !38, !51, !52, !19}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !28)
!28 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TcpSocket*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcpSocket", scope: !8, file: !8, line: 5, baseType: !31, align: 4)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !8, file: !8, line: 4, size: 1088, align: 32, elements: !32, identifier: "std.net.Socket")
!32 = !{!33, !36, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !31, file: !8, line: 6, baseType: !34, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSocket", scope: !8, file: !8, line: 7, baseType: !35, align: 4)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !31, file: !8, line: 7, baseType: !37, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Socklen_t", scope: !8, file: !8, line: 9, baseType: !38, align: 4)
!38 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr_storage", scope: !31, file: !8, line: 10, baseType: !40, size: 1024, align: 8, offset: 64)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1024, align: 8, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 128, lowerBound: 0)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !45, identifier: "char[]")
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !44, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !44, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !50)
!50 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "Duration", scope: !8, file: !8, line: 5, baseType: !28, align: 8)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "SocketOption[]", size: 128, align: 64, elements: !53, identifier: "SocketOption[]")
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !52, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SocketOption*", baseType: !10, size: 64, align: 64, dwarfAddressSpace: 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !52, baseType: !49, size: 64, align: 64, offset: 64)
!57 = !{}
!58 = !DILocalVariable(name: "host", arg: 1, scope: !24, file: !8, line: 8, type: !43)
!59 = !DILocation(line: 8, column: 30, scope: !24)
!60 = !DILocalVariable(name: "port", arg: 2, scope: !24, file: !8, line: 8, type: !38)
!61 = !DILocation(line: 8, column: 41, scope: !24)
!62 = !DILocalVariable(name: "timeout", arg: 3, scope: !24, file: !8, line: 8, type: !51)
!63 = !DILocation(line: 8, column: 56, scope: !24)
!64 = !DILocalVariable(name: "options", arg: 4, scope: !24, file: !8, line: 8, type: !52)
!65 = !DILocation(line: 8, column: 85, scope: !24)
!66 = !DILocalVariable(name: "ip_protocol", arg: 5, scope: !24, file: !8, line: 8, type: !19)
!67 = !DILocation(line: 8, column: 105, scope: !24)
!68 = !DILocalVariable(name: "ai", scope: !24, file: !8, line: 10, type: !69, align: 8)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "AddrInfo*", baseType: !70, size: 64, align: 64, dwarfAddressSpace: 0)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "AddrInfo", scope: !8, file: !8, line: 14, size: 384, align: 64, elements: !71, identifier: "std.net.os.AddrInfo")
!71 = !{!72, !74, !76, !78, !80, !81, !89}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !70, file: !8, line: 16, baseType: !73, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFlags", scope: !8, file: !8, line: 7, baseType: !35, align: 4)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !70, file: !8, line: 17, baseType: !75, size: 32, align: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIFamily", scope: !8, file: !8, line: 4, baseType: !35, align: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !70, file: !8, line: 18, baseType: !77, size: 32, align: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "AISockType", scope: !8, file: !8, line: 6, baseType: !35, align: 4)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !70, file: !8, line: 19, baseType: !79, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "AIProtocol", scope: !8, file: !8, line: 5, baseType: !35, align: 4)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !70, file: !8, line: 20, baseType: !37, size: 32, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, scope: !70, file: !8, line: 26, baseType: !82, size: 128, align: 64, offset: 192)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !70, file: !8, line: 26, size: 128, align: 64, elements: !83)
!83 = !{!84, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !82, file: !8, line: 28, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "SockAddrPtr", scope: !8, file: !8, line: 12, baseType: !86, align: 8)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !82, file: !8, line: 29, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !8, file: !8, line: 6, baseType: !47, align: 8)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !70, file: !8, line: 31, baseType: !69, size: 64, align: 64, offset: 320)
!90 = !DILocation(line: 10, column: 12, scope: !24)
!91 = !DILocation(line: 10, column: 44, scope: !24)
!92 = !DILocation(line: 10, column: 18, scope: !24)
!93 = !DILocation(line: 12, column: 6, scope: !24)
!94 = !DILocation(line: 14, column: 21, scope: !95)
!95 = distinct !DILexicalBlock(scope: !24, file: !8, line: 13, column: 2)
!96 = !DILocation(line: 11, column: 25, scope: !97)
!97 = distinct !DILexicalBlock(scope: !24, file: !8, line: 11, column: 8)
!98 = !DILocation(line: 11, column: 8, scope: !97)
!99 = !DILocation(line: 11, column: 25, scope: !100)
!100 = distinct !DILexicalBlock(scope: !24, file: !8, line: 11, column: 8)
!101 = !DILocation(line: 11, column: 8, scope: !100)
!102 = !DILocation(line: 16, column: 9, scope: !24)
!103 = !DILocation(line: 11, column: 25, scope: !104)
!104 = distinct !DILexicalBlock(scope: !24, file: !8, line: 11, column: 8)
!105 = !DILocation(line: 11, column: 8, scope: !104)
!106 = !DILocation(line: 11, column: 25, scope: !107)
!107 = distinct !DILexicalBlock(scope: !24, file: !8, line: 11, column: 8)
!108 = !DILocation(line: 11, column: 8, scope: !107)
!109 = distinct !DISubprogram(name: "connect_async", linkageName: "std.net.tcp.connect_async", scope: !8, file: !8, line: 19, type: !110, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !57)
!110 = !DISubroutineType(types: !111)
!111 = !{!27, !29, !43, !38, !52, !19}
!112 = !DILocalVariable(name: "host", arg: 1, scope: !109, file: !8, line: 19, type: !43)
!113 = !DILocation(line: 19, column: 36, scope: !109)
!114 = !DILocalVariable(name: "port", arg: 2, scope: !109, file: !8, line: 19, type: !38)
!115 = !DILocation(line: 19, column: 47, scope: !109)
!116 = !DILocalVariable(name: "options", arg: 3, scope: !109, file: !8, line: 19, type: !52)
!117 = !DILocation(line: 19, column: 69, scope: !109)
!118 = !DILocalVariable(name: "ip_protocol", arg: 4, scope: !109, file: !8, line: 19, type: !19)
!119 = !DILocation(line: 19, column: 89, scope: !109)
!120 = !DILocalVariable(name: "ai", scope: !109, file: !8, line: 21, type: !69, align: 8)
!121 = !DILocation(line: 21, column: 12, scope: !109)
!122 = !DILocation(line: 21, column: 43, scope: !109)
!123 = !DILocation(line: 21, column: 17, scope: !109)
!124 = !DILocation(line: 23, column: 9, scope: !109)
!125 = !DILocation(line: 22, column: 25, scope: !126)
!126 = distinct !DILexicalBlock(scope: !109, file: !8, line: 22, column: 8)
!127 = !DILocation(line: 22, column: 8, scope: !126)
!128 = !DILocation(line: 22, column: 25, scope: !129)
!129 = distinct !DILexicalBlock(scope: !109, file: !8, line: 22, column: 8)
!130 = !DILocation(line: 22, column: 8, scope: !129)
!131 = distinct !DISubprogram(name: "connect_to", linkageName: "std.net.tcp.connect_to", scope: !8, file: !8, line: 26, type: !132, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !57)
!132 = !DISubroutineType(types: !133)
!133 = !{!27, !29, !69, !52}
!134 = !DILocalVariable(name: "ai", arg: 1, scope: !131, file: !8, line: 26, type: !69)
!135 = !DILocation(line: 26, column: 36, scope: !131)
!136 = !DILocalVariable(name: "options", arg: 2, scope: !131, file: !8, line: 26, type: !52)
!137 = !DILocation(line: 26, column: 56, scope: !131)
!138 = !DILocation(line: 28, column: 10, scope: !131)
!139 = distinct !DISubprogram(name: "connect_async_to", linkageName: "std.net.tcp.connect_async_to", scope: !8, file: !8, line: 31, type: !132, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !57)
!140 = !DILocalVariable(name: "ai", arg: 1, scope: !139, file: !8, line: 31, type: !69)
!141 = !DILocation(line: 31, column: 42, scope: !139)
!142 = !DILocalVariable(name: "options", arg: 2, scope: !139, file: !8, line: 31, type: !52)
!143 = !DILocation(line: 31, column: 62, scope: !139)
