; ModuleID = 'std::hash::md5'
source_filename = "std::hash::md5"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

$std.hash.md5.Md5.init = comdat any

$std.hash.md5.Md5.update = comdat any

$std.hash.md5.Md5.final = comdat any

$std.hash.md5.hash = comdat any

$"$ct.std.hash.md5.Md5" = comdat any

$std.hash.md5.BLOCK_BYTES = comdat any

$std.hash.md5.HASH_BYTES = comdat any

$"$ct.ulong" = comdat any

$"$ct.long" = comdat any

$"$ct.uint" = comdat any

@"$ct.std.hash.md5.Md5" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 152, i64 0, i64 8, [0 x i64] zeroinitializer }, comdat, align 8
@std.hash.md5.BLOCK_BYTES = weak local_unnamed_addr constant i32 64, comdat, align 4, !dbg !0
@std.hash.md5.HASH_BYTES = weak local_unnamed_addr constant i32 16, comdat, align 4, !dbg !4
@.panic_msg = internal constant [63 x i8] c"Reference parameter 'self' was passed a null pointer argument.\00", align 1
@.file = internal constant [7 x i8] c"md5.c3\00", align 1
@.func = internal constant [5 x i8] c"init\00", align 1
@std.core.builtin.panic = extern_weak global ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std.hash.md5.BLOCK_BYTES", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "md5.c3", directory: "/usr/local/lib/c3/std/hash")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std.hash.md5.HASH_BYTES", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 2, !"wchar_size", i32 4}
!9 = !{i32 4, !"PIE Level", i32 2}
!10 = !{i32 4, !"PIC Level", i32 2}
!11 = !{i32 1, !"uwtable", i32 2}
!12 = !{i32 2, !"frame-pointer", i32 2}
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !14, splitDebugInlining: false)
!14 = !{!0, !4}
!15 = distinct !DISubprogram(name: "init", linkageName: "std.hash.md5.Md5.init", scope: !2, file: !2, line: 28, type: !16, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !37)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Md5*", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !20, identifier: "std.hash.md5.Md5")
!20 = !{!21, !23, !24, !25, !26, !27, !28, !33}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !19, file: !2, line: 10, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !19, file: !2, line: 10, baseType: !22, size: 32, align: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !19, file: !2, line: 11, baseType: !22, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !19, file: !2, line: 11, baseType: !22, size: 32, align: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !19, file: !2, line: 11, baseType: !22, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !19, file: !2, line: 11, baseType: !22, size: 32, align: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !19, file: !2, line: 12, baseType: !29, size: 512, align: 8, offset: 192)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, align: 8, elements: !31)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !{!32}
!32 = !DISubrange(count: 64, lowerBound: 0)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !19, file: !2, line: 13, baseType: !34, size: 512, align: 32, offset: 704)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 32, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 16, lowerBound: 0)
!37 = !{}
!38 = !DILocation(line: 29, column: 1, scope: !15)
!39 = !DILocalVariable(name: "self", arg: 1, scope: !15, file: !2, line: 28, type: !18)
!40 = !DILocation(line: 28, column: 18, scope: !15)
!41 = !DILocation(line: 30, column: 2, scope: !15)
!42 = !DILocation(line: 30, column: 11, scope: !15)
!43 = !DILocation(line: 31, column: 2, scope: !15)
!44 = !DILocation(line: 31, column: 11, scope: !15)
!45 = !DILocation(line: 32, column: 2, scope: !15)
!46 = !DILocation(line: 32, column: 11, scope: !15)
!47 = !DILocation(line: 33, column: 2, scope: !15)
!48 = !DILocation(line: 33, column: 11, scope: !15)
!49 = !DILocation(line: 35, column: 2, scope: !15)
!50 = !DILocation(line: 35, column: 12, scope: !15)
!51 = !DILocation(line: 36, column: 2, scope: !15)
!52 = !DILocation(line: 36, column: 12, scope: !15)
!53 = distinct !DISubprogram(name: "update", linkageName: "std.hash.md5.Md5.update", scope: !2, file: !2, line: 40, type: !54, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !37)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !18, !56}
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !57, identifier: "char[]")
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !56, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !62)
!62 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!63 = !DILocation(line: 41, column: 1, scope: !53)
!64 = !DILocalVariable(name: "ctx", arg: 1, scope: !53, file: !2, line: 40, type: !18)
!65 = !DILocation(line: 40, column: 20, scope: !53)
!66 = !DILocalVariable(name: "data", arg: 2, scope: !53, file: !2, line: 40, type: !56)
!67 = !DILocation(line: 40, column: 33, scope: !53)
!68 = !DILocalVariable(name: "saved_lo", scope: !53, file: !2, line: 42, type: !22, align: 4)
!69 = !DILocation(line: 42, column: 7, scope: !53)
!70 = !DILocation(line: 42, column: 18, scope: !53)
!71 = !DILocation(line: 43, column: 7, scope: !53)
!72 = !DILocation(line: 43, column: 17, scope: !53)
!73 = !DILocation(line: 43, column: 28, scope: !53)
!74 = !DILocation(line: 43, column: 54, scope: !53)
!75 = !DILocation(line: 43, column: 64, scope: !53)
!76 = !DILocation(line: 44, column: 2, scope: !53)
!77 = !DILocation(line: 44, column: 12, scope: !53)
!78 = !DILocalVariable(name: "used", scope: !53, file: !2, line: 46, type: !61, align: 8)
!79 = !DILocation(line: 46, column: 6, scope: !53)
!80 = !DILocation(line: 46, column: 14, scope: !53)
!81 = !DILocation(line: 48, column: 6, scope: !53)
!82 = !DILocalVariable(name: "available", scope: !83, file: !2, line: 50, type: !61, align: 8)
!83 = distinct !DILexicalBlock(scope: !53, file: !2, line: 49, column: 2)
!84 = !DILocation(line: 50, column: 7, scope: !83)
!85 = !DILocation(line: 50, column: 24, scope: !83)
!86 = !DILocation(line: 50, column: 19, scope: !83)
!87 = !DILocation(line: 52, column: 7, scope: !83)
!88 = !DILocation(line: 52, column: 18, scope: !83)
!89 = !DILocation(line: 54, column: 32, scope: !90)
!90 = distinct !DILexicalBlock(scope: !83, file: !2, line: 53, column: 3)
!91 = !DILocation(line: 54, column: 37, scope: !90)
!92 = !DILocation(line: 54, column: 4, scope: !90)
!93 = !DILocation(line: 54, column: 15, scope: !90)
!94 = !DILocation(line: 54, column: 20, scope: !90)
!95 = !DILocation(line: 55, column: 10, scope: !90)
!96 = !DILocation(line: 57, column: 32, scope: !83)
!97 = !DILocation(line: 57, column: 37, scope: !83)
!98 = !DILocation(line: 57, column: 38, scope: !83)
!99 = !DILocation(line: 57, column: 3, scope: !83)
!100 = !DILocation(line: 57, column: 14, scope: !83)
!101 = !DILocation(line: 57, column: 19, scope: !83)
!102 = !DILocation(line: 58, column: 10, scope: !83)
!103 = !DILocation(line: 58, column: 15, scope: !83)
!104 = !DILocation(line: 59, column: 14, scope: !83)
!105 = !DILocation(line: 59, column: 26, scope: !83)
!106 = !DILocation(line: 59, column: 3, scope: !83)
!107 = !DILocation(line: 62, column: 6, scope: !53)
!108 = !DILocation(line: 64, column: 26, scope: !109)
!109 = distinct !DILexicalBlock(scope: !53, file: !2, line: 63, column: 2)
!110 = !DILocation(line: 64, column: 10, scope: !109)
!111 = !DILocation(line: 64, column: 50, scope: !109)
!112 = !DILocation(line: 66, column: 26, scope: !53)
!113 = !DILocation(line: 66, column: 31, scope: !53)
!114 = !DILocation(line: 66, column: 2, scope: !53)
!115 = !DILocation(line: 66, column: 14, scope: !53)
!116 = distinct !DISubprogram(name: "final", linkageName: "std.hash.md5.Md5.final", scope: !2, file: !2, line: 69, type: !117, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !37)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !18}
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, align: 8, elements: !35)
!120 = !DILocation(line: 70, column: 1, scope: !116)
!121 = !DILocalVariable(name: "ctx", arg: 1, scope: !116, file: !2, line: 69, type: !18)
!122 = !DILocation(line: 69, column: 31, scope: !116)
!123 = !DILocalVariable(name: "used", scope: !116, file: !2, line: 71, type: !61, align: 8)
!124 = !DILocation(line: 71, column: 6, scope: !116)
