; ModuleID = 'std::core::builtin'
source_filename = "std::core::builtin"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.core.builtin.panicf = comdat any

$std.core.builtin.print_backtrace = comdat any

$std.core.builtin.default_panic = comdat any

$std.core.builtin.sig_panic = comdat any

$std.core.builtin.sig_bus_error = comdat any

$std.core.builtin.sig_segmentation_fault = comdat any

$"std.core.builtin.IteratorResult$NO_MORE_ELEMENT" = comdat any

$"$ct.std.core.builtin.IteratorResult" = comdat any

$"std.core.builtin.SearchResult$MISSING" = comdat any

$"$ct.std.core.builtin.SearchResult" = comdat any

$"std.core.builtin.CastResult$TYPE_MISMATCH" = comdat any

$"$ct.std.core.builtin.CastResult" = comdat any

$"$ct.std.core.builtin.EmptySlot" = comdat any

$"$ct.p$void" = comdat any

$"$ct.void" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.builtin.PrefetchLocality" = comdat any

$std.core.builtin.panic = comdat any

$std.core.builtin.EMPTY_MACRO_SLOT = comdat any

$std.core.builtin.MAX_FRAMEADDRESS = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "in_panic", linkageName: "std.core.builtin.in_panic", scope: !2, file: !2, line: 114, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "builtin.c3", directory: "/usr/local/lib/c3/std/core")
!3 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "panic", linkageName: "std.core.builtin.panic", scope: !2, file: !2, line: 135, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 133, baseType: !7, align: 8)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10, !10, !10, !19}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !12, identifier: "char[]")
!12 = !{!13, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !11, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !11, baseType: !17, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !18)
!18 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "EMPTY_MACRO_SLOT", linkageName: "std.core.builtin.EMPTY_MACRO_SLOT", scope: !2, file: !2, line: 417, type: !22, isLocal: false, isDefinition: true, align: 8)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "EmptySlot", scope: !2, file: !2, line: 416, baseType: !23, align: 8)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "MAX_FRAMEADDRESS", linkageName: "std.core.builtin.MAX_FRAMEADDRESS", scope: !2, file: !2, line: 421, type: !26, isLocal: false, isDefinition: true, align: 4)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "old_bus_error", linkageName: "std.core.builtin.old_bus_error", scope: !2, file: !2, line: 712, type: !29, isLocal: false, isDefinition: true, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalFunction", scope: !2, file: !2, line: 39, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SignalFunction", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !26}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "old_segmentation_fault", linkageName: "std.core.builtin.old_segmentation_fault", scope: !2, file: !2, line: 713, type: !29, isLocal: false, isDefinition: true, align: 8)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 2, !"wchar_size", i32 4}
!38 = !{i32 4, !"PIE Level", i32 2}
!39 = !{i32 4, !"PIC Level", i32 2}
!40 = !{i32 1, !"uwtable", i32 2}
!41 = !{i32 2, !"frame-pointer", i32 2}
!42 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !43, splitDebugInlining: false)
!43 = !{!0, !4, !20, !24, !27, !33}
!44 = distinct !DISubprogram(name: "panicf", linkageName: "std.core.builtin.panicf", scope: !2, file: !2, line: 137, type: !45, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !42, retainedNodes: !57)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !10, !10, !10, !19, !47}
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !48, identifier: "any[]")
!48 = !{!49, !56}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !47, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !51, size: 64, align: 64, dwarfAddressSpace: 0)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !52, identifier: "any")
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, baseType: !23, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !47, baseType: !17, size: 64, align: 64, offset: 64)
!57 = !{}
!58 = !DILocalVariable(name: "fmt", arg: 1, scope: !44, file: !2, line: 137, type: !10)
!59 = !DILocation(line: 137, column: 23, scope: !44)
!60 = !DILocalVariable(name: "file", arg: 2, scope: !44, file: !2, line: 137, type: !10)
!61 = !DILocation(line: 137, column: 35, scope: !44)
!62 = !DILocalVariable(name: "function", arg: 3, scope: !44, file: !2, line: 137, type: !10)
!63 = !DILocation(line: 137, column: 48, scope: !44)
!64 = !DILocalVariable(name: "line", arg: 4, scope: !44, file: !2, line: 137, type: !19)
!65 = !DILocation(line: 137, column: 63, scope: !44)
!66 = !DILocalVariable(name: "args", arg: 5, scope: !44, file: !2, line: 137, type: !47)
!67 = !DILocation(line: 137, column: 69, scope: !44)
!68 = !DILocation(line: 139, column: 6, scope: !44)
!69 = !DILocation(line: 208, column: 15, scope: !70, inlinedAt: !72)
!70 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !71, file: !71, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!71 = !DIFile(filename: "io.c3", directory: "/usr/local/lib/c3/std/io")
!72 = !DILocation(line: 141, column: 3, scope: !73)
!73 = distinct !DILexicalBlock(scope: !44, file: !2, line: 140, column: 2)
!74 = !DILocation(line: 118, column: 24, scope: !75, inlinedAt: !76)
!75 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!76 = !DILocation(line: 208, column: 3, scope: !70, inlinedAt: !72)
!77 = !DILocation(line: 218, column: 16, scope: !78, inlinedAt: !79)
!78 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !71, file: !71, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!79 = !DILocation(line: 142, column: 3, scope: !73)
!80 = !DILocalVariable(name: "len", scope: !81, file: !2, line: 174, type: !17, align: 8)
!81 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !71, file: !71, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !57)
!82 = !DILocation(line: 174, column: 6, scope: !81, inlinedAt: !83)
!83 = !DILocation(line: 218, column: 3, scope: !78, inlinedAt: !79)
!84 = !DILocation(line: 118, column: 24, scope: !85, inlinedAt: !86)
!85 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!86 = !DILocation(line: 174, column: 12, scope: !81, inlinedAt: !83)
!87 = !DILocation(line: 175, column: 17, scope: !81, inlinedAt: !83)
!88 = !DILocation(line: 175, column: 2, scope: !81, inlinedAt: !83)
!89 = !DILocation(line: 180, column: 4, scope: !81, inlinedAt: !83)
!90 = !DILocation(line: 182, column: 9, scope: !81, inlinedAt: !83)
!91 = !DILocation(line: 143, column: 9, scope: !73)
!92 = !DILocation(line: 145, column: 13, scope: !44)
!93 = !DILocalVariable(name: "buffer", scope: !94, file: !2, line: 537, type: !96, align: 16)
!94 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !95, file: !95, line: 535, scopeLine: 535, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !57)
!95 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 4096, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 512, lowerBound: 0)
!99 = !DILocation(line: 537, column: 14, scope: !94, inlinedAt: !100)
!100 = !DILocation(line: 146, column: 2, scope: !44)
!101 = !DILocalVariable(name: "allocator", scope: !94, file: !2, line: 538, type: !102, align: 8)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !2, file: !2, line: 3, size: 384, align: 64, elements: !103, identifier: "std.core.mem.allocator.OnStackAllocator")
!103 = !{!104, !109, !110, !111}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !102, file: !2, line: 5, baseType: !105, size: 128, align: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !106, identifier: "Allocator")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !105, baseType: !23, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, baseType: !55, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !102, file: !2, line: 6, baseType: !11, size: 128, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !102, file: !2, line: 7, baseType: !17, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !102, file: !2, line: 8, baseType: !112, size: 64, align: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !2, file: !2, line: 12, size: 192, align: 64, elements: !114, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !113, file: !2, line: 14, baseType: !3, size: 8, align: 8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !2, line: 15, baseType: !112, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !2, line: 16, baseType: !23, size: 64, align: 64, offset: 128)
!118 = !DILocation(line: 538, column: 19, scope: !94, inlinedAt: !100)
!119 = !DILocation(line: 539, column: 18, scope: !94, inlinedAt: !100)
!120 = !DILocation(line: 392, column: 27, scope: !121, inlinedAt: !123)
!121 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !122, file: !122, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!122 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!123 = !DILocation(line: 539, column: 26, scope: !94, inlinedAt: !100)
!124 = !DILocation(line: 539, column: 2, scope: !94, inlinedAt: !100)
!125 = !DILocalVariable(name: "allocator", scope: !44, file: !2, line: 146, type: !105, align: 8)
!126 = !DILocation(line: 146, column: 28, scope: !44)
!127 = !DILocation(line: 541, column: 8, scope: !128, inlinedAt: !100)
!128 = distinct !DILexicalBlock(scope: !94, file: !95, line: 541, column: 2)
!129 = !DILocalVariable(name: "s", scope: !130, file: !2, line: 148, type: !131, align: 8)
!130 = distinct !DILexicalBlock(scope: !44, file: !2, line: 147, column: 2)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !132, align: 8)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !133, size: 64, align: 64, dwarfAddressSpace: 0)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!134 = !DILocation(line: 148, column: 11, scope: !130)
!135 = !DILocation(line: 149, column: 25, scope: !130)
!136 = !DILocation(line: 149, column: 3, scope: !130)
!137 = !DILocation(line: 150, column: 3, scope: !130)
!138 = !DILocation(line: 151, column: 14, scope: !130)
!139 = !DILocation(line: 152, column: 3, scope: !130)
!140 = !DILocation(line: 152, column: 9, scope: !130)
!141 = !DILocation(line: 152, column: 39, scope: !130)
!142 = !DILocation(line: 540, column: 8, scope: !143, inlinedAt: !100)
!143 = distinct !DILexicalBlock(scope: !94, file: !95, line: 540, column: 8)
!144 = distinct !DISubprogram(name: "print_backtrace", linkageName: "std.core.builtin.print_backtrace", scope: !2, file: !2, line: 65, type: !145, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !42, retainedNodes: !57)
!145 = !DISubroutineType(types: !146)
!146 = !{!3, !10, !26}
!147 = !DILocalVariable(name: "message", arg: 1, scope: !144, file: !2, line: 65, type: !10)
!148 = !DILocation(line: 65, column: 32, scope: !144)
!149 = !DILocalVariable(name: "backtraces_to_ignore", arg: 2, scope: !144, file: !2, line: 65, type: !26)
!150 = !DILocation(line: 65, column: 45, scope: !144)
!151 = !DILocalVariable(name: "current", scope: !152, file: !2, line: 592, type: !153, align: 8)
!152 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !95, file: !95, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !57)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !154, size: 64, align: 64, dwarfAddressSpace: 0)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !155, identifier: "std.core.mem.allocator.TempAllocator")
!155 = !{!156, !157, !170, !171, !172}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !154, file: !2, line: 12, baseType: !105, size: 128, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !154, file: !2, line: 13, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !159, size: 64, align: 64, dwarfAddressSpace: 0)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !160, identifier: "std.core.mem.allocator.TempAllocatorPage")
!160 = !{!161, !162, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !159, file: !2, line: 24, baseType: !158, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !159, file: !2, line: 25, baseType: !23, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !159, file: !2, line: 26, baseType: !17, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !159, file: !2, line: 27, baseType: !17, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !159, file: !2, line: 28, baseType: !17, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !2, line: 29, baseType: !167, align: 8, offset: 320)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, align: 8, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 0, lowerBound: 0)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !154, file: !2, line: 14, baseType: !17, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !154, file: !2, line: 15, baseType: !17, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !2, line: 16, baseType: !167, align: 8, offset: 320)
!173 = !DILocation(line: 592, column: 17, scope: !152, inlinedAt: !174)
!174 = !DILocation(line: 65, column: 98, scope: !144)
!175 = !DILocation(line: 396, column: 6, scope: !176, inlinedAt: !177)
!176 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !122, file: !122, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!177 = !DILocation(line: 592, column: 27, scope: !152, inlinedAt: !174)
!178 = !DILocation(line: 398, column: 3, scope: !179, inlinedAt: !177)
!179 = distinct !DILexicalBlock(scope: !176, file: !122, line: 397, column: 2)
!180 = !DILocation(line: 400, column: 9, scope: !176, inlinedAt: !177)
!181 = !DILocalVariable(name: "mark", scope: !152, file: !2, line: 597, type: !17, align: 8)
!182 = !DILocation(line: 597, column: 6, scope: !152, inlinedAt: !174)
!183 = !DILocation(line: 597, column: 13, scope: !152, inlinedAt: !174)
!184 = !DILocalVariable(name: "buffer", scope: !185, file: !2, line: 67, type: !186, align: 16)
!185 = distinct !DILexicalBlock(scope: !144, file: !2, line: 66, column: 1)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, align: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 256, lowerBound: 0)
!189 = !DILocation(line: 67, column: 13, scope: !185)
!190 = !DILocalVariable(name: "backtraces", scope: !185, file: !2, line: 68, type: !191, align: 8)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !192, identifier: "void*[]")
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !191, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, baseType: !17, size: 64, align: 64, offset: 64)
!196 = !DILocation(line: 68, column: 10, scope: !185)
!197 = !DILocation(line: 68, column: 51, scope: !185)
!198 = !DILocation(line: 68, column: 23, scope: !185)
!199 = !DILocation(line: 69, column: 2, scope: !185)
!200 = !DILocalVariable(name: "backtrace", scope: !185, file: !2, line: 70, type: !201, align: 8)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !202, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!202 = !{!203, !204, !205, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !201, file: !2, line: 16, baseType: !17, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !201, file: !2, line: 17, baseType: !17, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !201, file: !2, line: 18, baseType: !105, size: 128, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !201, file: !2, line: 19, baseType: !207, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !208, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !209, align: 8)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !210, identifier: "std.os.backtrace.Backtrace")
!210 = !{!211, !213, !214, !215, !216, !217, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !209, file: !2, line: 17, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !18)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !209, file: !2, line: 18, baseType: !10, size: 128, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !209, file: !2, line: 19, baseType: !10, size: 128, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !209, file: !2, line: 20, baseType: !10, size: 128, align: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !209, file: !2, line: 21, baseType: !19, size: 32, align: 32, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !209, file: !2, line: 22, baseType: !105, size: 128, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !209, file: !2, line: 23, baseType: !3, size: 8, align: 8, offset: 640)
!219 = !DILocation(line: 70, column: 17, scope: !185)
!220 = !DILocation(line: 396, column: 6, scope: !221, inlinedAt: !222)
!221 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !122, file: !122, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!222 = !DILocation(line: 70, column: 72, scope: !185)
!223 = !DILocation(line: 398, column: 3, scope: !224, inlinedAt: !222)
!224 = distinct !DILexicalBlock(scope: !221, file: !122, line: 397, column: 2)
!225 = !DILocation(line: 400, column: 9, scope: !221, inlinedAt: !222)
!226 = !DILocation(line: 70, column: 29, scope: !185)
!227 = !DILocation(line: 71, column: 12, scope: !185)
!228 = !DILocation(line: 600, column: 17, scope: !229, inlinedAt: !174)
!229 = distinct !DILexicalBlock(scope: !152, file: !95, line: 599, column: 2)
!230 = !DILocation(line: 600, column: 3, scope: !229, inlinedAt: !174)
!231 = !DILocation(line: 603, column: 9, scope: !229, inlinedAt: !174)
!232 = !DILocation(line: 72, column: 6, scope: !185)
!233 = !DILocation(line: 72, column: 25, scope: !185)
!234 = !DILocation(line: 600, column: 17, scope: !235, inlinedAt: !174)
!235 = distinct !DILexicalBlock(scope: !152, file: !95, line: 599, column: 2)
!236 = !DILocation(line: 600, column: 3, scope: !235, inlinedAt: !174)
!237 = !DILocation(line: 603, column: 9, scope: !235, inlinedAt: !174)
!238 = !DILocation(line: 208, column: 15, scope: !239, inlinedAt: !240)
!239 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !71, file: !71, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!240 = !DILocation(line: 73, column: 2, scope: !185)
!241 = !DILocation(line: 118, column: 24, scope: !242, inlinedAt: !243)
!242 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!243 = !DILocation(line: 208, column: 3, scope: !239, inlinedAt: !240)
!244 = !DILocation(line: 208, column: 15, scope: !245, inlinedAt: !246)
!245 = distinct !DISubprogram(name: "eprint", linkageName: "eprint", scope: !71, file: !71, line: 206, scopeLine: 206, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!246 = !DILocation(line: 74, column: 2, scope: !185)
!247 = !DILocation(line: 118, column: 24, scope: !248, inlinedAt: !249)
!248 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!249 = !DILocation(line: 208, column: 3, scope: !245, inlinedAt: !246)
!250 = !DILocation(line: 218, column: 16, scope: !251, inlinedAt: !252)
!251 = distinct !DISubprogram(name: "eprintn", linkageName: "eprintn", scope: !71, file: !71, line: 216, scopeLine: 216, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!252 = !DILocation(line: 75, column: 2, scope: !185)
!253 = !DILocalVariable(name: "len", scope: !254, file: !2, line: 174, type: !17, align: 8)
!254 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !71, file: !71, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !57)
!255 = !DILocation(line: 174, column: 6, scope: !254, inlinedAt: !256)
!256 = !DILocation(line: 218, column: 3, scope: !251, inlinedAt: !252)
!257 = !DILocation(line: 118, column: 24, scope: !258, inlinedAt: !259)
!258 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !71, file: !71, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42)
!259 = !DILocation(line: 174, column: 12, scope: !254, inlinedAt: !256)
!260 = !DILocation(line: 175, column: 17, scope: !254, inlinedAt: !256)
!261 = !DILocation(line: 175, column: 2, scope: !254, inlinedAt: !256)
