; ModuleID = 'std::os::process'
source_filename = "std::os::process"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%File = type { ptr }
%"char[][]" = type { ptr, i64 }
%SubProcess = type { ptr, ptr, ptr, i32, i32, i8 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%"char*[]" = type { ptr, i64 }
%Posix_spawn_file_actions_t = type { i32, i32, ptr, [16 x i32] }

$std.os.process.SubProcess.stdout = comdat any

$std.os.process.SubProcess.destroy = comdat any

$std.os.process.SubProcess.terminate = comdat any

$std.os.process.SubProcess.read_stdout = comdat any

$std.os.process.SubProcess.read_stderr = comdat any

$std.os.process.SubProcess.is_running = comdat any

$std.os.process.SubProcess.join = comdat any

$std.os.process.execute_stdout_to_buffer = comdat any

$std.os.process.create = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_CREATE_PIPE" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDIN" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDOUT" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_OPEN_STDERR" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_START_PROCESS" = comdat any

$"std.os.process.SubProcessResult$FAILED_TO_INITIALIZE_ACTIONS" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EMPTY_ENVIRONMENT", linkageName: "std.os.process.EMPTY_ENVIRONMENT", scope: !2, file: !2, line: 258, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "subprocess.c3", directory: "/usr/local/lib/c3/std/os")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 64, elements: !7)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !5, align: 8)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !6, size: 64, align: 64, dwarfAddressSpace: 0)
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!7 = !{!8}
!8 = !DISubrange(count: 1, lowerBound: 0)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 2, !"wchar_size", i32 4}
!12 = !{i32 4, !"PIE Level", i32 2}
!13 = !{i32 4, !"PIC Level", i32 2}
!14 = !{i32 1, !"uwtable", i32 2}
!15 = !{i32 2, !"frame-pointer", i32 2}
!16 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !17, splitDebugInlining: false)
!17 = !{!0}
!18 = distinct !DISubprogram(name: "stdout", linkageName: "std.os.process.SubProcess.stdout", scope: !2, file: !2, line: 356, type: !19, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !26}
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !22, identifier: "std.io.File")
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !21, file: !2, line: 6, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 357, baseType: !25, align: 8)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "SubProcess*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubProcess", scope: !2, file: !2, line: 19, size: 320, align: 64, elements: !28, identifier: "std.os.process.SubProcess")
!28 = !{!29, !30, !31, !32, !35, !36}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_file", scope: !27, file: !2, line: 21, baseType: !24, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_file", scope: !27, file: !2, line: 22, baseType: !24, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "stderr_file", scope: !27, file: !2, line: 23, baseType: !24, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !27, file: !2, line: 30, baseType: !33, size: 32, align: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pid_t", scope: !2, file: !2, line: 21, baseType: !34, align: 4)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "return_status", scope: !27, file: !2, line: 31, baseType: !34, size: 32, align: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "is_alive", scope: !27, file: !2, line: 33, baseType: !37, size: 8, align: 8, offset: 256)
!37 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!38 = !{}
!39 = !DILocation(line: 357, column: 1, scope: !18)
!40 = !DILocalVariable(name: "self", arg: 1, scope: !18, file: !2, line: 356, type: !26)
!41 = !DILocation(line: 356, column: 27, scope: !18)
!42 = !DILocation(line: 358, column: 27, scope: !18)
!43 = !DILocation(line: 358, column: 9, scope: !18)
!44 = distinct !DISubprogram(name: "destroy", linkageName: "std.os.process.SubProcess.destroy", scope: !2, file: !2, line: 380, type: !45, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!45 = !DISubroutineType(types: !46)
!46 = !{!37, !26}
!47 = !DILocation(line: 381, column: 1, scope: !44)
!48 = !DILocalVariable(name: "self", arg: 1, scope: !44, file: !2, line: 380, type: !26)
!49 = !DILocation(line: 380, column: 28, scope: !44)
!50 = !DILocation(line: 382, column: 6, scope: !44)
!51 = !DILocation(line: 382, column: 36, scope: !44)
!52 = !DILocation(line: 382, column: 23, scope: !44)
!53 = !DILocation(line: 383, column: 6, scope: !44)
!54 = !DILocation(line: 385, column: 16, scope: !55)
!55 = distinct !DILexicalBlock(scope: !44, file: !2, line: 384, column: 2)
!56 = !DILocation(line: 385, column: 3, scope: !55)
!57 = !DILocation(line: 386, column: 7, scope: !55)
!58 = !DILocation(line: 386, column: 27, scope: !55)
!59 = !DILocation(line: 386, column: 58, scope: !55)
!60 = !DILocation(line: 386, column: 45, scope: !55)
!61 = !DILocation(line: 388, column: 2, scope: !44)
!62 = !DILocation(line: 388, column: 20, scope: !44)
!63 = !DILocation(line: 388, column: 39, scope: !44)
!64 = !DILocation(line: 388, column: 58, scope: !44)
!65 = !DILocation(line: 396, column: 9, scope: !44)
!66 = distinct !DISubprogram(name: "terminate", linkageName: "std.os.process.SubProcess.terminate", scope: !2, file: !2, line: 399, type: !67, scopeLine: 399, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !25, !26}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !70)
!70 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!71 = !DILocation(line: 400, column: 1, scope: !66)
!72 = !DILocalVariable(name: "self", arg: 1, scope: !66, file: !2, line: 399, type: !26)
!73 = !DILocation(line: 399, column: 31, scope: !66)
!74 = !DILocation(line: 404, column: 19, scope: !66)
!75 = !DILocation(line: 404, column: 31, scope: !66)
!76 = !DILocation(line: 404, column: 7, scope: !66)
!77 = !DILocation(line: 404, column: 42, scope: !66)
!78 = distinct !DISubprogram(name: "read_stdout", linkageName: "std.os.process.SubProcess.read_stdout", scope: !2, file: !2, line: 444, type: !79, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!79 = !DISubroutineType(types: !80)
!80 = !{!69, !81, !26, !5, !83}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !83)
!83 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!84 = !DILocation(line: 445, column: 1, scope: !78)
!85 = !DILocalVariable(name: "self", arg: 1, scope: !78, file: !2, line: 444, type: !26)
!86 = !DILocation(line: 444, column: 32, scope: !78)
!87 = !DILocalVariable(name: "buffer", arg: 2, scope: !78, file: !2, line: 444, type: !5)
!88 = !DILocation(line: 444, column: 45, scope: !78)
!89 = !DILocalVariable(name: "size", arg: 3, scope: !78, file: !2, line: 444, type: !82)
!90 = !DILocation(line: 444, column: 57, scope: !78)
!91 = !DILocation(line: 449, column: 31, scope: !78)
!92 = !DILocation(line: 449, column: 10, scope: !78)
!93 = distinct !DISubprogram(name: "read_stderr", linkageName: "std.os.process.SubProcess.read_stderr", scope: !2, file: !2, line: 453, type: !79, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!94 = !DILocation(line: 454, column: 1, scope: !93)
!95 = !DILocalVariable(name: "self", arg: 1, scope: !93, file: !2, line: 453, type: !26)
!96 = !DILocation(line: 453, column: 32, scope: !93)
!97 = !DILocalVariable(name: "buffer", arg: 2, scope: !93, file: !2, line: 453, type: !5)
!98 = !DILocation(line: 453, column: 45, scope: !93)
!99 = !DILocalVariable(name: "size", arg: 3, scope: !93, file: !2, line: 453, type: !82)
!100 = !DILocation(line: 453, column: 57, scope: !93)
!101 = !DILocation(line: 458, column: 31, scope: !93)
!102 = !DILocation(line: 458, column: 10, scope: !93)
!103 = distinct !DISubprogram(name: "is_running", linkageName: "std.os.process.SubProcess.is_running", scope: !2, file: !2, line: 462, type: !104, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!104 = !DISubroutineType(types: !105)
!105 = !{!69, !106, !26}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "bool*", baseType: !37, size: 64, align: 64, dwarfAddressSpace: 0)
!107 = !DILocation(line: 463, column: 1, scope: !103)
!108 = !DILocalVariable(name: "self", arg: 1, scope: !103, file: !2, line: 462, type: !26)
!109 = !DILocation(line: 462, column: 32, scope: !103)
!110 = !DILocation(line: 464, column: 7, scope: !103)
!111 = !DILocation(line: 464, column: 29, scope: !103)
!112 = !DILocalVariable(name: "status", scope: !103, file: !2, line: 470, type: !113, align: 4)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !34, align: 4)
!114 = !DILocation(line: 470, column: 8, scope: !103)
!115 = !DILocalVariable(name: "is_alive", scope: !103, file: !2, line: 471, type: !37, align: 1)
!116 = !DILocation(line: 471, column: 8, scope: !103)
!117 = !DILocation(line: 471, column: 34, scope: !103)
!118 = !DILocation(line: 471, column: 55, scope: !103)
!119 = !DILocation(line: 471, column: 19, scope: !103)
!120 = !DILocation(line: 472, column: 7, scope: !103)
!121 = !DILocation(line: 472, column: 24, scope: !103)
!122 = !DILocation(line: 473, column: 3, scope: !103)
!123 = !DILocation(line: 473, column: 19, scope: !103)
!124 = !DILocation(line: 474, column: 3, scope: !103)
!125 = !DILocation(line: 44, column: 37, scope: !126, inlinedAt: !128)
!126 = distinct !DISubprogram(name: "wTERMSIG", linkageName: "wTERMSIG", scope: !127, file: !127, line: 44, scopeLine: 44, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!127 = !DIFile(filename: "process.c3", directory: "/usr/local/lib/c3/std/os/posix")
!128 = !DILocation(line: 46, column: 38, scope: !129, inlinedAt: !130)
!129 = distinct !DISubprogram(name: "wIFEXITED", linkageName: "wIFEXITED", scope: !127, file: !127, line: 46, scopeLine: 46, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!130 = !DILocation(line: 474, column: 24, scope: !103)
!131 = !DILocation(line: 43, column: 41, scope: !132, inlinedAt: !133)
!132 = distinct !DISubprogram(name: "wEXITSTATUS", linkageName: "wEXITSTATUS", scope: !127, file: !127, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!133 = !DILocation(line: 474, column: 51, scope: !103)
!134 = !DILocation(line: 474, column: 80, scope: !103)
!135 = !DILocation(line: 475, column: 3, scope: !103)
!136 = !DILocation(line: 475, column: 16, scope: !103)
!137 = !DILocation(line: 476, column: 3, scope: !103)
!138 = !DILocation(line: 477, column: 10, scope: !103)
!139 = distinct !DISubprogram(name: "join", linkageName: "std.os.process.SubProcess.join", scope: !2, file: !2, line: 340, type: !140, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!140 = !DISubroutineType(types: !141)
!141 = !{!69, !142, !26}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CInt*", baseType: !113, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DILocation(line: 341, column: 1, scope: !139)
!144 = !DILocalVariable(name: "self", arg: 1, scope: !139, file: !2, line: 340, type: !26)
!145 = !DILocation(line: 340, column: 26, scope: !139)
!146 = !DILocation(line: 342, column: 6, scope: !139)
!147 = !DILocation(line: 344, column: 16, scope: !148)
!148 = distinct !DILexicalBlock(scope: !139, file: !2, line: 343, column: 2)
!149 = !DILocation(line: 344, column: 3, scope: !148)
!150 = !DILocation(line: 345, column: 3, scope: !148)
!151 = !DILocation(line: 345, column: 21, scope: !148)
!152 = !DILocalVariable(name: "status", scope: !139, file: !2, line: 347, type: !113, align: 4)
!153 = !DILocation(line: 347, column: 7, scope: !139)
!154 = !DILocation(line: 348, column: 6, scope: !139)
!155 = !DILocation(line: 348, column: 20, scope: !139)
!156 = !DILocation(line: 348, column: 49, scope: !139)
!157 = !DILocation(line: 348, column: 70, scope: !139)
!158 = !DILocation(line: 348, column: 34, scope: !139)
!159 = !DILocation(line: 348, column: 81, scope: !139)
!160 = !DILocation(line: 350, column: 2, scope: !139)
!161 = !DILocation(line: 350, column: 15, scope: !139)
!162 = !DILocation(line: 351, column: 2, scope: !139)
!163 = !DILocation(line: 351, column: 18, scope: !139)
!164 = !DILocation(line: 353, column: 9, scope: !139)
!165 = !DILocation(line: 44, column: 37, scope: !166, inlinedAt: !167)
!166 = distinct !DISubprogram(name: "wTERMSIG", linkageName: "wTERMSIG", scope: !127, file: !127, line: 44, scopeLine: 44, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!167 = !DILocation(line: 46, column: 38, scope: !168, inlinedAt: !169)
!168 = distinct !DISubprogram(name: "wIFEXITED", linkageName: "wIFEXITED", scope: !127, file: !127, line: 46, scopeLine: 46, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!169 = !DILocation(line: 353, column: 30, scope: !139)
!170 = !DILocation(line: 43, column: 41, scope: !171, inlinedAt: !172)
!171 = distinct !DISubprogram(name: "wEXITSTATUS", linkageName: "wEXITSTATUS", scope: !127, file: !127, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!172 = !DILocation(line: 353, column: 57, scope: !139)
!173 = !DILocation(line: 353, column: 86, scope: !139)
!174 = distinct !DISubprogram(name: "execute_stdout_to_buffer", linkageName: "std.os.process.execute_stdout_to_buffer", scope: !2, file: !2, line: 271, type: !175, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!175 = !DISubroutineType(types: !176)
!176 = !{!69, !177, !179, !183, !34, !183}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !180, identifier: "char[]")
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !179, baseType: !5, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, baseType: !82, size: 64, align: 64, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !184, identifier: "String[]")
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !183, baseType: !177, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !183, baseType: !82, size: 64, align: 64, offset: 64)
!187 = !DILocalVariable(name: "buffer", arg: 1, scope: !174, file: !2, line: 271, type: !179)
!188 = !DILocation(line: 271, column: 44, scope: !174)
!189 = !DILocalVariable(name: "command_line", arg: 2, scope: !174, file: !2, line: 271, type: !183)
!190 = !DILocation(line: 271, column: 61, scope: !174)
!191 = !DILocalVariable(name: "options", arg: 3, scope: !174, file: !2, line: 271, type: !34)
!192 = !DILocation(line: 271, column: 93, scope: !174)
!193 = !DILocalVariable(name: "environment", arg: 4, scope: !174, file: !2, line: 271, type: !183)
!194 = !DILocation(line: 271, column: 116, scope: !174)
!195 = !DILocalVariable(name: "process", scope: !174, file: !2, line: 273, type: !27, align: 8)
!196 = !DILocation(line: 273, column: 13, scope: !174)
!197 = !DILocation(line: 273, column: 23, scope: !174)
!198 = !DILocation(line: 274, column: 2, scope: !174)
!199 = !DILocalVariable(name: "len", scope: !174, file: !2, line: 275, type: !82, align: 8)
!200 = !DILocation(line: 275, column: 6, scope: !174)
!201 = !DILocation(line: 275, column: 44, scope: !174)
!202 = !DILocation(line: 275, column: 12, scope: !174)
!203 = !DILocation(line: 276, column: 17, scope: !174)
!204 = !DILocation(line: 276, column: 24, scope: !174)
!205 = !DILocation(line: 276, column: 25, scope: !174)
!206 = !DILocation(line: 276, column: 10, scope: !174)
!207 = distinct !DISubprogram(name: "tcopy_command_line", linkageName: "std.os.process.tcopy_command_line", scope: !2, file: !2, line: 247, type: !208, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16, retainedNodes: !38)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !183}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ZString*", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!211 = !DILocalVariable(name: "command_line", arg: 1, scope: !207, file: !2, line: 247, type: !183)
!212 = !DILocation(line: 247, column: 41, scope: !207)
!213 = !DILocation(line: 245, column: 11, scope: !214)
!214 = distinct !DILexicalBlock(scope: !207, file: !2, line: 248, column: 1)
!215 = !DILocalVariable(name: "copy", scope: !207, file: !2, line: 249, type: !210, align: 8)
!216 = !DILocation(line: 249, column: 11, scope: !207)
!217 = !DILocation(line: 249, column: 49, scope: !207)
!218 = !DILocation(line: 820, column: 41, scope: !219, inlinedAt: !221)
!219 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !220, file: !220, line: 818, scopeLine: 818, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!220 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!221 = !DILocation(line: 249, column: 18, scope: !207)
!222 = !DILocation(line: 820, column: 26, scope: !219, inlinedAt: !221)
!223 = !DILocation(line: 820, column: 18, scope: !219, inlinedAt: !221)
!224 = !DILocation(line: 820, column: 68, scope: !219, inlinedAt: !221)
!225 = !DILocation(line: 250, column: 20, scope: !226)
!226 = distinct !DILexicalBlock(scope: !207, file: !2, line: 250, column: 2)
!227 = !DILocalVariable(name: ".temp", scope: !226, file: !2, line: 250, type: !82, align: 8)
!228 = !DILocation(line: 250, column: 11, scope: !226)
!229 = !DILocalVariable(name: "i", scope: !230, file: !2, line: 250, type: !82, align: 8)
!230 = distinct !DILexicalBlock(scope: !226, file: !2, line: 251, column: 2)
!231 = !DILocation(line: 250, column: 11, scope: !230)
!232 = !DILocalVariable(name: "str", scope: !230, file: !2, line: 250, type: !178, align: 8)
!233 = !DILocation(line: 250, column: 14, scope: !230)
!234 = !DILocation(line: 250, column: 20, scope: !230)
!235 = !DILocation(line: 252, column: 3, scope: !236)
!236 = distinct !DILexicalBlock(scope: !230, file: !2, line: 251, column: 2)
!237 = !DILocation(line: 252, column: 8, scope: !236)
!238 = !DILocation(line: 252, column: 13, scope: !236)
!239 = !DILocation(line: 254, column: 2, scope: !207)
!240 = !DILocation(line: 254, column: 7, scope: !207)
!241 = !DILocation(line: 254, column: 27, scope: !207)
!242 = !DILocation(line: 255, column: 9, scope: !207)
!243 = distinct !DISubprogram(name: "tcopy_env", linkageName: "std.os.process.tcopy_env", scope: !2, file: !2, line: 259, type: !208, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16, retainedNodes: !38)
!244 = !DILocalVariable(name: "environment", arg: 1, scope: !243, file: !2, line: 259, type: !183)
!245 = !DILocation(line: 259, column: 32, scope: !243)
!246 = !DILocation(line: 261, column: 6, scope: !243)
!247 = !DILocation(line: 261, column: 31, scope: !243)
!248 = !DILocalVariable(name: "copy", scope: !243, file: !2, line: 262, type: !210, align: 8)
!249 = !DILocation(line: 262, column: 11, scope: !243)
!250 = !DILocation(line: 262, column: 49, scope: !243)
!251 = !DILocation(line: 820, column: 41, scope: !252, inlinedAt: !253)
!252 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !220, file: !220, line: 818, scopeLine: 818, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!253 = !DILocation(line: 262, column: 18, scope: !243)
!254 = !DILocation(line: 820, column: 26, scope: !252, inlinedAt: !253)
!255 = !DILocation(line: 820, column: 18, scope: !252, inlinedAt: !253)
!256 = !DILocation(line: 820, column: 68, scope: !252, inlinedAt: !253)
!257 = !DILocation(line: 263, column: 2, scope: !243)
!258 = !DILocation(line: 263, column: 7, scope: !243)
!259 = !DILocation(line: 263, column: 26, scope: !243)
!260 = !DILocation(line: 264, column: 20, scope: !261)
!261 = distinct !DILexicalBlock(scope: !243, file: !2, line: 264, column: 2)
!262 = !DILocalVariable(name: ".temp", scope: !261, file: !2, line: 264, type: !82, align: 8)
!263 = !DILocation(line: 264, column: 11, scope: !261)
!264 = !DILocalVariable(name: "i", scope: !265, file: !2, line: 264, type: !82, align: 8)
!265 = distinct !DILexicalBlock(scope: !261, file: !2, line: 265, column: 2)
!266 = !DILocation(line: 264, column: 11, scope: !265)
!267 = !DILocalVariable(name: "str", scope: !265, file: !2, line: 264, type: !178, align: 8)
!268 = !DILocation(line: 264, column: 14, scope: !265)
!269 = !DILocation(line: 264, column: 20, scope: !265)
!270 = !DILocation(line: 266, column: 3, scope: !271)
!271 = distinct !DILexicalBlock(scope: !265, file: !2, line: 265, column: 2)
!272 = !DILocation(line: 266, column: 8, scope: !271)
!273 = !DILocation(line: 266, column: 13, scope: !271)
!274 = !DILocation(line: 268, column: 9, scope: !243)
!275 = distinct !DISubprogram(name: "create", linkageName: "std.os.process.create", scope: !2, file: !2, line: 282, type: !276, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !38)
!276 = !DISubroutineType(types: !277)
!277 = !{!69, !26, !183, !34, !183}
!278 = !DILocalVariable(name: "command_line", arg: 1, scope: !275, file: !2, line: 282, type: !183)
!279 = !DILocation(line: 282, column: 32, scope: !275)
!280 = !DILocalVariable(name: "options", arg: 2, scope: !275, file: !2, line: 282, type: !34)
!281 = !DILocation(line: 282, column: 64, scope: !275)
!282 = !DILocalVariable(name: "environment", arg: 3, scope: !275, file: !2, line: 282, type: !183)
!283 = !DILocation(line: 282, column: 87, scope: !275)
!284 = !DILocation(line: 280, column: 12, scope: !285)
!285 = distinct !DILexicalBlock(scope: !275, file: !2, line: 283, column: 1)
!286 = !DILocation(line: 280, column: 28, scope: !285)
!287 = !DILocation(line: 280, column: 11, scope: !285)
!288 = !DILocalVariable(name: "stdinfd", scope: !275, file: !2, line: 284, type: !289, align: 4)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, align: 32, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2, lowerBound: 0)
!292 = !DILocation(line: 284, column: 10, scope: !275)
!293 = !DILocalVariable(name: "stdoutfd", scope: !275, file: !2, line: 285, type: !289, align: 4)
!294 = !DILocation(line: 285, column: 10, scope: !275)
!295 = !DILocalVariable(name: "stderrfd", scope: !275, file: !2, line: 286, type: !289, align: 4)
!296 = !DILocation(line: 286, column: 10, scope: !275)
!297 = !DILocation(line: 288, column: 6, scope: !275)
!298 = !DILocation(line: 288, column: 36, scope: !275)
!299 = !DILocation(line: 289, column: 6, scope: !275)
!300 = !DILocation(line: 289, column: 37, scope: !275)
!301 = !DILocation(line: 290, column: 7, scope: !275)
!302 = !DILocation(line: 290, column: 41, scope: !275)
!303 = !DILocation(line: 290, column: 72, scope: !275)
!304 = !DILocalVariable(name: "actions", scope: !275, file: !2, line: 292, type: !305, align: 8)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_spawn_file_actions_t", scope: !2, file: !2, line: 4, size: 640, align: 64, elements: !306, identifier: "std.os.posix.Posix_spawn_file_actions_t")
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__allocated", scope: !305, file: !2, line: 6, baseType: !34, size: 32, align: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__used", scope: !305, file: !2, line: 7, baseType: !34, size: 32, align: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__actions", scope: !305, file: !2, line: 8, baseType: !25, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__pad", scope: !305, file: !2, line: 9, baseType: !311, size: 512, align: 32, offset: 128)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, align: 32, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16, lowerBound: 0)
!314 = !DILocation(line: 292, column: 29, scope: !275)
!315 = !DILocation(line: 293, column: 6, scope: !275)
!316 = !DILocation(line: 293, column: 55, scope: !275)
!317 = !DILocation(line: 295, column: 59, scope: !275)
!318 = !DILocation(line: 295, column: 6, scope: !275)
!319 = !DILocation(line: 294, column: 8, scope: !320)
!320 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!321 = !DILocation(line: 296, column: 62, scope: !275)
!322 = !DILocation(line: 296, column: 6, scope: !275)
!323 = !DILocation(line: 294, column: 8, scope: !324)
!324 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!325 = !DILocation(line: 297, column: 60, scope: !275)
!326 = !DILocation(line: 297, column: 6, scope: !275)
!327 = !DILocation(line: 294, column: 8, scope: !328)
!328 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!329 = !DILocation(line: 298, column: 59, scope: !275)
!330 = !DILocation(line: 298, column: 63, scope: !275)
!331 = !DILocation(line: 298, column: 6, scope: !275)
!332 = !DILocation(line: 294, column: 8, scope: !333)
!333 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!334 = !DILocation(line: 299, column: 6, scope: !275)
!335 = !DILocation(line: 301, column: 7, scope: !336)
!336 = distinct !DILexicalBlock(scope: !275, file: !2, line: 300, column: 2)
!337 = !DILocation(line: 294, column: 8, scope: !338)
!338 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!339 = !DILocation(line: 305, column: 61, scope: !340)
!340 = distinct !DILexicalBlock(scope: !275, file: !2, line: 304, column: 2)
!341 = !DILocation(line: 305, column: 7, scope: !340)
!342 = !DILocation(line: 294, column: 8, scope: !343)
!343 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!344 = !DILocation(line: 306, column: 60, scope: !340)
!345 = !DILocation(line: 306, column: 64, scope: !340)
!346 = !DILocation(line: 306, column: 7, scope: !340)
!347 = !DILocation(line: 294, column: 8, scope: !348)
!348 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!349 = !DILocalVariable(name: "child", scope: !275, file: !2, line: 308, type: !33, align: 4)
!350 = !DILocation(line: 308, column: 8, scope: !275)
!351 = !DILocalVariable(name: "current", scope: !352, file: !2, line: 592, type: !353, align: 8)
!352 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !220, file: !220, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16, retainedNodes: !38)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !354, size: 64, align: 64, dwarfAddressSpace: 0)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !355, identifier: "std.core.mem.allocator.TempAllocator")
!355 = !{!356, !362, !375, !376, !377}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !354, file: !2, line: 12, baseType: !357, size: 128, align: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !358, identifier: "Allocator")
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !357, baseType: !25, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, baseType: !361, size: 64, align: 64, offset: 64)
!361 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !354, file: !2, line: 13, baseType: !363, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !364, size: 64, align: 64, dwarfAddressSpace: 0)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !365, identifier: "std.core.mem.allocator.TempAllocatorPage")
!365 = !{!366, !367, !368, !369, !370, !371}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !364, file: !2, line: 24, baseType: !363, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !364, file: !2, line: 25, baseType: !25, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !364, file: !2, line: 26, baseType: !82, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !364, file: !2, line: 27, baseType: !82, size: 64, align: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !364, file: !2, line: 28, baseType: !82, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !2, line: 29, baseType: !372, align: 8, offset: 320)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, align: 8, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 0, lowerBound: 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !354, file: !2, line: 14, baseType: !82, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !354, file: !2, line: 15, baseType: !82, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !2, line: 16, baseType: !372, align: 8, offset: 320)
!378 = !DILocation(line: 592, column: 17, scope: !352, inlinedAt: !379)
!379 = !DILocation(line: 309, column: 2, scope: !275)
!380 = !DILocation(line: 396, column: 6, scope: !381, inlinedAt: !383)
!381 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !382, file: !382, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !16)
!382 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!383 = !DILocation(line: 592, column: 27, scope: !352, inlinedAt: !379)
!384 = !DILocation(line: 398, column: 3, scope: !385, inlinedAt: !383)
!385 = distinct !DILexicalBlock(scope: !381, file: !382, line: 397, column: 2)
!386 = !DILocation(line: 400, column: 9, scope: !381, inlinedAt: !383)
!387 = !DILocalVariable(name: "mark", scope: !352, file: !2, line: 597, type: !82, align: 8)
!388 = !DILocation(line: 597, column: 6, scope: !352, inlinedAt: !379)
!389 = !DILocation(line: 597, column: 13, scope: !352, inlinedAt: !379)
!390 = !DILocalVariable(name: "command_line_copy", scope: !391, file: !2, line: 311, type: !210, align: 8)
!391 = distinct !DILexicalBlock(scope: !275, file: !2, line: 310, column: 2)
!392 = !DILocation(line: 311, column: 12, scope: !391)
!393 = !DILocation(line: 311, column: 51, scope: !391)
!394 = !DILocation(line: 311, column: 32, scope: !391)
!395 = !DILocalVariable(name: "used_environment", scope: !391, file: !2, line: 312, type: !210, align: 8)
!396 = !DILocation(line: 312, column: 12, scope: !391)
!397 = !DILocation(line: 312, column: 31, scope: !391)
!398 = !DILocation(line: 312, column: 61, scope: !391)
!399 = !DILocation(line: 312, column: 88, scope: !391)
!400 = !DILocation(line: 312, column: 78, scope: !391)
!401 = !DILocation(line: 313, column: 7, scope: !391)
!402 = !DILocation(line: 315, column: 30, scope: !403)
!403 = distinct !DILexicalBlock(scope: !391, file: !2, line: 314, column: 3)
!404 = !DILocation(line: 315, column: 87, scope: !403)
!405 = !DILocation(line: 315, column: 8, scope: !403)
!406 = !DILocation(line: 600, column: 17, scope: !407, inlinedAt: !379)
!407 = distinct !DILexicalBlock(scope: !352, file: !220, line: 599, column: 2)
!408 = !DILocation(line: 600, column: 3, scope: !407, inlinedAt: !379)
!409 = !DILocation(line: 294, column: 8, scope: !410)
!410 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!411 = !DILocation(line: 319, column: 30, scope: !412)
!412 = distinct !DILexicalBlock(scope: !391, file: !2, line: 318, column: 3)
!413 = !DILocation(line: 319, column: 87, scope: !412)
!414 = !DILocation(line: 319, column: 8, scope: !412)
!415 = !DILocation(line: 600, column: 17, scope: !416, inlinedAt: !379)
!416 = distinct !DILexicalBlock(scope: !352, file: !220, line: 599, column: 2)
!417 = !DILocation(line: 600, column: 3, scope: !416, inlinedAt: !379)
!418 = !DILocation(line: 294, column: 8, scope: !419)
!419 = distinct !DILexicalBlock(scope: !275, file: !2, line: 294, column: 8)
!420 = !DILocation(line: 600, column: 17, scope: !421, inlinedAt: !379)
!421 = distinct !DILexicalBlock(scope: !352, file: !220, line: 599, column: 2)
!422 = !DILocation(line: 600, column: 3, scope: !421, inlinedAt: !379)
!423 = !DILocation(line: 322, column: 22, scope: !275)
!424 = !DILocation(line: 322, column: 2, scope: !275)
!425 = !DILocalVariable(name: "stdin", scope: !275, file: !2, line: 323, type: !24, align: 8)
!426 = !DILocation(line: 323, column: 8, scope: !275)
!427 = !DILocation(line: 323, column: 37, scope: !275)
!428 = !DILocation(line: 323, column: 41, scope: !275)
!429 = !DILocation(line: 323, column: 16, scope: !275)
!430 = !DILocation(line: 324, column: 23, scope: !275)
!431 = !DILocation(line: 324, column: 2, scope: !275)
!432 = !DILocalVariable(name: "stdout", scope: !275, file: !2, line: 325, type: !24, align: 8)
!433 = !DILocation(line: 325, column: 8, scope: !275)
