; ModuleID = 'std::core::runtime'
source_filename = "std::core::runtime"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"fn void()[]" = type { ptr, i64 }
%"char[][]" = type { ptr, i64 }
%"TestUnit[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%TestUnit = type { %"char[]", ptr }
%"char[]" = type { ptr, i64 }
%TestContext = type { [25 x i64], %"char[]", i8, i8, i8, i8, %"char[]", ptr, ptr, ptr, i64, %File, %File, %File }
%File = type { ptr }
%TrackingAllocator = type { %any, %HashMap, i64, i64 }
%HashMap = type { %"Entry*[]", %any, i32, i32, float }
%"Entry*[]" = type { ptr, i64 }
%"BenchmarkUnit[]" = type { ptr, i64 }
%BenchmarkUnit = type { %"char[]", ptr }

$std.core.runtime.test_collection_create = comdat any

$std.core.runtime.cmp_test_unit = comdat any

$std.core.runtime.default_test_runner = comdat any

$std.core.runtime.benchmark_collection_create = comdat any

$std.core.runtime.set_benchmark_warmup_iterations = comdat any

$std.core.runtime.set_benchmark_max_iterations = comdat any

$std.core.runtime.default_benchmark_runner = comdat any

$std.core.runtime.run_benchmarks = comdat any

$.dyn_search = comdat any

$"$ct.std.core.runtime.AnyRaw" = comdat any

$"$ct.std.core.runtime.SliceRaw" = comdat any

$"$ct.std.core.runtime.TestContext" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "test_context", linkageName: "std.core.runtime.test_context", scope: !2, file: !2, line: 12, type: !3, isLocal: true, isDefinition: true, align: 8)
!2 = !DIFile(filename: "runtime_test.c3", directory: "/usr/local/lib/c3/std/core")
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestContext*", baseType: !4, size: 64, align: 64, dwarfAddressSpace: 0)
!4 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestContext", scope: !2, file: !2, line: 14, size: 2368, align: 64, elements: !5, identifier: "std.core.runtime.TestContext")
!5 = !{!6, !12, !21, !23, !24, !25, !26, !27, !32, !33, !34, !35, !41, !42}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !4, file: !2, line: 16, baseType: !7, size: 1600, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "JmpBuf", scope: !2, file: !2, line: 36, baseType: !8, align: 8)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1600, align: 64, elements: !10)
!9 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!10 = !{!11}
!11 = !DISubrange(count: 25, lowerBound: 0)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "test_filter", scope: !4, file: !2, line: 18, baseType: !13, size: 128, align: 64, offset: 1600)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !15, identifier: "char[]")
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !14, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !14, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !9)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "breakpoint_on_assert", scope: !4, file: !2, line: 20, baseType: !22, size: 8, align: 8, offset: 1728)
!22 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "assert_print_backtrace", scope: !4, file: !2, line: 23, baseType: !22, size: 8, align: 8, offset: 1736)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "has_ansi_codes", scope: !4, file: !2, line: 24, baseType: !22, size: 8, align: 8, offset: 1744)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "is_in_panic", scope: !4, file: !2, line: 25, baseType: !22, size: 8, align: 8, offset: 1752)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "current_test_name", scope: !4, file: !2, line: 26, baseType: !13, size: 128, align: 64, offset: 1792)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "setup_fn", scope: !4, file: !2, line: 27, baseType: !28, size: 64, align: 64, offset: 1920)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "TestFn", scope: !2, file: !2, line: 10, baseType: !29, align: 8)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DISubroutineType(types: !31)
!31 = !{null}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "teardown_fn", scope: !4, file: !2, line: 28, baseType: !28, size: 64, align: 64, offset: 1984)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer", scope: !4, file: !2, line: 30, baseType: !17, size: 64, align: 64, offset: 2048)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "error_buffer_capacity", scope: !4, file: !2, line: 31, baseType: !20, size: 64, align: 64, offset: 2112)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fake_stdout", scope: !4, file: !2, line: 32, baseType: !36, size: 64, align: 64, offset: 2176)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !4, file: !2, line: 4, size: 64, align: 64, elements: !37, identifier: "std.io.File")
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !36, file: !2, line: 6, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 357, baseType: !40, align: 8)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "orig_stdout", scope: !4, file: !2, line: 33, baseType: !36, size: 64, align: 64, offset: 2240)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "orig_stderr", scope: !4, file: !2, line: 34, baseType: !36, size: 64, align: 64, offset: 2304)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_WARMUP_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_WARMUP_ITERATIONS", scope: !45, file: !45, line: 25, type: !46, isLocal: false, isDefinition: true, align: 4)
!45 = !DIFile(filename: "runtime_benchmark.c3", directory: "/usr/local/lib/c3/std/core")
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "DEFAULT_BENCHMARK_MAX_ITERATIONS", linkageName: "std.core.runtime.DEFAULT_BENCHMARK_MAX_ITERATIONS", scope: !45, file: !45, line: 26, type: !46, isLocal: false, isDefinition: true, align: 4)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "benchmark_warmup_iterations", linkageName: "std.core.runtime.benchmark_warmup_iterations", scope: !45, file: !45, line: 28, type: !51, isLocal: true, isDefinition: true, align: 4)
!51 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "benchmark_max_iterations", linkageName: "std.core.runtime.benchmark_max_iterations", scope: !45, file: !45, line: 29, type: !51, isLocal: true, isDefinition: true, align: 4)
!54 = !{i32 2, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 2, !"wchar_size", i32 4}
!57 = !{i32 4, !"PIE Level", i32 2}
!58 = !{i32 4, !"PIC Level", i32 2}
!59 = !{i32 1, !"uwtable", i32 2}
!60 = !{i32 2, !"frame-pointer", i32 2}
!61 = distinct !DICompileUnit(language: DW_LANG_C11, file: !62, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !63, splitDebugInlining: false)
!62 = !DIFile(filename: "runtime.c3", directory: "/usr/local/lib/c3/std/core")
!63 = !{!0, !43, !47, !49, !52}
!64 = distinct !DISubprogram(name: "test_collection_create", linkageName: "std.core.runtime.test_collection_create", scope: !2, file: !2, line: 43, type: !65, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !81)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !76}
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit[]", size: 128, align: 64, elements: !68, identifier: "TestUnit[]")
!68 = !{!69, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !67, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestUnit*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestUnit", scope: !2, file: !2, line: 37, size: 192, align: 64, elements: !72, identifier: "std.core.runtime.TestUnit")
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !2, line: 39, baseType: !13, size: 128, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !71, file: !2, line: 40, baseType: !28, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, baseType: !20, size: 64, align: 64, offset: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !77, identifier: "Allocator")
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !76, baseType: !40, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!81 = !{}
!82 = !DILocalVariable(name: "allocator", arg: 1, scope: !64, file: !2, line: 43, type: !76)
!83 = !DILocation(line: 43, column: 48, scope: !64)
!84 = !DILocalVariable(name: "fns", scope: !64, file: !2, line: 45, type: !85, align: 8)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "TestFn[]", size: 128, align: 64, elements: !86, identifier: "TestFn[]")
!86 = !{!87, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !85, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TestFn*", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, baseType: !20, size: 64, align: 64, offset: 64)
!90 = !DILocation(line: 45, column: 11, scope: !64)
!91 = !DILocation(line: 45, column: 17, scope: !64)
!92 = !DILocalVariable(name: "names", scope: !64, file: !2, line: 46, type: !93, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !94, identifier: "String[]")
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !93, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !93, baseType: !20, size: 64, align: 64, offset: 64)
!98 = !DILocation(line: 46, column: 11, scope: !64)
!99 = !DILocation(line: 46, column: 19, scope: !64)
!100 = !DILocalVariable(name: "tests", scope: !64, file: !2, line: 47, type: !67, align: 8)
!101 = !DILocation(line: 47, column: 13, scope: !64)
!102 = !DILocation(line: 47, column: 65, scope: !64)
!103 = !DILocation(line: 286, column: 55, scope: !104, inlinedAt: !106)
!104 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !105, file: !105, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!105 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!106 = !DILocation(line: 269, column: 9, scope: !107, inlinedAt: !108)
!107 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !105, file: !105, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!108 = !DILocation(line: 47, column: 21, scope: !64)
!109 = !DILocation(line: 286, column: 40, scope: !104, inlinedAt: !106)
!110 = !DILocation(line: 62, column: 6, scope: !111, inlinedAt: !112)
!111 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !105, file: !105, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!112 = !DILocation(line: 286, column: 18, scope: !104, inlinedAt: !106)
!113 = !DILocation(line: 62, column: 20, scope: !111, inlinedAt: !112)
!114 = !DILocation(line: 28, column: 71, scope: !115, inlinedAt: !116)
!115 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !105, file: !105, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!116 = !DILocation(line: 68, column: 10, scope: !111, inlinedAt: !112)
!117 = !DILocation(line: 286, column: 67, scope: !104, inlinedAt: !106)
!118 = !DILocation(line: 48, column: 21, scope: !119)
!119 = distinct !DILexicalBlock(scope: !64, file: !2, line: 48, column: 2)
!120 = !DILocalVariable(name: ".temp", scope: !119, file: !2, line: 48, type: !20, align: 8)
!121 = !DILocation(line: 48, column: 11, scope: !119)
!122 = !DILocalVariable(name: "i", scope: !123, file: !2, line: 48, type: !20, align: 8)
!123 = distinct !DILexicalBlock(scope: !119, file: !2, line: 49, column: 2)
!124 = !DILocation(line: 48, column: 11, scope: !123)
!125 = !DILocalVariable(name: "test", scope: !123, file: !2, line: 48, type: !29, align: 8)
!126 = !DILocation(line: 48, column: 14, scope: !123)
!127 = !DILocation(line: 48, column: 21, scope: !123)
!128 = !DILocation(line: 50, column: 3, scope: !129)
!129 = distinct !DILexicalBlock(scope: !123, file: !2, line: 49, column: 2)
!130 = !DILocation(line: 50, column: 9, scope: !129)
!131 = !DILocation(line: 50, column: 16, scope: !129)
!132 = !DILocation(line: 50, column: 22, scope: !129)
!133 = !DILocation(line: 50, column: 26, scope: !129)
!134 = !DILocation(line: 50, column: 30, scope: !129)
!135 = !DILocation(line: 52, column: 9, scope: !64)
!136 = distinct !DISubprogram(name: "cmp_test_unit", linkageName: "std.core.runtime.cmp_test_unit", scope: !2, file: !2, line: 56, type: !137, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !81)
!137 = !DISubroutineType(types: !138)
!138 = !{!46, !71, !71}
!139 = !DILocalVariable(name: "a", arg: 1, scope: !136, file: !2, line: 56, type: !71)
!140 = !DILocation(line: 56, column: 31, scope: !136)
!141 = !DILocalVariable(name: "b", arg: 2, scope: !136, file: !2, line: 56, type: !71)
!142 = !DILocation(line: 56, column: 43, scope: !136)
!143 = !DILocalVariable(name: "an", scope: !136, file: !2, line: 58, type: !20, align: 8)
!144 = !DILocation(line: 58, column: 6, scope: !136)
!145 = !DILocation(line: 58, column: 11, scope: !136)
!146 = !DILocalVariable(name: "bn", scope: !136, file: !2, line: 59, type: !20, align: 8)
!147 = !DILocation(line: 59, column: 6, scope: !136)
!148 = !DILocation(line: 59, column: 11, scope: !136)
!149 = !DILocation(line: 60, column: 6, scope: !136)
!150 = !DILocation(line: 60, column: 11, scope: !136)
!151 = !DILocalVariable(name: "temp", scope: !152, file: !2, line: 45, type: !71, align: 8)
!152 = distinct !DISubprogram(name: "@swap", linkageName: "@swap", scope: !153, file: !153, line: 43, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!153 = !DIFile(filename: "builtin.c3", directory: "/usr/local/lib/c3/std/core")
!154 = !DILocation(line: 45, column: 6, scope: !152, inlinedAt: !155)
!155 = !DILocation(line: 60, column: 15, scope: !136)
!156 = !DILocation(line: 45, column: 13, scope: !152, inlinedAt: !155)
!157 = !DILocation(line: 46, column: 7, scope: !152, inlinedAt: !155)
!158 = !DILocation(line: 47, column: 7, scope: !152, inlinedAt: !155)
!159 = !DILocation(line: 61, column: 19, scope: !160)
!160 = distinct !DILexicalBlock(scope: !136, file: !2, line: 61, column: 2)
!161 = !DILocalVariable(name: ".temp", scope: !160, file: !2, line: 61, type: !20, align: 8)
!162 = !DILocation(line: 61, column: 11, scope: !160)
!163 = !DILocalVariable(name: "i", scope: !164, file: !2, line: 61, type: !20, align: 8)
!164 = distinct !DILexicalBlock(scope: !160, file: !2, line: 62, column: 2)
!165 = !DILocation(line: 61, column: 11, scope: !164)
!166 = !DILocalVariable(name: "ac", scope: !164, file: !2, line: 61, type: !18, align: 1)
!167 = !DILocation(line: 61, column: 14, scope: !164)
!168 = !DILocation(line: 61, column: 19, scope: !164)
!169 = !DILocalVariable(name: "bc", scope: !170, file: !2, line: 63, type: !18, align: 1)
!170 = distinct !DILexicalBlock(scope: !164, file: !2, line: 62, column: 2)
!171 = !DILocation(line: 63, column: 8, scope: !170)
!172 = !DILocation(line: 63, column: 13, scope: !170)
!173 = !DILocation(line: 63, column: 20, scope: !170)
!174 = !DILocation(line: 64, column: 7, scope: !170)
!175 = !DILocation(line: 64, column: 13, scope: !170)
!176 = !DILocation(line: 64, column: 24, scope: !170)
!177 = !DILocation(line: 64, column: 29, scope: !170)
!178 = !DILocation(line: 64, column: 34, scope: !170)
!179 = !DILocation(line: 64, column: 39, scope: !170)
!180 = !DILocation(line: 64, column: 44, scope: !170)
!181 = !DILocation(line: 64, column: 49, scope: !170)
!182 = !DILocation(line: 66, column: 15, scope: !136)
!183 = !DILocation(line: 66, column: 20, scope: !136)
!184 = !DILocation(line: 66, column: 10, scope: !136)
!185 = distinct !DISubprogram(name: "terminal_has_ansi_codes", linkageName: "std.core.runtime.terminal_has_ansi_codes", scope: !2, file: !2, line: 69, type: !186, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!186 = !DISubroutineType(types: !187)
!187 = !{!22}
!188 = !DILocalVariable(name: "current", scope: !189, file: !2, line: 592, type: !191, align: 8)
!189 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !190, file: !190, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!190 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !192, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !193, identifier: "std.core.mem.allocator.TempAllocator")
!193 = !{!194, !195, !208, !209, !210}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !192, file: !2, line: 12, baseType: !76, size: 128, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !192, file: !2, line: 13, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !197, size: 64, align: 64, dwarfAddressSpace: 0)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !198, identifier: "std.core.mem.allocator.TempAllocatorPage")
!198 = !{!199, !200, !201, !202, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !197, file: !2, line: 24, baseType: !196, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !197, file: !2, line: 25, baseType: !40, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !197, file: !2, line: 26, baseType: !20, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !2, line: 27, baseType: !20, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !197, file: !2, line: 28, baseType: !20, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !2, line: 29, baseType: !205, align: 8, offset: 320)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 0, lowerBound: 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !192, file: !2, line: 14, baseType: !20, size: 64, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !192, file: !2, line: 15, baseType: !20, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !2, line: 16, baseType: !205, align: 8, offset: 320)
!211 = !DILocation(line: 592, column: 17, scope: !189, inlinedAt: !212)
!212 = !DILocation(line: 69, column: 45, scope: !185)
!213 = !DILocation(line: 396, column: 6, scope: !214, inlinedAt: !215)
!214 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !105, file: !105, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!215 = !DILocation(line: 592, column: 27, scope: !189, inlinedAt: !212)
!216 = !DILocation(line: 398, column: 3, scope: !217, inlinedAt: !215)
!217 = distinct !DILexicalBlock(scope: !214, file: !105, line: 397, column: 2)
!218 = !DILocation(line: 400, column: 9, scope: !214, inlinedAt: !215)
!219 = !DILocalVariable(name: "mark", scope: !189, file: !2, line: 597, type: !20, align: 8)
!220 = !DILocation(line: 597, column: 6, scope: !189, inlinedAt: !212)
!221 = !DILocation(line: 597, column: 13, scope: !189, inlinedAt: !212)
!222 = !DILocalVariable(name: "v", scope: !223, file: !2, line: 72, type: !13, align: 8)
!223 = distinct !DILexicalBlock(scope: !185, file: !2, line: 70, column: 1)
!224 = !DILocation(line: 72, column: 10, scope: !223)
!225 = !DILocation(line: 72, column: 14, scope: !223)
!226 = !DILocation(line: 74, column: 18, scope: !227)
!227 = distinct !DILexicalBlock(scope: !223, file: !2, line: 73, column: 2)
!228 = !DILocation(line: 74, column: 7, scope: !227)
!229 = !DILocation(line: 74, column: 41, scope: !227)
!230 = !DILocation(line: 74, column: 30, scope: !227)
!231 = !DILocation(line: 74, column: 64, scope: !227)
!232 = !DILocation(line: 74, column: 53, scope: !227)
!233 = !DILocation(line: 600, column: 17, scope: !234, inlinedAt: !212)
!234 = distinct !DILexicalBlock(scope: !189, file: !190, line: 599, column: 2)
!235 = !DILocation(line: 600, column: 3, scope: !234, inlinedAt: !212)
!236 = !DILocation(line: 603, column: 9, scope: !234, inlinedAt: !212)
!237 = !DILocation(line: 79, column: 10, scope: !223)
!238 = !DILocation(line: 600, column: 17, scope: !239, inlinedAt: !212)
!239 = distinct !DILexicalBlock(scope: !189, file: !190, line: 599, column: 2)
!240 = !DILocation(line: 600, column: 3, scope: !239, inlinedAt: !212)
!241 = !DILocation(line: 603, column: 9, scope: !239, inlinedAt: !212)
!242 = distinct !DISubprogram(name: "test_panic", linkageName: "std.core.runtime.test_panic", scope: !2, file: !2, line: 83, type: !243, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !13, !13, !13, !51}
!245 = !DILocalVariable(name: "message", arg: 1, scope: !242, file: !2, line: 83, type: !13)
!246 = !DILocation(line: 83, column: 27, scope: !242)
!247 = !DILocalVariable(name: "file", arg: 2, scope: !242, file: !2, line: 83, type: !13)
!248 = !DILocation(line: 83, column: 43, scope: !242)
!249 = !DILocalVariable(name: "function", arg: 3, scope: !242, file: !2, line: 83, type: !13)
!250 = !DILocation(line: 83, column: 56, scope: !242)
!251 = !DILocalVariable(name: "line", arg: 4, scope: !242, file: !2, line: 83, type: !51)
!252 = !DILocation(line: 83, column: 71, scope: !242)
!253 = !DILocation(line: 85, column: 6, scope: !242)
!254 = !DILocation(line: 85, column: 38, scope: !242)
!255 = !DILocation(line: 86, column: 2, scope: !242)
!256 = !DILocation(line: 86, column: 29, scope: !242)
!257 = !DILocation(line: 88, column: 2, scope: !242)
!258 = !DILocation(line: 89, column: 8, scope: !242)
!259 = !DILocation(line: 89, column: 3, scope: !242)
!260 = !DILocation(line: 90, column: 6, scope: !242)
!261 = !DILocation(line: 93, column: 41, scope: !262)
!262 = distinct !DILexicalBlock(scope: !242, file: !2, line: 91, column: 2)
!263 = !DILocation(line: 93, column: 7, scope: !262)
!264 = !DILocation(line: 96, column: 50, scope: !242)
!265 = !DILocation(line: 96, column: 56, scope: !242)
!266 = !DILocation(line: 96, column: 62, scope: !242)
!267 = !DILocation(line: 96, column: 2, scope: !242)
!268 = !DILocation(line: 97, column: 2, scope: !242)
!269 = !DILocation(line: 97, column: 40, scope: !242)
!270 = !DILocation(line: 99, column: 6, scope: !242)
!271 = !DILocation(line: 184, column: 2, scope: !272, inlinedAt: !273)
!272 = distinct !DISubprogram(name: "breakpoint", linkageName: "breakpoint", scope: !153, file: !153, line: 182, scopeLine: 182, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!273 = !DILocation(line: 101, column: 3, scope: !274)
!274 = distinct !DILexicalBlock(scope: !242, file: !2, line: 100, column: 2)
!275 = !DILocation(line: 104, column: 6, scope: !242)
!276 = !DILocation(line: 106, column: 3, scope: !277)
!277 = distinct !DILexicalBlock(scope: !242, file: !2, line: 105, column: 2)
!278 = !DILocation(line: 109, column: 2, scope: !242)
!279 = !DILocation(line: 109, column: 29, scope: !242)
!280 = !DILocation(line: 110, column: 17, scope: !242)
!281 = !DILocation(line: 110, column: 2, scope: !242)
!282 = distinct !DISubprogram(name: "mute_output", linkageName: "std.core.runtime.mute_output", scope: !2, file: !2, line: 113, type: !30, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!283 = !DILocation(line: 115, column: 7, scope: !282)
!284 = !DILocation(line: 115, column: 44, scope: !282)
!285 = !DILocation(line: 116, column: 10, scope: !282)
!286 = !DILocation(line: 116, column: 9, scope: !282)
!287 = !DILocation(line: 117, column: 10, scope: !282)
!288 = !DILocation(line: 117, column: 9, scope: !282)
!289 = !DILocalVariable(name: "stdout", scope: !282, file: !2, line: 119, type: !290, align: 8)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "File*", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DILocation(line: 119, column: 8, scope: !282)
!292 = !DILocation(line: 119, column: 17, scope: !282)
!293 = !DILocalVariable(name: "stderr", scope: !282, file: !2, line: 120, type: !290, align: 8)
!294 = !DILocation(line: 120, column: 8, scope: !282)
!295 = !DILocation(line: 120, column: 17, scope: !282)
!296 = !DILocation(line: 122, column: 2, scope: !282)
!297 = !DILocation(line: 122, column: 30, scope: !282)
!298 = !DILocation(line: 123, column: 2, scope: !282)
!299 = !DILocation(line: 123, column: 30, scope: !282)
!300 = !DILocation(line: 125, column: 3, scope: !282)
!301 = !DILocation(line: 125, column: 12, scope: !282)
!302 = !DILocation(line: 126, column: 3, scope: !282)
!303 = !DILocation(line: 126, column: 12, scope: !282)
!304 = !DILocation(line: 128, column: 8, scope: !282)
!305 = !DILocation(line: 128, column: 3, scope: !282)
!306 = distinct !DISubprogram(name: "unmute_output", linkageName: "std.core.runtime.unmute_output", scope: !2, file: !2, line: 131, type: !307, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !22}
!309 = !DILocalVariable(name: "has_error", arg: 1, scope: !306, file: !2, line: 131, type: !22)
!310 = !DILocation(line: 131, column: 28, scope: !306)
!311 = !DILocation(line: 133, column: 7, scope: !306)
!312 = !DILocation(line: 135, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !306, file: !2, line: 134, column: 2)
!314 = !DILocation(line: 137, column: 9, scope: !306)
!315 = !DILocation(line: 138, column: 9, scope: !306)
!316 = !DILocalVariable(name: "stdout", scope: !306, file: !2, line: 140, type: !290, align: 8)
!317 = !DILocation(line: 140, column: 8, scope: !306)
!318 = !DILocation(line: 140, column: 17, scope: !306)
!319 = !DILocalVariable(name: "stderr", scope: !306, file: !2, line: 141, type: !290, align: 8)
!320 = !DILocation(line: 141, column: 8, scope: !306)
!321 = !DILocation(line: 141, column: 17, scope: !306)
!322 = !DILocation(line: 143, column: 3, scope: !306)
!323 = !DILocation(line: 143, column: 12, scope: !306)
!324 = !DILocation(line: 144, column: 3, scope: !306)
!325 = !DILocation(line: 144, column: 12, scope: !306)
!326 = !DILocation(line: 145, column: 2, scope: !306)
!327 = !DILocation(line: 145, column: 34, scope: !306)
!328 = !DILocation(line: 146, column: 2, scope: !306)
!329 = !DILocation(line: 146, column: 34, scope: !306)
!330 = !DILocalVariable(name: "log_size", scope: !306, file: !2, line: 148, type: !20, align: 8)
!331 = !DILocation(line: 148, column: 6, scope: !306)
!332 = !DILocation(line: 148, column: 17, scope: !306)
!333 = !DILocation(line: 149, column: 6, scope: !306)
!334 = !DILocation(line: 151, column: 14, scope: !335)
!335 = distinct !DILexicalBlock(scope: !306, file: !2, line: 150, column: 2)
!336 = !DILocation(line: 151, column: 68, scope: !335)
!337 = !DILocation(line: 200, column: 16, scope: !338, inlinedAt: !340)
!338 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !339, file: !339, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!339 = !DIFile(filename: "io.c3", directory: "/usr/local/lib/c3/std/io")
!340 = !DILocation(line: 151, column: 3, scope: !335)
!341 = !DILocalVariable(name: "len", scope: !342, file: !2, line: 174, type: !20, align: 8)
!342 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !339, file: !339, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!343 = !DILocation(line: 174, column: 6, scope: !342, inlinedAt: !344)
!344 = !DILocation(line: 200, column: 3, scope: !338, inlinedAt: !340)
!345 = !DILocation(line: 118, column: 24, scope: !346, inlinedAt: !347)
!346 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !339, file: !339, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!347 = !DILocation(line: 174, column: 12, scope: !342, inlinedAt: !344)
!348 = !DILocation(line: 175, column: 17, scope: !342, inlinedAt: !344)
!349 = !DILocation(line: 175, column: 2, scope: !342, inlinedAt: !344)
!350 = !DILocation(line: 180, column: 4, scope: !342, inlinedAt: !344)
!351 = !DILocation(line: 182, column: 9, scope: !342, inlinedAt: !344)
!352 = !DILocation(line: 154, column: 6, scope: !306)
!353 = !DILocation(line: 154, column: 19, scope: !306)
!354 = !DILocation(line: 156, column: 3, scope: !355)
!355 = distinct !DILexicalBlock(scope: !306, file: !2, line: 155, column: 2)
!356 = !DILocation(line: 157, column: 3, scope: !355)
!357 = !DILocation(line: 158, column: 9, scope: !355)
!358 = !DILocation(line: 158, column: 4, scope: !355)
!359 = !DILocation(line: 160, column: 3, scope: !355)
!360 = !DILocation(line: 161, column: 23, scope: !355)
!361 = !DILocation(line: 161, column: 3, scope: !355)
!362 = !DILocation(line: 162, column: 3, scope: !355)
!363 = !DILocalVariable(name: "c", scope: !364, file: !2, line: 162, type: !18, align: 1)
!364 = distinct !DILexicalBlock(scope: !355, file: !2, line: 162, column: 3)
!365 = !DILocation(line: 162, column: 14, scope: !364)
!366 = !DILocation(line: 162, column: 18, scope: !364)
!367 = !DILocation(line: 164, column: 18, scope: !368, inlinedAt: !369)
!368 = distinct !DISubprogram(name: "@unlikely", linkageName: "@unlikely", scope: !153, file: !153, line: 281, scopeLine: 281, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!369 = !DILocation(line: 164, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !364, file: !2, line: 163, column: 3)
!371 = !DILocation(line: 287, column: 18, scope: !368, inlinedAt: !369)
!372 = !DILocation(line: 287, column: 26, scope: !368, inlinedAt: !369)
!373 = !DILocation(line: 167, column: 5, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !2, line: 165, column: 4)
!375 = !DILocation(line: 169, column: 18, scope: !370)
!376 = !DILocation(line: 169, column: 4, scope: !370)
!377 = !DILocation(line: 171, column: 3, scope: !355)
!378 = !DILocation(line: 173, column: 8, scope: !306)
!379 = !DILocation(line: 173, column: 3, scope: !306)
!380 = distinct !DISubprogram(name: "run_tests", linkageName: "std.core.runtime.run_tests", scope: !2, file: !2, line: 176, type: !381, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!381 = !DISubroutineType(types: !382)
!382 = !{!22, !93, !67}
!383 = !DILocalVariable(name: "args", arg: 1, scope: !380, file: !2, line: 176, type: !93)
!384 = !DILocation(line: 176, column: 28, scope: !380)
!385 = !DILocalVariable(name: "tests", arg: 2, scope: !380, file: !2, line: 176, type: !67)
!386 = !DILocation(line: 176, column: 45, scope: !380)
!387 = !DILocalVariable(name: "max_name", scope: !380, file: !2, line: 178, type: !20, align: 8)
!388 = !DILocation(line: 178, column: 6, scope: !380)
!389 = !DILocalVariable(name: "sort_tests", scope: !380, file: !2, line: 179, type: !22, align: 1)
!390 = !DILocation(line: 179, column: 7, scope: !380)
!391 = !DILocation(line: 179, column: 20, scope: !380)
!392 = !DILocation(line: 180, column: 19, scope: !393)
!393 = distinct !DILexicalBlock(scope: !380, file: !2, line: 180, column: 2)
!394 = !DILocalVariable(name: ".temp", scope: !393, file: !2, line: 180, type: !20, align: 8)
!395 = !DILocalVariable(name: "unit", scope: !396, file: !2, line: 180, type: !70, align: 8)
!396 = distinct !DILexicalBlock(scope: !393, file: !2, line: 181, column: 2)
!397 = !DILocation(line: 180, column: 12, scope: !396)
!398 = !DILocation(line: 180, column: 19, scope: !396)
!399 = !DILocation(line: 182, column: 7, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !2, line: 181, column: 2)
!401 = !DILocation(line: 182, column: 18, scope: !400)
!402 = !DILocation(line: 182, column: 44, scope: !400)
!403 = !DILocalVariable(name: "context", scope: !380, file: !2, line: 184, type: !4, align: 8)
!404 = !DILocation(line: 184, column: 14, scope: !380)
!405 = !DILocation(line: 186, column: 29, scope: !380)
!406 = !DILocation(line: 187, column: 27, scope: !380)
!407 = !DILocation(line: 188, column: 18, scope: !380)
!408 = !DILocation(line: 189, column: 21, scope: !380)
!409 = !DILocalVariable(name: "i", scope: !410, file: !2, line: 191, type: !46, align: 4)
!410 = distinct !DILexicalBlock(scope: !380, file: !2, line: 191, column: 2)
!411 = !DILocation(line: 191, column: 11, scope: !410)
!412 = !DILocation(line: 191, column: 15, scope: !410)
!413 = !DILocation(line: 191, column: 18, scope: !410)
!414 = !DILocation(line: 191, column: 22, scope: !410)
!415 = !DILocation(line: 193, column: 11, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !2, line: 193, column: 3)
!417 = distinct !DILexicalBlock(scope: !410, file: !2, line: 192, column: 2)
!418 = !DILocation(line: 193, column: 16, scope: !416)
!419 = !DILocation(line: 195, column: 9, scope: !416)
!420 = !DILocation(line: 196, column: 5, scope: !421)
!421 = distinct !DILexicalBlock(scope: !416, file: !2, line: 196, column: 5)
!422 = !DILocation(line: 196, column: 36, scope: !421)
!423 = !DILocation(line: 197, column: 9, scope: !416)
!424 = !DILocation(line: 198, column: 18, scope: !425)
!425 = distinct !DILexicalBlock(scope: !416, file: !2, line: 198, column: 5)
!426 = !DILocation(line: 199, column: 9, scope: !416)
!427 = !DILocation(line: 200, column: 5, scope: !428)
!428 = distinct !DILexicalBlock(scope: !416, file: !2, line: 200, column: 5)
!429 = !DILocation(line: 200, column: 30, scope: !428)
!430 = !DILocation(line: 201, column: 9, scope: !416)
!431 = !DILocation(line: 202, column: 5, scope: !432)
!432 = distinct !DILexicalBlock(scope: !416, file: !2, line: 202, column: 5)
!433 = !DILocation(line: 202, column: 30, scope: !432)
!434 = !DILocation(line: 203, column: 9, scope: !416)
!435 = !DILocation(line: 204, column: 9, scope: !436)
!436 = distinct !DILexicalBlock(scope: !416, file: !2, line: 204, column: 5)
!437 = !DILocation(line: 204, column: 14, scope: !436)
!438 = !DILocation(line: 200, column: 16, scope: !439, inlinedAt: !440)
!439 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !339, file: !339, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!440 = !DILocation(line: 206, column: 6, scope: !441)
!441 = distinct !DILexicalBlock(scope: !436, file: !2, line: 205, column: 5)
!442 = !DILocalVariable(name: "len", scope: !443, file: !2, line: 174, type: !20, align: 8)
!443 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !339, file: !339, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!444 = !DILocation(line: 174, column: 6, scope: !443, inlinedAt: !445)
!445 = !DILocation(line: 200, column: 3, scope: !439, inlinedAt: !440)
!446 = !DILocation(line: 118, column: 24, scope: !447, inlinedAt: !448)
!447 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !339, file: !339, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!448 = !DILocation(line: 174, column: 12, scope: !443, inlinedAt: !445)
!449 = !DILocation(line: 175, column: 17, scope: !443, inlinedAt: !445)
!450 = !DILocation(line: 175, column: 2, scope: !443, inlinedAt: !445)
!451 = !DILocation(line: 180, column: 4, scope: !443, inlinedAt: !445)
!452 = !DILocation(line: 182, column: 9, scope: !443, inlinedAt: !445)
!453 = !DILocation(line: 207, column: 13, scope: !441)
!454 = !DILocation(line: 209, column: 5, scope: !436)
!455 = !DILocation(line: 209, column: 27, scope: !436)
!456 = !DILocation(line: 209, column: 32, scope: !436)
!457 = !DILocation(line: 210, column: 5, scope: !436)
!458 = !DILocation(line: 212, column: 41, scope: !459)
!459 = distinct !DILexicalBlock(scope: !416, file: !2, line: 212, column: 5)
!460 = !DILocation(line: 212, column: 46, scope: !459)
!461 = !DILocation(line: 212, column: 5, scope: !459)
!462 = !DILocation(line: 191, column: 32, scope: !410)
!463 = !DILocation(line: 215, column: 18, scope: !380)
!464 = !DILocation(line: 217, column: 6, scope: !380)
!465 = !DILocalVariable(name: "len", scope: !466, file: !2, line: 16, type: !20, align: 8)
!466 = distinct !DISubprogram(name: "quicksort", linkageName: "quicksort", scope: !467, file: !467, line: 10, scopeLine: 10, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!467 = !DIFile(filename: "quicksort.c3", directory: "/usr/local/lib/c3/std/sort")
!468 = !DILocation(line: 16, column: 7, scope: !466, inlinedAt: !469)
!469 = !DILocation(line: 219, column: 3, scope: !470)
!470 = distinct !DILexicalBlock(scope: !380, file: !2, line: 218, column: 2)
!471 = !DILocation(line: 13, column: 10, scope: !472, inlinedAt: !474)
!472 = distinct !DISubprogram(name: "len_from_list", linkageName: "len_from_list", scope: !473, file: !473, line: 8, scopeLine: 8, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!473 = !DIFile(filename: "sort.c3", directory: "/usr/local/lib/c3/std/sort")
!474 = !DILocation(line: 16, column: 13, scope: !466, inlinedAt: !469)
!475 = !DILocation(line: 17, column: 72, scope: !466, inlinedAt: !469)
!476 = !DILocation(line: 17, column: 90, scope: !466, inlinedAt: !469)
!477 = !DILocation(line: 17, column: 3, scope: !466, inlinedAt: !469)
!478 = !DILocation(line: 224, column: 3, scope: !380)
!479 = !DILocation(line: 224, column: 35, scope: !380)
!480 = !DILocation(line: 226, column: 6, scope: !380)
!481 = !DILocation(line: 190, column: 15, scope: !482, inlinedAt: !483)
!482 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !339, file: !339, line: 188, scopeLine: 188, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!483 = !DILocation(line: 228, column: 3, scope: !484)
!484 = distinct !DILexicalBlock(scope: !380, file: !2, line: 227, column: 2)
!485 = !DILocation(line: 118, column: 24, scope: !486, inlinedAt: !487)
!486 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !339, file: !339, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!487 = !DILocation(line: 190, column: 3, scope: !482, inlinedAt: !483)
!488 = !DILocalVariable(name: "old_panic", scope: !380, file: !2, line: 231, type: !489, align: 8)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicFn", scope: !2, file: !2, line: 133, baseType: !490, align: 8)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PanicFn", baseType: !243, size: 64, align: 64, dwarfAddressSpace: 0)
!491 = !DILocation(line: 231, column: 10, scope: !380)
!492 = !DILocation(line: 231, column: 22, scope: !380)
!493 = !DILocation(line: 233, column: 20, scope: !380)
!494 = !DILocalVariable(name: "tests_passed", scope: !380, file: !2, line: 234, type: !46, align: 4)
!495 = !DILocation(line: 234, column: 6, scope: !380)
!496 = !DILocation(line: 234, column: 21, scope: !380)
!497 = !DILocalVariable(name: "tests_skipped", scope: !380, file: !2, line: 235, type: !46, align: 4)
!498 = !DILocation(line: 235, column: 6, scope: !380)
!499 = !DILocation(line: 235, column: 22, scope: !380)
!500 = !DILocalVariable(name: "test_count", scope: !380, file: !2, line: 236, type: !46, align: 4)
!501 = !DILocation(line: 236, column: 6, scope: !380)
!502 = !DILocation(line: 236, column: 19, scope: !380)
!503 = !DILocalVariable(name: "name", scope: !380, file: !2, line: 237, type: !504, align: 8)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !2, file: !2, line: 4, baseType: !505, align: 8)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !506, size: 64, align: 64, dwarfAddressSpace: 0)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !2, file: !2, line: 5, baseType: null, align: 1)
!507 = !DILocation(line: 237, column: 10, scope: !380)
!508 = !DILocation(line: 237, column: 17, scope: !380)
!509 = !DILocalVariable(name: "len", scope: !380, file: !2, line: 238, type: !20, align: 8)
!510 = !DILocation(line: 238, column: 6, scope: !380)
!511 = !DILocation(line: 238, column: 12, scope: !380)
!512 = !DILocation(line: 239, column: 26, scope: !380)
!513 = !DILocation(line: 239, column: 2, scope: !380)
!514 = !DILocation(line: 397, column: 22, scope: !515, inlinedAt: !517)
!515 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !516, file: !516, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!516 = !DIFile(filename: "dstring.c3", directory: "/usr/local/lib/c3/std/core")
!517 = !DILocation(line: 240, column: 2, scope: !380)
!518 = !DILocation(line: 397, column: 4, scope: !515, inlinedAt: !517)
!519 = !DILocation(line: 241, column: 26, scope: !380)
!520 = !DILocation(line: 241, column: 32, scope: !380)
!521 = !DILocation(line: 241, column: 2, scope: !380)
!522 = !DILocation(line: 200, column: 16, scope: !523, inlinedAt: !524)
!523 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !339, file: !339, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!524 = !DILocation(line: 242, column: 2, scope: !380)
!525 = !DILocalVariable(name: "len", scope: !526, file: !2, line: 174, type: !20, align: 8)
!526 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !339, file: !339, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!527 = !DILocation(line: 174, column: 6, scope: !526, inlinedAt: !528)
!528 = !DILocation(line: 200, column: 3, scope: !523, inlinedAt: !524)
!529 = !DILocation(line: 120, column: 35, scope: !530, inlinedAt: !531)
!530 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !339, file: !339, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!531 = !DILocation(line: 174, column: 12, scope: !526, inlinedAt: !528)
!532 = !DILocation(line: 120, column: 25, scope: !530, inlinedAt: !531)
!533 = !DILocation(line: 175, column: 17, scope: !526, inlinedAt: !528)
!534 = !DILocation(line: 175, column: 2, scope: !526, inlinedAt: !528)
!535 = !DILocation(line: 180, column: 4, scope: !526, inlinedAt: !528)
!536 = !DILocation(line: 182, column: 9, scope: !526, inlinedAt: !528)
!537 = !DILocation(line: 243, column: 2, scope: !380)
!538 = !DILocation(line: 244, column: 17, scope: !539)
!539 = distinct !DILexicalBlock(scope: !380, file: !2, line: 244, column: 2)
!540 = !DILocalVariable(name: ".temp", scope: !539, file: !2, line: 244, type: !20, align: 8)
!541 = !DILocalVariable(name: "unit", scope: !542, file: !2, line: 244, type: !71, align: 8)
!542 = distinct !DILexicalBlock(scope: !539, file: !2, line: 245, column: 2)
!543 = !DILocation(line: 244, column: 10, scope: !542)
!544 = !DILocation(line: 244, column: 17, scope: !542)
!545 = !DILocation(line: 246, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !542, file: !2, line: 245, column: 2)
!547 = !DILocation(line: 246, column: 55, scope: !546)
!548 = !DILocation(line: 246, column: 36, scope: !546)
!549 = !DILocation(line: 248, column: 4, scope: !550)
!550 = distinct !DILexicalBlock(scope: !546, file: !2, line: 247, column: 3)
!551 = !DILocation(line: 249, column: 4, scope: !550)
!552 = !DILocation(line: 251, column: 3, scope: !546)
!553 = !DILocation(line: 251, column: 27, scope: !546)
!554 = !DILocation(line: 252, column: 3, scope: !546)
!555 = !DILocation(line: 252, column: 30, scope: !546)
!556 = !DILocation(line: 253, column: 3, scope: !546)
!557 = !DILocation(line: 253, column: 36, scope: !546)
!558 = !DILocation(line: 256, column: 31, scope: !546)
!559 = !DILocation(line: 256, column: 3, scope: !546)
!560 = !DILocation(line: 257, column: 27, scope: !546)
!561 = !DILocation(line: 257, column: 38, scope: !546)
!562 = !DILocation(line: 257, column: 3, scope: !546)
!563 = !DILocation(line: 258, column: 21, scope: !546)
!564 = !DILocation(line: 258, column: 3, scope: !546)
!565 = !DILocalVariable(name: "mem", scope: !546, file: !2, line: 259, type: !566, align: 8)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "TrackingAllocator", scope: !2, file: !2, line: 21, size: 640, align: 64, elements: !567, identifier: "std.core.mem.allocator.TrackingAllocator")
!567 = !{!568, !569, !601, !602}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "inner_allocator", scope: !566, file: !2, line: 23, baseType: !76, size: 128, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !566, file: !2, line: 24, baseType: !570, size: 384, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "AllocMap", scope: !2, file: !2, line: 16, baseType: !571, align: 8)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !2, file: !2, line: 11, size: 384, align: 64, elements: !572, identifier: "std_collections_map$ulong$std.core.mem.allocator.Allocation$.HashMap")
!572 = !{!573, !596, !597, !598, !599}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !571, file: !2, line: 13, baseType: !574, size: 128, align: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !575, identifier: "Entry*[]")
!575 = !{!576, !595}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !574, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !578, size: 64, align: 64, dwarfAddressSpace: 0)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !579, size: 64, align: 64, dwarfAddressSpace: 0)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !2, file: !2, line: 502, size: 1344, align: 64, elements: !580, identifier: "std_collections_map$ulong$std.core.mem.allocator.Allocation$.Entry")
!580 = !{!581, !582, !584, !594}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !579, file: !2, line: 504, baseType: !51, size: 32, align: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !579, file: !2, line: 505, baseType: !583, size: 64, align: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !2, file: !2, line: 16, baseType: !9, align: 8)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !579, file: !2, line: 506, baseType: !585, size: 1152, align: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !2, file: !2, line: 16, baseType: !586, align: 8)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocation", scope: !2, file: !2, line: 9, size: 1152, align: 64, elements: !587, identifier: "std.core.mem.allocator.Allocation")
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !586, file: !2, line: 11, baseType: !40, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !2, line: 12, baseType: !20, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "backtrace", scope: !586, file: !2, line: 13, baseType: !591, size: 1024, align: 64, offset: 128)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, align: 64, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 16, lowerBound: 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !2, line: 507, baseType: !578, size: 64, align: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !574, baseType: !20, size: 64, align: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !571, file: !2, line: 14, baseType: !76, size: 128, align: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !571, file: !2, line: 15, baseType: !51, size: 32, align: 32, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !571, file: !2, line: 16, baseType: !51, size: 32, align: 32, offset: 288)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !571, file: !2, line: 17, baseType: !600, size: 32, align: 32, offset: 320)
!600 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mem_total", scope: !566, file: !2, line: 25, baseType: !20, size: 64, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "allocs_total", scope: !566, file: !2, line: 26, baseType: !20, size: 64, align: 64, offset: 576)
!603 = !DILocation(line: 259, column: 21, scope: !546)
!604 = !DILocation(line: 392, column: 27, scope: !605, inlinedAt: !606)
!605 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !105, file: !105, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!606 = !DILocation(line: 260, column: 12, scope: !546)
!607 = !DILocation(line: 260, column: 3, scope: !546)
!608 = !DILocation(line: 261, column: 7, scope: !546)
!609 = !DILocation(line: 263, column: 4, scope: !610)
!610 = distinct !DILexicalBlock(scope: !546, file: !2, line: 262, column: 3)
!611 = !DILocation(line: 264, column: 4, scope: !610)
!612 = !DILocation(line: 265, column: 17, scope: !610)
!613 = !DILocalVariable(name: "old_allocator", scope: !614, file: !2, line: 464, type: !76, align: 8)
!614 = distinct !DISubprogram(name: "@scoped", linkageName: "@scoped", scope: !190, file: !190, line: 462, scopeLine: 462, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!615 = !DILocation(line: 464, column: 12, scope: !614, inlinedAt: !616)
!616 = !DILocation(line: 265, column: 4, scope: !610)
!617 = !DILocation(line: 464, column: 28, scope: !614, inlinedAt: !616)
!618 = !DILocation(line: 465, column: 32, scope: !614, inlinedAt: !616)
!619 = !DILocation(line: 268, column: 6, scope: !620)
!620 = distinct !DILexicalBlock(scope: !610, file: !2, line: 266, column: 4)
!621 = !DILocation(line: 466, column: 38, scope: !622, inlinedAt: !616)
!622 = distinct !DILexicalBlock(scope: !614, file: !190, line: 466, column: 8)
!623 = !DILocation(line: 277, column: 4, scope: !610)
!624 = !DILocation(line: 278, column: 8, scope: !610)
!625 = !DILocation(line: 280, column: 24, scope: !626)
!626 = distinct !DILexicalBlock(scope: !610, file: !2, line: 279, column: 13)
!627 = !DILocation(line: 280, column: 78, scope: !626)
!628 = !DILocation(line: 190, column: 15, scope: !629, inlinedAt: !630)
!629 = distinct !DISubprogram(name: "print", linkageName: "print", scope: !339, file: !339, line: 188, scopeLine: 188, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!630 = !DILocation(line: 280, column: 14, scope: !626)
!631 = !DILocation(line: 118, column: 24, scope: !632, inlinedAt: !633)
!632 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !339, file: !339, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!633 = !DILocation(line: 190, column: 3, scope: !629, inlinedAt: !630)
!634 = !DILocation(line: 200, column: 16, scope: !635, inlinedAt: !636)
!635 = distinct !DISubprogram(name: "printn", linkageName: "printn", scope: !339, file: !339, line: 198, scopeLine: 198, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!636 = !DILocation(line: 281, column: 14, scope: !626)
!637 = !DILocalVariable(name: "len", scope: !638, file: !2, line: 174, type: !20, align: 8)
!638 = distinct !DISubprogram(name: "fprintn", linkageName: "fprintn", scope: !339, file: !339, line: 172, scopeLine: 172, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!639 = !DILocation(line: 174, column: 6, scope: !638, inlinedAt: !640)
!640 = !DILocation(line: 200, column: 3, scope: !635, inlinedAt: !636)
!641 = !DILocation(line: 118, column: 24, scope: !642, inlinedAt: !643)
!642 = distinct !DISubprogram(name: "fprint", linkageName: "fprint", scope: !339, file: !339, line: 114, scopeLine: 114, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!643 = !DILocation(line: 174, column: 12, scope: !638, inlinedAt: !640)
!644 = !DILocation(line: 175, column: 17, scope: !638, inlinedAt: !640)
!645 = !DILocation(line: 175, column: 2, scope: !638, inlinedAt: !640)
!646 = !DILocation(line: 180, column: 4, scope: !638, inlinedAt: !640)
!647 = !DILocation(line: 182, column: 9, scope: !638, inlinedAt: !640)
!648 = !DILocation(line: 282, column: 14, scope: !626)
!649 = !DILocation(line: 286, column: 29, scope: !650)
!650 = distinct !DILexicalBlock(scope: !610, file: !2, line: 285, column: 13)
!651 = !DILocation(line: 286, column: 83, scope: !650)
!652 = !DILocation(line: 286, column: 17, scope: !650)
!653 = !DILocation(line: 287, column: 5, scope: !650)
!654 = !DILocation(line: 289, column: 8, scope: !610)
!655 = !DILocation(line: 291, column: 5, scope: !656)
!656 = distinct !DILexicalBlock(scope: !610, file: !2, line: 290, column: 4)
!657 = !DILocation(line: 294, column: 3, scope: !546)
!658 = !DILocation(line: 255, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !546, file: !2, line: 255, column: 9)
!660 = !DILocation(line: 296, column: 36, scope: !380)
!661 = !DILocation(line: 296, column: 47, scope: !380)
!662 = !DILocation(line: 296, column: 62, scope: !380)
!663 = !DILocation(line: 296, column: 85, scope: !380)
!664 = !DILocation(line: 296, column: 2, scope: !380)
!665 = !DILocalVariable(name: "n_failed", scope: !380, file: !2, line: 298, type: !46, align: 4)
!666 = !DILocation(line: 298, column: 6, scope: !380)
!667 = !DILocation(line: 298, column: 17, scope: !380)
!668 = !DILocation(line: 298, column: 30, scope: !380)
!669 = !DILocation(line: 298, column: 45, scope: !380)
!670 = !DILocation(line: 300, column: 5, scope: !380)
!671 = !DILocation(line: 300, column: 36, scope: !380)
!672 = !DILocation(line: 300, column: 60, scope: !380)
!673 = !DILocation(line: 300, column: 74, scope: !380)
!674 = !DILocation(line: 301, column: 5, scope: !380)
!675 = !DILocation(line: 301, column: 27, scope: !380)
!676 = !DILocation(line: 302, column: 5, scope: !380)
!677 = !DILocation(line: 302, column: 45, scope: !380)
!678 = !DILocation(line: 299, column: 2, scope: !380)
!679 = !DILocation(line: 306, column: 5, scope: !380)
!680 = !DILocation(line: 307, column: 5, scope: !380)
!681 = !DILocation(line: 308, column: 5, scope: !380)
!682 = !DILocation(line: 305, column: 2, scope: !380)
!683 = !DILocation(line: 311, column: 6, scope: !380)
!684 = !DILocation(line: 311, column: 50, scope: !380)
!685 = !DILocation(line: 311, column: 37, scope: !380)
!686 = !DILocation(line: 312, column: 2, scope: !380)
!687 = !DILocation(line: 312, column: 34, scope: !380)
!688 = !DILocation(line: 314, column: 9, scope: !380)
!689 = !DILocation(line: 232, column: 25, scope: !690)
!690 = distinct !DILexicalBlock(scope: !380, file: !2, line: 232, column: 8)
!691 = distinct !DISubprogram(name: "default_test_runner", linkageName: "std.core.runtime.default_test_runner", scope: !2, file: !2, line: 317, type: !692, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !81)
!692 = !DISubroutineType(types: !693)
!693 = !{!22, !93}
!694 = !DILocalVariable(name: "args", arg: 1, scope: !691, file: !2, line: 317, type: !93)
!695 = !DILocation(line: 317, column: 38, scope: !691)
!696 = !DILocalVariable(name: "current", scope: !697, file: !2, line: 592, type: !191, align: 8)
!697 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !190, file: !190, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61, retainedNodes: !81)
!698 = !DILocation(line: 592, column: 17, scope: !697, inlinedAt: !699)
!699 = !DILocation(line: 317, column: 47, scope: !691)
!700 = !DILocation(line: 396, column: 6, scope: !701, inlinedAt: !702)
!701 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !105, file: !105, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!702 = !DILocation(line: 592, column: 27, scope: !697, inlinedAt: !699)
!703 = !DILocation(line: 398, column: 3, scope: !704, inlinedAt: !702)
!704 = distinct !DILexicalBlock(scope: !701, file: !105, line: 397, column: 2)
!705 = !DILocation(line: 400, column: 9, scope: !701, inlinedAt: !702)
!706 = !DILocalVariable(name: "mark", scope: !697, file: !2, line: 597, type: !20, align: 8)
!707 = !DILocation(line: 597, column: 6, scope: !697, inlinedAt: !699)
!708 = !DILocation(line: 597, column: 13, scope: !697, inlinedAt: !699)
!709 = !DILocation(line: 319, column: 9, scope: !710)
!710 = distinct !DILexicalBlock(scope: !691, file: !2, line: 318, column: 1)
!711 = !DILocation(line: 396, column: 6, scope: !712, inlinedAt: !713)
!712 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !105, file: !105, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!713 = !DILocation(line: 320, column: 48, scope: !710)
!714 = !DILocation(line: 398, column: 3, scope: !715, inlinedAt: !713)
!715 = distinct !DILexicalBlock(scope: !712, file: !105, line: 397, column: 2)
!716 = !DILocation(line: 400, column: 9, scope: !712, inlinedAt: !713)
!717 = !DILocation(line: 320, column: 25, scope: !710)
!718 = !DILocation(line: 320, column: 9, scope: !710)
!719 = !DILocation(line: 600, column: 17, scope: !720, inlinedAt: !699)
!720 = distinct !DILexicalBlock(scope: !697, file: !190, line: 599, column: 2)
!721 = !DILocation(line: 600, column: 3, scope: !720, inlinedAt: !699)
!722 = !DILocation(line: 603, column: 9, scope: !720, inlinedAt: !699)
!723 = distinct !DISubprogram(name: "benchmark_collection_create", linkageName: "std.core.runtime.benchmark_collection_create", scope: !45, file: !45, line: 13, type: !724, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !81)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !76}
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit[]", size: 128, align: 64, elements: !727, identifier: "BenchmarkUnit[]")
!727 = !{!728, !736}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !726, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkUnit*", baseType: !730, size: 64, align: 64, dwarfAddressSpace: 0)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkUnit", scope: !45, file: !45, line: 7, size: 192, align: 64, elements: !731, identifier: "std.core.runtime.BenchmarkUnit")
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !45, line: 9, baseType: !13, size: 128, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !730, file: !45, line: 10, baseType: !734, size: 64, align: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "BenchmarkFn", scope: !45, file: !45, line: 5, baseType: !735, align: 8)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !726, baseType: !20, size: 64, align: 64, offset: 64)
!737 = !DILocalVariable(name: "allocator", arg: 1, scope: !723, file: !45, line: 13, type: !76)
!738 = !DILocation(line: 13, column: 58, scope: !723)
!739 = !DILocalVariable(name: "fns", scope: !723, file: !45, line: 15, type: !740, align: 8)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "BenchmarkFn[]", size: 128, align: 64, elements: !741, identifier: "BenchmarkFn[]")
!741 = !{!742, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !740, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BenchmarkFn*", baseType: !734, size: 64, align: 64, dwarfAddressSpace: 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !740, baseType: !20, size: 64, align: 64, offset: 64)
!745 = !DILocation(line: 15, column: 16, scope: !723)
!746 = !DILocation(line: 15, column: 22, scope: !723)
!747 = !DILocalVariable(name: "names", scope: !723, file: !45, line: 16, type: !93, align: 8)
!748 = !DILocation(line: 16, column: 11, scope: !723)
!749 = !DILocation(line: 16, column: 19, scope: !723)
!750 = !DILocalVariable(name: "benchmarks", scope: !723, file: !45, line: 17, type: !726, align: 8)
!751 = !DILocation(line: 17, column: 18, scope: !723)
!752 = !DILocation(line: 17, column: 80, scope: !723)
!753 = !DILocation(line: 286, column: 55, scope: !754, inlinedAt: !755)
!754 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !105, file: !105, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!755 = !DILocation(line: 269, column: 9, scope: !756, inlinedAt: !757)
!756 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !105, file: !105, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!757 = !DILocation(line: 17, column: 31, scope: !723)
!758 = !DILocation(line: 286, column: 40, scope: !754, inlinedAt: !755)
!759 = !DILocation(line: 62, column: 6, scope: !760, inlinedAt: !761)
!760 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !105, file: !105, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!761 = !DILocation(line: 286, column: 18, scope: !754, inlinedAt: !755)
!762 = !DILocation(line: 62, column: 20, scope: !760, inlinedAt: !761)
!763 = !DILocation(line: 28, column: 71, scope: !764, inlinedAt: !765)
!764 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !105, file: !105, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !61)
!765 = !DILocation(line: 68, column: 10, scope: !760, inlinedAt: !761)
!766 = !DILocation(line: 286, column: 67, scope: !754, inlinedAt: !755)
!767 = !DILocation(line: 18, column: 26, scope: !768)
!768 = distinct !DILexicalBlock(scope: !723, file: !45, line: 18, column: 2)
!769 = !DILocalVariable(name: ".temp", scope: !768, file: !45, line: 18, type: !20, align: 8)
!770 = !DILocation(line: 18, column: 11, scope: !768)
!771 = !DILocalVariable(name: "i", scope: !772, file: !45, line: 18, type: !20, align: 8)
!772 = distinct !DILexicalBlock(scope: !768, file: !45, line: 19, column: 2)
!773 = !DILocation(line: 18, column: 11, scope: !772)
!774 = !DILocalVariable(name: "benchmark", scope: !772, file: !45, line: 18, type: !735, align: 8)
!775 = !DILocation(line: 18, column: 14, scope: !772)
!776 = !DILocation(line: 18, column: 26, scope: !772)
!777 = !DILocation(line: 20, column: 3, scope: !778)
!778 = distinct !DILexicalBlock(scope: !772, file: !45, line: 19, column: 2)
!779 = !DILocation(line: 20, column: 14, scope: !778)
!780 = !DILocation(line: 20, column: 21, scope: !778)
!781 = !DILocation(line: 20, column: 27, scope: !778)
!782 = !DILocation(line: 20, column: 31, scope: !778)
!783 = !DILocation(line: 20, column: 35, scope: !778)
!784 = !DILocation(line: 22, column: 9, scope: !723)
!785 = distinct !DISubprogram(name: "set_benchmark_warmup_iterations", linkageName: "std.core.runtime.set_benchmark_warmup_iterations", scope: !45, file: !45, line: 31, type: !786, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !61, retainedNodes: !81)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !51}
!788 = !DILocalVariable(name: "value", arg: 1, scope: !785, file: !45, line: 31, type: !51)
!789 = !DILocation(line: 31, column: 46, scope: !785)
!790 = !DILocation(line: 33, column: 35, scope: !785)
