; ModuleID = 'std::encoding::json'
source_filename = "std::encoding::json"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%ByteReader = type { %"char[]", i64 }
%OnStackAllocator = type { %any, %"char[]", i64, ptr }
%JsonContext = type { i32, %any, %any, i32, ptr, double, i8, i8 }
%"any[]" = type { ptr, i64 }

$std.encoding.json.parse_string = comdat any

$std.encoding.json.temp_parse_string = comdat any

$std.encoding.json.parse = comdat any

$std.encoding.json.temp_parse = comdat any

$std.encoding.json.lex_string = comdat any

$.dyn_search = comdat any

$"std.encoding.json.JsonParsingError$EOF" = comdat any

$"std.encoding.json.JsonParsingError$UNEXPECTED_CHARACTER" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_ESCAPE_SEQUENCE" = comdat any

$"std.encoding.json.JsonParsingError$DUPLICATE_MEMBERS" = comdat any

$"std.encoding.json.JsonParsingError$INVALID_NUMBER" = comdat any

$"$ct.std.encoding.json.JsonParsingError" = comdat any

$"$ct.std.encoding.json.JsonContext" = comdat any

$"$ct.int" = comdat any

$"$ct.std.encoding.json.JsonTokenType" = comdat any

$"$ct.std.io.ByteReader" = comdat any

$"$ct.std.core.mem.allocator.TempAllocator" = comdat any

$"$ct.std.core.mem.allocator.OnStackAllocator" = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "json.c3", directory: "/usr/local/lib/c3/std/encoding")
!9 = !{!10}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "JsonTokenType", scope: !11, file: !8, line: 47, baseType: !37, size: 32, align: 32, elements: !38)
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "JsonContext", scope: !8, file: !8, line: 64, size: 576, align: 64, elements: !12, identifier: "std.encoding.json.JsonContext")
!12 = !{!13, !15, !22, !27, !28, !32, !34, !36}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !11, file: !8, line: 66, baseType: !14, size: 32, align: 32)
!14 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !11, file: !8, line: 67, baseType: !16, size: 128, align: 64, offset: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !17, identifier: "InStream")
!17 = !{!18, !20}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !16, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !11, file: !8, line: 68, baseType: !23, size: 128, align: 64, offset: 192)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !24, identifier: "Allocator")
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !23, baseType: !19, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, baseType: !21, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !11, file: !8, line: 69, baseType: !10, size: 32, align: 32, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "last_string", scope: !11, file: !8, line: 70, baseType: !29, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !8, file: !8, line: 4, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !8, file: !8, line: 5, baseType: null, align: 1)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "last_number", scope: !11, file: !8, line: 71, baseType: !33, size: 64, align: 64, offset: 448)
!33 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !11, file: !8, line: 72, baseType: !35, size: 8, align: 8, offset: 512)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, scope: !11, file: !8, line: 73, baseType: !35, size: 8, align: 8, offset: 520)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!39 = !DIEnumerator(name: "NO_TOKEN", value: 0)
!40 = !DIEnumerator(name: "LBRACE", value: 1)
!41 = !DIEnumerator(name: "LBRACKET", value: 2)
!42 = !DIEnumerator(name: "COMMA", value: 3)
!43 = !DIEnumerator(name: "COLON", value: 4)
!44 = !DIEnumerator(name: "RBRACE", value: 5)
!45 = !DIEnumerator(name: "RBRACKET", value: 6)
!46 = !DIEnumerator(name: "STRING", value: 7)
!47 = !DIEnumerator(name: "NUMBER", value: 8)
!48 = !DIEnumerator(name: "TRUE", value: 9)
!49 = !DIEnumerator(name: "FALSE", value: 10)
!50 = !DIEnumerator(name: "NULL", value: 11)
!51 = !DIEnumerator(name: "EOF", value: 12)
!52 = distinct !DISubprogram(name: "parse_string", linkageName: "std.encoding.json.parse_string", scope: !8, file: !8, line: 18, type: !53, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !57, !72, !23}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !56)
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object**", baseType: !58, size: 64, align: 64, dwarfAddressSpace: 0)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Object*", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", scope: !8, file: !8, line: 11, size: 640, align: 128, elements: !60, identifier: "std.collections.object.Object")
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !8, line: 13, baseType: !21, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !59, file: !8, line: 14, baseType: !23, size: 128, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !8, line: 15, baseType: !64, size: 384, align: 128, offset: 256)
!64 = !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !8, line: 15, size: 384, align: 128, elements: !65)
!65 = !{!66, !68, !69, !71, !80, !81, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !64, file: !8, line: 17, baseType: !67, size: 128, align: 128)
!67 = !DIBasicType(name: "uint128", size: 128, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !64, file: !8, line: 18, baseType: !33, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !64, file: !8, line: 19, baseType: !70, size: 8, align: 8)
!70 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !64, file: !8, line: 20, baseType: !72, size: 128, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !74, identifier: "char[]")
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !73, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !79)
!79 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !64, file: !8, line: 21, baseType: !19, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !64, file: !8, line: 22, baseType: !82, size: 320, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalList", scope: !8, file: !8, line: 466, baseType: !83, align: 8)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !8, file: !8, line: 14, size: 320, align: 64, elements: !84, identifier: "std_collections_list$p$std.collections.object.Object$.List")
!84 = !{!85, !86, !87, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !8, line: 16, baseType: !78, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !83, file: !8, line: 17, baseType: !78, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !83, file: !8, line: 18, baseType: !23, size: 128, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !83, file: !8, line: 19, baseType: !89, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !8, file: !8, line: 466, baseType: !58, align: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !64, file: !8, line: 23, baseType: !92, size: 384, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ObjectInternalMap", scope: !8, file: !8, line: 465, baseType: !93, align: 8)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", scope: !8, file: !8, line: 11, size: 384, align: 64, elements: !94, identifier: "std_collections_map$String$p$std.collections.object.Object$.HashMap")
!94 = !{!95, !110, !111, !112, !113}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !93, file: !8, line: 13, baseType: !96, size: 128, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry*[]", size: 128, align: 64, elements: !97, identifier: "Entry*[]")
!97 = !{!98, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !96, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry**", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Entry*", baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", scope: !8, file: !8, line: 502, size: 320, align: 64, elements: !102, identifier: "std_collections_map$String$p$std.collections.object.Object$.Entry")
!102 = !{!103, !104, !106, !108}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !101, file: !8, line: 504, baseType: !14, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !101, file: !8, line: 505, baseType: !105, size: 128, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key", scope: !8, file: !8, line: 465, baseType: !72, align: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !101, file: !8, line: 506, baseType: !107, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "Value", scope: !8, file: !8, line: 465, baseType: !58, align: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !8, line: 507, baseType: !100, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, baseType: !78, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !93, file: !8, line: 14, baseType: !23, size: 128, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !93, file: !8, line: 15, baseType: !14, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !93, file: !8, line: 16, baseType: !14, size: 32, align: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "load_factor", scope: !93, file: !8, line: 17, baseType: !114, size: 32, align: 32, offset: 320)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{}
!116 = !DILocalVariable(name: "s", arg: 1, scope: !52, file: !8, line: 18, type: !72)
!117 = !DILocation(line: 18, column: 33, scope: !52)
!118 = !DILocalVariable(name: "allocator", arg: 2, scope: !52, file: !8, line: 18, type: !23)
!119 = !DILocation(line: 18, column: 46, scope: !52)
!120 = !DILocation(line: 20, column: 33, scope: !52)
!121 = !DILocation(line: 20, column: 15, scope: !52)
!122 = !DILocation(line: 20, column: 9, scope: !52)
!123 = distinct !DISubprogram(name: "temp_parse_string", linkageName: "std.encoding.json.temp_parse_string", scope: !8, file: !8, line: 23, type: !124, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!124 = !DISubroutineType(types: !125)
!125 = !{!55, !57, !72}
!126 = !DILocalVariable(name: "s", arg: 1, scope: !123, file: !8, line: 23, type: !72)
!127 = !DILocation(line: 23, column: 38, scope: !123)
!128 = !DILocation(line: 25, column: 33, scope: !123)
!129 = !DILocation(line: 25, column: 15, scope: !123)
!130 = !DILocation(line: 396, column: 6, scope: !131, inlinedAt: !133)
!131 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !132, file: !132, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!132 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!133 = !DILocation(line: 25, column: 37, scope: !123)
!134 = !DILocation(line: 398, column: 3, scope: !135, inlinedAt: !133)
!135 = distinct !DILexicalBlock(scope: !131, file: !132, line: 397, column: 2)
!136 = !DILocation(line: 400, column: 9, scope: !131, inlinedAt: !133)
!137 = !DILocation(line: 25, column: 9, scope: !123)
!138 = distinct !DISubprogram(name: "parse", linkageName: "std.encoding.json.parse", scope: !8, file: !8, line: 28, type: !139, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!139 = !DISubroutineType(types: !140)
!140 = !{!55, !57, !16, !23}
!141 = !DILocalVariable(name: "s", arg: 1, scope: !138, file: !8, line: 28, type: !16)
!142 = !DILocation(line: 28, column: 28, scope: !138)
!143 = !DILocalVariable(name: "allocator", arg: 2, scope: !138, file: !8, line: 28, type: !23)
!144 = !DILocation(line: 28, column: 41, scope: !138)
!145 = !DILocalVariable(name: "buffer", scope: !146, file: !8, line: 537, type: !148, align: 16)
!146 = distinct !DISubprogram(name: "@stack_mem", linkageName: "@stack_mem", scope: !147, file: !147, line: 535, scopeLine: 535, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !115)
!147 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 4096, align: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 512, lowerBound: 0)
!151 = !DILocation(line: 537, column: 14, scope: !146, inlinedAt: !152)
!152 = !DILocation(line: 30, column: 2, scope: !138)
!153 = !DILocalVariable(name: "allocator", scope: !146, file: !8, line: 538, type: !154, align: 8)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocator", scope: !8, file: !8, line: 3, size: 384, align: 64, elements: !155, identifier: "std.core.mem.allocator.OnStackAllocator")
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !154, file: !8, line: 5, baseType: !23, size: 128, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !8, line: 6, baseType: !73, size: 128, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !154, file: !8, line: 7, baseType: !78, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !154, file: !8, line: 8, baseType: !160, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OnStackAllocatorExtraChunk*", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnStackAllocatorExtraChunk", scope: !8, file: !8, line: 12, size: 192, align: 64, elements: !162, identifier: "std.core.mem.allocator.OnStackAllocatorExtraChunk")
!162 = !{!163, !164, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "is_aligned", scope: !161, file: !8, line: 14, baseType: !70, size: 8, align: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !8, line: 15, baseType: !160, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !8, line: 16, baseType: !19, size: 64, align: 64, offset: 128)
!166 = !DILocation(line: 538, column: 19, scope: !146, inlinedAt: !152)
!167 = !DILocation(line: 539, column: 18, scope: !146, inlinedAt: !152)
!168 = !DILocation(line: 392, column: 27, scope: !169, inlinedAt: !170)
!169 = distinct !DISubprogram(name: "heap", linkageName: "heap", scope: !132, file: !132, line: 392, scopeLine: 392, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!170 = !DILocation(line: 539, column: 26, scope: !146, inlinedAt: !152)
!171 = !DILocation(line: 539, column: 2, scope: !146, inlinedAt: !152)
!172 = !DILocalVariable(name: "mem", scope: !138, file: !8, line: 30, type: !23, align: 8)
!173 = !DILocation(line: 30, column: 28, scope: !138)
!174 = !DILocation(line: 541, column: 8, scope: !175, inlinedAt: !152)
!175 = distinct !DILexicalBlock(scope: !146, file: !147, line: 541, column: 2)
!176 = !DILocalVariable(name: "context", scope: !177, file: !8, line: 32, type: !11, align: 8)
!177 = distinct !DILexicalBlock(scope: !138, file: !8, line: 31, column: 2)
!178 = !DILocation(line: 32, column: 15, scope: !177)
!179 = !DILocation(line: 32, column: 73, scope: !177)
!180 = !DILocation(line: 32, column: 42, scope: !177)
!181 = !DILocation(line: 32, column: 89, scope: !177)
!182 = !DILocation(line: 32, column: 105, scope: !177)
!183 = !DILocalVariable(name: "current", scope: !184, file: !8, line: 592, type: !185, align: 8)
!184 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !147, file: !147, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !115)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !8, file: !8, line: 10, size: 320, align: 64, elements: !187, identifier: "std.core.mem.allocator.TempAllocator")
!187 = !{!188, !189, !202, !203, !204}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !186, file: !8, line: 12, baseType: !23, size: 128, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !186, file: !8, line: 13, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !191, size: 64, align: 64, dwarfAddressSpace: 0)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !8, file: !8, line: 22, size: 320, align: 64, elements: !192, identifier: "std.core.mem.allocator.TempAllocatorPage")
!192 = !{!193, !194, !195, !196, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !191, file: !8, line: 24, baseType: !190, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !191, file: !8, line: 25, baseType: !19, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !191, file: !8, line: 26, baseType: !78, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !191, file: !8, line: 27, baseType: !78, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !191, file: !8, line: 28, baseType: !78, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !8, line: 29, baseType: !199, align: 8, offset: 320)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, align: 8, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 0, lowerBound: 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !186, file: !8, line: 14, baseType: !78, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !186, file: !8, line: 15, baseType: !78, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !8, line: 16, baseType: !199, align: 8, offset: 320)
!205 = !DILocation(line: 592, column: 17, scope: !184, inlinedAt: !206)
!206 = !DILocation(line: 33, column: 3, scope: !177)
!207 = !DILocation(line: 396, column: 6, scope: !208, inlinedAt: !209)
!208 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !132, file: !132, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!209 = !DILocation(line: 592, column: 27, scope: !184, inlinedAt: !206)
!210 = !DILocation(line: 398, column: 3, scope: !211, inlinedAt: !209)
!211 = distinct !DILexicalBlock(scope: !208, file: !132, line: 397, column: 2)
!212 = !DILocation(line: 400, column: 9, scope: !208, inlinedAt: !209)
!213 = !DILocalVariable(name: "original", scope: !184, file: !8, line: 594, type: !185, align: 8)
!214 = !DILocation(line: 594, column: 18, scope: !184, inlinedAt: !206)
!215 = !DILocation(line: 594, column: 29, scope: !184, inlinedAt: !206)
!216 = !DILocation(line: 595, column: 7, scope: !184, inlinedAt: !206)
!217 = !DILocation(line: 595, column: 18, scope: !184, inlinedAt: !206)
!218 = !DILocation(line: 595, column: 45, scope: !184, inlinedAt: !206)
!219 = !DILocalVariable(name: "mark", scope: !184, file: !8, line: 597, type: !78, align: 8)
!220 = !DILocation(line: 597, column: 6, scope: !184, inlinedAt: !206)
!221 = !DILocation(line: 597, column: 13, scope: !184, inlinedAt: !206)
!222 = !DILocation(line: 35, column: 11, scope: !223)
!223 = distinct !DILexicalBlock(scope: !177, file: !8, line: 34, column: 3)
!224 = !DILocation(line: 600, column: 17, scope: !225, inlinedAt: !206)
!225 = distinct !DILexicalBlock(scope: !184, file: !147, line: 599, column: 2)
!226 = !DILocation(line: 600, column: 3, scope: !225, inlinedAt: !206)
!227 = !DILocation(line: 602, column: 39, scope: !225, inlinedAt: !206)
!228 = !DILocation(line: 540, column: 8, scope: !229, inlinedAt: !152)
!229 = distinct !DILexicalBlock(scope: !146, file: !147, line: 540, column: 8)
!230 = !DILocation(line: 600, column: 17, scope: !231, inlinedAt: !206)
!231 = distinct !DILexicalBlock(scope: !184, file: !147, line: 599, column: 2)
!232 = !DILocation(line: 600, column: 3, scope: !231, inlinedAt: !206)
!233 = !DILocation(line: 602, column: 39, scope: !231, inlinedAt: !206)
!234 = !DILocation(line: 540, column: 8, scope: !235, inlinedAt: !152)
!235 = distinct !DILexicalBlock(scope: !146, file: !147, line: 540, column: 8)
!236 = distinct !DISubprogram(name: "temp_parse", linkageName: "std.encoding.json.temp_parse", scope: !8, file: !8, line: 40, type: !237, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !115)
!237 = !DISubroutineType(types: !238)
!238 = !{!55, !57, !16}
!239 = !DILocalVariable(name: "s", arg: 1, scope: !236, file: !8, line: 40, type: !16)
!240 = !DILocation(line: 40, column: 33, scope: !236)
!241 = !DILocation(line: 396, column: 6, scope: !242, inlinedAt: !243)
!242 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !132, file: !132, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!243 = !DILocation(line: 42, column: 18, scope: !236)
!244 = !DILocation(line: 398, column: 3, scope: !245, inlinedAt: !243)
!245 = distinct !DILexicalBlock(scope: !242, file: !132, line: 397, column: 2)
!246 = !DILocation(line: 400, column: 9, scope: !242, inlinedAt: !243)
!247 = !DILocation(line: 42, column: 9, scope: !236)
!248 = distinct !DISubprogram(name: "parse_from_token", linkageName: "std.encoding.json.parse_from_token", scope: !8, file: !8, line: 81, type: !249, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !115)
!249 = !DISubroutineType(types: !250)
!250 = !{!55, !57, !251, !10}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "JsonContext*", baseType: !11, size: 64, align: 64, dwarfAddressSpace: 0)
