; ModuleID = 'std::math::vector'
source_filename = "std::math::vector"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Matrix4x4 = type { %.anon }
%.anon = type { %.anon.0 }
%.anon.0 = type { float, float, float, float, float, float, float, float, float, float, float, float, float, float, float, float }
%Matrix4x4.1 = type { %.anon.2 }
%.anon.2 = type { %.anon.3 }
%.anon.3 = type { double, double, double, double, double, double, double, double, double, double, double, double, double, double, double, double }
%Quaternion.4 = type { <4 x float> }
%Quaternion = type { <4 x double> }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$"std.math.vector.float[<2>].towards" = comdat any

$"std.math.vector.float[<3>].towards" = comdat any

$"std.math.vector.float[<4>].towards" = comdat any

$"std.math.vector.double[<2>].towards" = comdat any

$"std.math.vector.double[<3>].towards" = comdat any

$"std.math.vector.double[<4>].towards" = comdat any

$"std.math.vector.float[<3>].cross" = comdat any

$"std.math.vector.double[<3>].cross" = comdat any

$"std.math.vector.float[<3>].perpendicular" = comdat any

$"std.math.vector.double[<3>].perpendicular" = comdat any

$"std.math.vector.float[<3>].barycenter" = comdat any

$"std.math.vector.double[<3>].barycenter" = comdat any

$"std.math.vector.float[<3>].transform" = comdat any


!567 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!568 = !DILocation(line: 693, column: 82, scope: !567, inlinedAt: !562)
!569 = !DILocalVariable(name: "d11", scope: !538, file: !8, line: 230, type: !159, align: 8)
!570 = !DILocation(line: 230, column: 6, scope: !538, inlinedAt: !540)
!571 = !DILocation(line: 708, column: 64, scope: !572, inlinedAt: !573)
!572 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!573 = !DILocation(line: 230, column: 12, scope: !538, inlinedAt: !540)
!574 = !DILocation(line: 708, column: 68, scope: !572, inlinedAt: !573)
!575 = !DILocation(line: 693, column: 85, scope: !576, inlinedAt: !571)
!576 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!577 = !DILocation(line: 693, column: 82, scope: !576, inlinedAt: !571)
!578 = !DILocalVariable(name: "d20", scope: !538, file: !8, line: 231, type: !159, align: 8)
!579 = !DILocation(line: 231, column: 6, scope: !538, inlinedAt: !540)
!580 = !DILocation(line: 708, column: 64, scope: !581, inlinedAt: !582)
!581 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!582 = !DILocation(line: 231, column: 12, scope: !538, inlinedAt: !540)
!583 = !DILocation(line: 708, column: 68, scope: !581, inlinedAt: !582)
!584 = !DILocation(line: 693, column: 85, scope: !585, inlinedAt: !580)
!585 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!586 = !DILocation(line: 693, column: 82, scope: !585, inlinedAt: !580)
!587 = !DILocalVariable(name: "d21", scope: !538, file: !8, line: 232, type: !159, align: 8)
!588 = !DILocation(line: 232, column: 6, scope: !538, inlinedAt: !540)
!589 = !DILocation(line: 708, column: 64, scope: !590, inlinedAt: !591)
!590 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!591 = !DILocation(line: 232, column: 12, scope: !538, inlinedAt: !540)
!592 = !DILocation(line: 708, column: 68, scope: !590, inlinedAt: !591)
!593 = !DILocation(line: 693, column: 85, scope: !594, inlinedAt: !589)
!594 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!595 = !DILocation(line: 693, column: 82, scope: !594, inlinedAt: !589)
!596 = !DILocalVariable(name: "denom", scope: !538, file: !8, line: 233, type: !159, align: 8)
!597 = !DILocation(line: 233, column: 6, scope: !538, inlinedAt: !540)
!598 = !DILocation(line: 233, column: 14, scope: !538, inlinedAt: !540)
!599 = !DILocation(line: 233, column: 20, scope: !538, inlinedAt: !540)
!600 = !DILocation(line: 233, column: 26, scope: !538, inlinedAt: !540)
!601 = !DILocation(line: 233, column: 32, scope: !538, inlinedAt: !540)
!602 = !DILocalVariable(name: "y", scope: !538, file: !8, line: 234, type: !159, align: 8)
!603 = !DILocation(line: 234, column: 6, scope: !538, inlinedAt: !540)
!604 = !DILocation(line: 234, column: 11, scope: !538, inlinedAt: !540)
!605 = !DILocation(line: 234, column: 17, scope: !538, inlinedAt: !540)
!606 = !DILocation(line: 234, column: 23, scope: !538, inlinedAt: !540)
!607 = !DILocation(line: 234, column: 29, scope: !538, inlinedAt: !540)
!608 = !DILocation(line: 234, column: 36, scope: !538, inlinedAt: !540)
!609 = !DILocalVariable(name: "z", scope: !538, file: !8, line: 235, type: !159, align: 8)
!610 = !DILocation(line: 235, column: 6, scope: !538, inlinedAt: !540)
!611 = !DILocation(line: 235, column: 11, scope: !538, inlinedAt: !540)
!612 = !DILocation(line: 235, column: 17, scope: !538, inlinedAt: !540)
!613 = !DILocation(line: 235, column: 23, scope: !538, inlinedAt: !540)
!614 = !DILocation(line: 235, column: 29, scope: !538, inlinedAt: !540)
!615 = !DILocation(line: 235, column: 36, scope: !538, inlinedAt: !540)
!616 = !DILocation(line: 236, column: 26, scope: !538, inlinedAt: !540)
!617 = !DILocation(line: 236, column: 22, scope: !538, inlinedAt: !540)
!618 = !DILocation(line: 236, column: 30, scope: !538, inlinedAt: !540)
!619 = !DILocation(line: 236, column: 9, scope: !538, inlinedAt: !540)
!620 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.float[<3>].transform", scope: !8, file: !8, line: 57, type: !621, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!621 = !DISubroutineType(types: !622)
!622 = !{!63, !64, !623}
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !8, file: !8, line: 31, size: 512, align: 32, elements: !624, identifier: "std_math_matrix$float$.Matrix4x4")
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, scope: !623, file: !8, line: 33, baseType: !626, size: 512, align: 32)
!626 = !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !8, line: 33, size: 512, align: 32, elements: !627)
!627 = !{!628, !648}
!628 = !DIDerivedType(tag: DW_TAG_member, scope: !626, file: !8, line: 35, baseType: !629, size: 512, align: 32)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !626, file: !8, line: 35, size: 512, align: 32, elements: !630)
!630 = !{!631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !629, file: !8, line: 37, baseType: !632, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 107, baseType: !14, align: 4)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !629, file: !8, line: 37, baseType: !632, size: 32, align: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !629, file: !8, line: 37, baseType: !632, size: 32, align: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !629, file: !8, line: 37, baseType: !632, size: 32, align: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !629, file: !8, line: 38, baseType: !632, size: 32, align: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !629, file: !8, line: 38, baseType: !632, size: 32, align: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !629, file: !8, line: 38, baseType: !632, size: 32, align: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !629, file: !8, line: 38, baseType: !632, size: 32, align: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !629, file: !8, line: 39, baseType: !632, size: 32, align: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !629, file: !8, line: 39, baseType: !632, size: 32, align: 32, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !629, file: !8, line: 39, baseType: !632, size: 32, align: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !629, file: !8, line: 39, baseType: !632, size: 32, align: 32, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !629, file: !8, line: 40, baseType: !632, size: 32, align: 32, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !629, file: !8, line: 40, baseType: !632, size: 32, align: 32, offset: 416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !629, file: !8, line: 40, baseType: !632, size: 32, align: 32, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !629, file: !8, line: 40, baseType: !632, size: 32, align: 32, offset: 480)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !626, file: !8, line: 42, baseType: !649, size: 512, align: 32)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 32, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 16, lowerBound: 0)
!652 = !DILocalVariable(name: "self", arg: 1, scope: !620, file: !8, line: 57, type: !64)
!653 = !DILocation(line: 57, column: 26, scope: !620)
!654 = !DILocalVariable(name: "mat", arg: 2, scope: !620, file: !8, line: 57, type: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4f", scope: !8, file: !8, line: 107, baseType: !623, align: 4)
!656 = !DILocation(line: 57, column: 41, scope: !620)
!657 = !DILocation(line: 149, column: 3, scope: !658, inlinedAt: !659)
!658 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !8, file: !8, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!659 = !DILocation(line: 57, column: 49, scope: !620)
!660 = !DILocation(line: 149, column: 13, scope: !658, inlinedAt: !659)
!661 = !DILocation(line: 149, column: 15, scope: !658, inlinedAt: !659)
!662 = !DILocation(line: 149, column: 20, scope: !658, inlinedAt: !659)
!663 = !DILocation(line: 149, column: 30, scope: !658, inlinedAt: !659)
!664 = !DILocation(line: 149, column: 32, scope: !658, inlinedAt: !659)
!665 = !DILocation(line: 149, column: 37, scope: !658, inlinedAt: !659)
!666 = !DILocation(line: 149, column: 47, scope: !658, inlinedAt: !659)
!667 = !DILocation(line: 149, column: 49, scope: !658, inlinedAt: !659)
!668 = !DILocation(line: 149, column: 54, scope: !658, inlinedAt: !659)
!669 = !DILocation(line: 148, column: 9, scope: !658, inlinedAt: !659)
!670 = !DILocation(line: 150, column: 3, scope: !658, inlinedAt: !659)
!671 = !DILocation(line: 150, column: 13, scope: !658, inlinedAt: !659)
!672 = !DILocation(line: 150, column: 15, scope: !658, inlinedAt: !659)
!673 = !DILocation(line: 150, column: 20, scope: !658, inlinedAt: !659)
!674 = !DILocation(line: 150, column: 30, scope: !658, inlinedAt: !659)
!675 = !DILocation(line: 150, column: 32, scope: !658, inlinedAt: !659)
!676 = !DILocation(line: 150, column: 37, scope: !658, inlinedAt: !659)
!677 = !DILocation(line: 150, column: 47, scope: !658, inlinedAt: !659)
!678 = !DILocation(line: 150, column: 49, scope: !658, inlinedAt: !659)
!679 = !DILocation(line: 150, column: 54, scope: !658, inlinedAt: !659)
!680 = !DILocation(line: 151, column: 3, scope: !658, inlinedAt: !659)
!681 = !DILocation(line: 151, column: 13, scope: !658, inlinedAt: !659)
!682 = !DILocation(line: 151, column: 15, scope: !658, inlinedAt: !659)
!683 = !DILocation(line: 151, column: 20, scope: !658, inlinedAt: !659)
!684 = !DILocation(line: 151, column: 30, scope: !658, inlinedAt: !659)
!685 = !DILocation(line: 151, column: 32, scope: !658, inlinedAt: !659)
!686 = !DILocation(line: 151, column: 37, scope: !658, inlinedAt: !659)
!687 = !DILocation(line: 151, column: 47, scope: !658, inlinedAt: !659)
!688 = !DILocation(line: 151, column: 49, scope: !658, inlinedAt: !659)
!689 = !DILocation(line: 151, column: 54, scope: !658, inlinedAt: !659)
!690 = distinct !DISubprogram(name: "transform", linkageName: "std.math.vector.double[<3>].transform", scope: !8, file: !8, line: 58, type: !691, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!691 = !DISubroutineType(types: !692)
!692 = !{!203, !204, !693}
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "Matrix4x4", scope: !8, file: !8, line: 31, size: 1024, align: 64, elements: !694, identifier: "std_math_matrix$double$.Matrix4x4")
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, scope: !693, file: !8, line: 33, baseType: !696, size: 1024, align: 64)
!696 = !DICompositeType(tag: DW_TAG_union_type, scope: !693, file: !8, line: 33, size: 1024, align: 64, elements: !697)
!697 = !{!698, !718}
!698 = !DIDerivedType(tag: DW_TAG_member, scope: !696, file: !8, line: 35, baseType: !699, size: 1024, align: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !696, file: !8, line: 35, size: 1024, align: 64, elements: !700)
!700 = !{!701, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "m00", scope: !699, file: !8, line: 37, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 108, baseType: !159, align: 8)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "m01", scope: !699, file: !8, line: 37, baseType: !702, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "m02", scope: !699, file: !8, line: 37, baseType: !702, size: 64, align: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "m03", scope: !699, file: !8, line: 37, baseType: !702, size: 64, align: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m10", scope: !699, file: !8, line: 38, baseType: !702, size: 64, align: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m11", scope: !699, file: !8, line: 38, baseType: !702, size: 64, align: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m12", scope: !699, file: !8, line: 38, baseType: !702, size: 64, align: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m13", scope: !699, file: !8, line: 38, baseType: !702, size: 64, align: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "m20", scope: !699, file: !8, line: 39, baseType: !702, size: 64, align: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "m21", scope: !699, file: !8, line: 39, baseType: !702, size: 64, align: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "m22", scope: !699, file: !8, line: 39, baseType: !702, size: 64, align: 64, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "m23", scope: !699, file: !8, line: 39, baseType: !702, size: 64, align: 64, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "m30", scope: !699, file: !8, line: 40, baseType: !702, size: 64, align: 64, offset: 768)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "m31", scope: !699, file: !8, line: 40, baseType: !702, size: 64, align: 64, offset: 832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "m32", scope: !699, file: !8, line: 40, baseType: !702, size: 64, align: 64, offset: 896)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "m33", scope: !699, file: !8, line: 40, baseType: !702, size: 64, align: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !696, file: !8, line: 42, baseType: !719, size: 1024, align: 64)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1024, align: 64, elements: !650)
!720 = !DILocalVariable(name: "self", arg: 1, scope: !690, file: !8, line: 58, type: !204)
!721 = !DILocation(line: 58, column: 24, scope: !690)
!722 = !DILocalVariable(name: "mat", arg: 2, scope: !690, file: !8, line: 58, type: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix4", scope: !8, file: !8, line: 108, baseType: !693, align: 8)
!724 = !DILocation(line: 58, column: 38, scope: !690)
!725 = !DILocation(line: 149, column: 3, scope: !726, inlinedAt: !727)
!726 = distinct !DISubprogram(name: "transform3", linkageName: "transform3", scope: !8, file: !8, line: 146, scopeLine: 146, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!727 = !DILocation(line: 58, column: 46, scope: !690)
!728 = !DILocation(line: 149, column: 13, scope: !726, inlinedAt: !727)
!729 = !DILocation(line: 149, column: 15, scope: !726, inlinedAt: !727)
!730 = !DILocation(line: 149, column: 20, scope: !726, inlinedAt: !727)
!731 = !DILocation(line: 149, column: 30, scope: !726, inlinedAt: !727)
!732 = !DILocation(line: 149, column: 32, scope: !726, inlinedAt: !727)
!733 = !DILocation(line: 149, column: 37, scope: !726, inlinedAt: !727)
!734 = !DILocation(line: 149, column: 47, scope: !726, inlinedAt: !727)
!735 = !DILocation(line: 149, column: 49, scope: !726, inlinedAt: !727)
!736 = !DILocation(line: 149, column: 54, scope: !726, inlinedAt: !727)
!737 = !DILocation(line: 148, column: 9, scope: !726, inlinedAt: !727)
!738 = !DILocation(line: 150, column: 3, scope: !726, inlinedAt: !727)
!739 = !DILocation(line: 150, column: 13, scope: !726, inlinedAt: !727)
!740 = !DILocation(line: 150, column: 15, scope: !726, inlinedAt: !727)
!741 = !DILocation(line: 150, column: 20, scope: !726, inlinedAt: !727)
!742 = !DILocation(line: 150, column: 30, scope: !726, inlinedAt: !727)
!743 = !DILocation(line: 150, column: 32, scope: !726, inlinedAt: !727)
!744 = !DILocation(line: 150, column: 37, scope: !726, inlinedAt: !727)
!745 = !DILocation(line: 150, column: 47, scope: !726, inlinedAt: !727)
!746 = !DILocation(line: 150, column: 49, scope: !726, inlinedAt: !727)
!747 = !DILocation(line: 150, column: 54, scope: !726, inlinedAt: !727)
!748 = !DILocation(line: 151, column: 3, scope: !726, inlinedAt: !727)
!749 = !DILocation(line: 151, column: 13, scope: !726, inlinedAt: !727)
!750 = !DILocation(line: 151, column: 15, scope: !726, inlinedAt: !727)
!751 = !DILocation(line: 151, column: 20, scope: !726, inlinedAt: !727)
!752 = !DILocation(line: 151, column: 30, scope: !726, inlinedAt: !727)
!753 = !DILocation(line: 151, column: 32, scope: !726, inlinedAt: !727)
!754 = !DILocation(line: 151, column: 37, scope: !726, inlinedAt: !727)
!755 = !DILocation(line: 151, column: 47, scope: !726, inlinedAt: !727)
!756 = !DILocation(line: 151, column: 49, scope: !726, inlinedAt: !727)
!757 = !DILocation(line: 151, column: 54, scope: !726, inlinedAt: !727)
!758 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.float[<3>].angle", scope: !8, file: !8, line: 60, type: !759, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!759 = !DISubroutineType(types: !760)
!760 = !{!14, !64, !64}
!761 = !DILocalVariable(name: "self", arg: 1, scope: !758, file: !8, line: 60, type: !64)
!762 = !DILocation(line: 60, column: 22, scope: !758)
!763 = !DILocalVariable(name: "v2", arg: 2, scope: !758, file: !8, line: 60, type: !63)
!764 = !DILocation(line: 60, column: 34, scope: !758)
!765 = !DILocalVariable(name: "len", scope: !766, file: !8, line: 158, type: !14, align: 4)
!766 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !8, file: !8, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !17)
!767 = !DILocation(line: 158, column: 6, scope: !766, inlinedAt: !768)
!768 = !DILocation(line: 60, column: 41, scope: !758)
!769 = !DILocation(line: 158, column: 21, scope: !766, inlinedAt: !768)
!770 = !DILocation(line: 158, column: 12, scope: !766, inlinedAt: !768)
!771 = !DILocation(line: 665, column: 60, scope: !772, inlinedAt: !773)
!772 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!773 = !DILocation(line: 666, column: 55, scope: !774, inlinedAt: !770)
!774 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !34, file: !34, line: 666, scopeLine: 666, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!775 = !DILocation(line: 665, column: 64, scope: !772, inlinedAt: !773)
!776 = !DILocation(line: 650, column: 81, scope: !777, inlinedAt: !771)
!777 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!778 = !DILocation(line: 650, column: 78, scope: !777, inlinedAt: !771)
!779 = !DILocalVariable(name: "dot", scope: !766, file: !8, line: 159, type: !14, align: 4)
!780 = !DILocation(line: 159, column: 6, scope: !766, inlinedAt: !768)
!781 = !DILocation(line: 665, column: 60, scope: !782, inlinedAt: !783)
!782 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!783 = !DILocation(line: 159, column: 12, scope: !766, inlinedAt: !768)
!784 = !DILocation(line: 665, column: 64, scope: !782, inlinedAt: !783)
!785 = !DILocation(line: 650, column: 81, scope: !786, inlinedAt: !781)
!786 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!787 = !DILocation(line: 650, column: 78, scope: !786, inlinedAt: !781)
!788 = !DILocation(line: 176, column: 21, scope: !789, inlinedAt: !790)
!789 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !34, file: !34, line: 173, scopeLine: 173, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!790 = !DILocation(line: 160, column: 9, scope: !766, inlinedAt: !768)
!791 = !DILocation(line: 176, column: 10, scope: !789, inlinedAt: !790)
!792 = distinct !DISubprogram(name: "angle", linkageName: "std.math.vector.double[<3>].angle", scope: !8, file: !8, line: 61, type: !793, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!793 = !DISubroutineType(types: !794)
!794 = !{!159, !204, !204}
!795 = !DILocalVariable(name: "self", arg: 1, scope: !792, file: !8, line: 61, type: !204)
!796 = !DILocation(line: 61, column: 22, scope: !792)
!797 = !DILocalVariable(name: "v2", arg: 2, scope: !792, file: !8, line: 61, type: !203)
!798 = !DILocation(line: 61, column: 33, scope: !792)
!799 = !DILocalVariable(name: "len", scope: !800, file: !8, line: 158, type: !159, align: 8)
!800 = distinct !DISubprogram(name: "angle3", linkageName: "angle3", scope: !8, file: !8, line: 156, scopeLine: 156, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !17)
!801 = !DILocation(line: 158, column: 6, scope: !800, inlinedAt: !802)
!802 = !DILocation(line: 61, column: 40, scope: !792)
!803 = !DILocation(line: 158, column: 21, scope: !800, inlinedAt: !802)
!804 = !DILocation(line: 158, column: 12, scope: !800, inlinedAt: !802)
!805 = !DILocation(line: 708, column: 64, scope: !806, inlinedAt: !807)
!806 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!807 = !DILocation(line: 709, column: 58, scope: !808, inlinedAt: !804)
!808 = distinct !DISubprogram(name: "length", linkageName: "length", scope: !34, file: !34, line: 709, scopeLine: 709, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!809 = !DILocation(line: 708, column: 68, scope: !806, inlinedAt: !807)
!810 = !DILocation(line: 693, column: 85, scope: !811, inlinedAt: !805)
!811 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!812 = !DILocation(line: 693, column: 82, scope: !811, inlinedAt: !805)
!813 = !DILocalVariable(name: "dot", scope: !800, file: !8, line: 159, type: !159, align: 8)
!814 = !DILocation(line: 159, column: 6, scope: !800, inlinedAt: !802)
!815 = !DILocation(line: 708, column: 64, scope: !816, inlinedAt: !817)
!816 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!817 = !DILocation(line: 159, column: 12, scope: !800, inlinedAt: !802)
!818 = !DILocation(line: 708, column: 68, scope: !816, inlinedAt: !817)
!819 = !DILocation(line: 693, column: 85, scope: !820, inlinedAt: !815)
!820 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!821 = !DILocation(line: 693, column: 82, scope: !820, inlinedAt: !815)
!822 = !DILocation(line: 178, column: 20, scope: !823, inlinedAt: !824)
!823 = distinct !DISubprogram(name: "atan2", linkageName: "atan2", scope: !34, file: !34, line: 173, scopeLine: 173, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!824 = !DILocation(line: 160, column: 9, scope: !800, inlinedAt: !802)
!825 = !DILocation(line: 178, column: 10, scope: !823, inlinedAt: !824)
!826 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.float[<3>].refract", scope: !8, file: !8, line: 63, type: !61, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!827 = !DILocalVariable(name: "self", arg: 1, scope: !826, file: !8, line: 63, type: !64)
!828 = !DILocation(line: 63, column: 24, scope: !826)
!829 = !DILocalVariable(name: "n", arg: 2, scope: !826, file: !8, line: 63, type: !63)
!830 = !DILocation(line: 63, column: 36, scope: !826)
!831 = !DILocalVariable(name: "r", arg: 3, scope: !826, file: !8, line: 63, type: !14)
!832 = !DILocation(line: 63, column: 45, scope: !826)
!833 = !DILocalVariable(name: "dot", scope: !834, file: !8, line: 241, type: !14, align: 4)
!834 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !8, file: !8, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !17)
!835 = !DILocation(line: 241, column: 6, scope: !834, inlinedAt: !836)
!836 = !DILocation(line: 63, column: 51, scope: !826)
!837 = !DILocation(line: 665, column: 60, scope: !838, inlinedAt: !839)
!838 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 665, scopeLine: 665, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!839 = !DILocation(line: 241, column: 12, scope: !834, inlinedAt: !836)
!840 = !DILocation(line: 665, column: 64, scope: !838, inlinedAt: !839)
!841 = !DILocation(line: 650, column: 81, scope: !842, inlinedAt: !837)
!842 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 650, scopeLine: 650, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!843 = !DILocation(line: 650, column: 78, scope: !842, inlinedAt: !837)
!844 = !DILocalVariable(name: "d", scope: !834, file: !8, line: 242, type: !14, align: 4)
!845 = !DILocation(line: 242, column: 6, scope: !834, inlinedAt: !836)
!846 = !DILocation(line: 242, column: 14, scope: !834, inlinedAt: !836)
!847 = !DILocation(line: 242, column: 18, scope: !834, inlinedAt: !836)
!848 = !DILocation(line: 242, column: 27, scope: !834, inlinedAt: !836)
!849 = !DILocation(line: 242, column: 33, scope: !834, inlinedAt: !836)
!850 = !DILocation(line: 242, column: 23, scope: !834, inlinedAt: !836)
!851 = !DILocation(line: 242, column: 10, scope: !834, inlinedAt: !836)
!852 = !DILocation(line: 244, column: 9, scope: !834, inlinedAt: !836)
!853 = !DILocation(line: 244, column: 17, scope: !834, inlinedAt: !836)
!854 = !DILocation(line: 244, column: 21, scope: !834, inlinedAt: !836)
!855 = !DILocation(line: 244, column: 25, scope: !834, inlinedAt: !836)
!856 = !DILocation(line: 244, column: 30, scope: !834, inlinedAt: !836)
!857 = !DILocation(line: 244, column: 34, scope: !834, inlinedAt: !836)
!858 = !DILocation(line: 26, column: 10, scope: !859, inlinedAt: !860)
!859 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !52, file: !52, line: 21, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!860 = !DILocation(line: 537, column: 25, scope: !861, inlinedAt: !862)
!861 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !34, file: !34, line: 537, scopeLine: 537, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!862 = !DILocation(line: 244, column: 40, scope: !834, inlinedAt: !836)
!863 = !DILocation(line: 244, column: 57, scope: !834, inlinedAt: !836)
!864 = distinct !DISubprogram(name: "refract", linkageName: "std.math.vector.double[<3>].refract", scope: !8, file: !8, line: 64, type: !201, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!865 = !DILocalVariable(name: "self", arg: 1, scope: !864, file: !8, line: 64, type: !204)
!866 = !DILocation(line: 64, column: 22, scope: !864)
!867 = !DILocalVariable(name: "n", arg: 2, scope: !864, file: !8, line: 64, type: !203)
!868 = !DILocation(line: 64, column: 33, scope: !864)
!869 = !DILocalVariable(name: "r", arg: 3, scope: !864, file: !8, line: 64, type: !159)
!870 = !DILocation(line: 64, column: 43, scope: !864)
!871 = !DILocalVariable(name: "dot", scope: !872, file: !8, line: 241, type: !159, align: 8)
!872 = distinct !DISubprogram(name: "refract3", linkageName: "refract3", scope: !8, file: !8, line: 239, scopeLine: 239, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !17)
!873 = !DILocation(line: 241, column: 6, scope: !872, inlinedAt: !874)
!874 = !DILocation(line: 64, column: 49, scope: !864)
!875 = !DILocation(line: 708, column: 64, scope: !876, inlinedAt: !877)
!876 = distinct !DISubprogram(name: "dot", linkageName: "dot", scope: !34, file: !34, line: 708, scopeLine: 708, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!877 = !DILocation(line: 241, column: 12, scope: !872, inlinedAt: !874)
!878 = !DILocation(line: 708, column: 68, scope: !876, inlinedAt: !877)
!879 = !DILocation(line: 693, column: 85, scope: !880, inlinedAt: !875)
!880 = distinct !DISubprogram(name: "sum", linkageName: "sum", scope: !34, file: !34, line: 693, scopeLine: 693, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!881 = !DILocation(line: 693, column: 82, scope: !880, inlinedAt: !875)
!882 = !DILocalVariable(name: "d", scope: !872, file: !8, line: 242, type: !159, align: 8)
!883 = !DILocation(line: 242, column: 6, scope: !872, inlinedAt: !874)
!884 = !DILocation(line: 242, column: 14, scope: !872, inlinedAt: !874)
!885 = !DILocation(line: 242, column: 18, scope: !872, inlinedAt: !874)
!886 = !DILocation(line: 242, column: 27, scope: !872, inlinedAt: !874)
!887 = !DILocation(line: 242, column: 33, scope: !872, inlinedAt: !874)
!888 = !DILocation(line: 242, column: 23, scope: !872, inlinedAt: !874)
!889 = !DILocation(line: 242, column: 10, scope: !872, inlinedAt: !874)
!890 = !DILocation(line: 244, column: 9, scope: !872, inlinedAt: !874)
!891 = !DILocation(line: 244, column: 17, scope: !872, inlinedAt: !874)
!892 = !DILocation(line: 244, column: 21, scope: !872, inlinedAt: !874)
!893 = !DILocation(line: 244, column: 25, scope: !872, inlinedAt: !874)
!894 = !DILocation(line: 244, column: 30, scope: !872, inlinedAt: !874)
!895 = !DILocation(line: 244, column: 34, scope: !872, inlinedAt: !874)
!896 = !DILocation(line: 26, column: 10, scope: !897, inlinedAt: !898)
!897 = distinct !DISubprogram(name: "promote_int", linkageName: "promote_int", scope: !52, file: !52, line: 21, scopeLine: 21, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!898 = !DILocation(line: 537, column: 25, scope: !899, inlinedAt: !900)
!899 = distinct !DISubprogram(name: "sqrt", linkageName: "sqrt", scope: !34, file: !34, line: 537, scopeLine: 537, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!900 = !DILocation(line: 244, column: 40, scope: !872, inlinedAt: !874)
!901 = !DILocation(line: 244, column: 57, scope: !872, inlinedAt: !874)
!902 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.float[<3>].rotate_quat", scope: !8, file: !8, line: 72, type: !903, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!903 = !DISubroutineType(types: !904)
!904 = !{!63, !64, !905}
!905 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !8, file: !8, line: 3, size: 128, align: 128, elements: !906, identifier: "std_math_quaternion$float$.Quaternion")
!906 = !{!907, !915}
!907 = !DIDerivedType(tag: DW_TAG_member, scope: !905, file: !8, line: 5, baseType: !908, size: 128, align: 128)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !905, file: !8, line: 5, size: 128, align: 128, elements: !909)
!909 = !{!910, !912, !913, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !908, file: !8, line: 7, baseType: !911, size: 32, align: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 98, baseType: !14, align: 4)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !908, file: !8, line: 7, baseType: !911, size: 32, align: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !908, file: !8, line: 7, baseType: !911, size: 32, align: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !908, file: !8, line: 7, baseType: !911, size: 32, align: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !905, file: !8, line: 9, baseType: !111, size: 128, align: 128)
!916 = !DILocalVariable(name: "self", arg: 1, scope: !902, file: !8, line: 72, type: !64)
!917 = !DILocation(line: 72, column: 28, scope: !902)
!918 = !DILocalVariable(name: "q", arg: 2, scope: !902, file: !8, line: 72, type: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternionf", scope: !8, file: !8, line: 98, baseType: !905, align: 16)
!920 = !DILocation(line: 72, column: 46, scope: !902)
!921 = !DILocation(line: 173, column: 3, scope: !922, inlinedAt: !923)
!922 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !8, file: !8, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!923 = !DILocation(line: 72, column: 52, scope: !902)
!924 = !DILocation(line: 173, column: 5, scope: !922, inlinedAt: !923)
!925 = !DILocation(line: 173, column: 11, scope: !922, inlinedAt: !923)
!926 = !DILocation(line: 173, column: 17, scope: !922, inlinedAt: !923)
!927 = !DILocation(line: 173, column: 23, scope: !922, inlinedAt: !923)
!928 = !DILocation(line: 173, column: 29, scope: !922, inlinedAt: !923)
!929 = !DILocation(line: 173, column: 35, scope: !922, inlinedAt: !923)
!930 = !DILocation(line: 173, column: 41, scope: !922, inlinedAt: !923)
!931 = !DILocation(line: 173, column: 47, scope: !922, inlinedAt: !923)
!932 = !DILocation(line: 173, column: 53, scope: !922, inlinedAt: !923)
!933 = !DILocation(line: 174, column: 6, scope: !922, inlinedAt: !923)
!934 = !DILocation(line: 174, column: 8, scope: !922, inlinedAt: !923)
!935 = !DILocation(line: 174, column: 18, scope: !922, inlinedAt: !923)
!936 = !DILocation(line: 174, column: 14, scope: !922, inlinedAt: !923)
!937 = !DILocation(line: 174, column: 24, scope: !922, inlinedAt: !923)
!938 = !DILocation(line: 174, column: 34, scope: !922, inlinedAt: !923)
!939 = !DILocation(line: 174, column: 30, scope: !922, inlinedAt: !923)
!940 = !DILocation(line: 174, column: 40, scope: !922, inlinedAt: !923)
!941 = !DILocation(line: 175, column: 6, scope: !922, inlinedAt: !923)
!942 = !DILocation(line: 175, column: 8, scope: !922, inlinedAt: !923)
!943 = !DILocation(line: 175, column: 18, scope: !922, inlinedAt: !923)
!944 = !DILocation(line: 175, column: 14, scope: !922, inlinedAt: !923)
!945 = !DILocation(line: 175, column: 24, scope: !922, inlinedAt: !923)
!946 = !DILocation(line: 175, column: 34, scope: !922, inlinedAt: !923)
!947 = !DILocation(line: 175, column: 30, scope: !922, inlinedAt: !923)
!948 = !DILocation(line: 175, column: 40, scope: !922, inlinedAt: !923)
!949 = !DILocation(line: 172, column: 9, scope: !922, inlinedAt: !923)
!950 = !DILocation(line: 176, column: 3, scope: !922, inlinedAt: !923)
!951 = !DILocation(line: 176, column: 5, scope: !922, inlinedAt: !923)
!952 = !DILocation(line: 176, column: 15, scope: !922, inlinedAt: !923)
!953 = !DILocation(line: 176, column: 11, scope: !922, inlinedAt: !923)
!954 = !DILocation(line: 176, column: 21, scope: !922, inlinedAt: !923)
!955 = !DILocation(line: 176, column: 31, scope: !922, inlinedAt: !923)
!956 = !DILocation(line: 176, column: 27, scope: !922, inlinedAt: !923)
!957 = !DILocation(line: 176, column: 37, scope: !922, inlinedAt: !923)
!958 = !DILocation(line: 177, column: 6, scope: !922, inlinedAt: !923)
!959 = !DILocation(line: 177, column: 8, scope: !922, inlinedAt: !923)
!960 = !DILocation(line: 177, column: 14, scope: !922, inlinedAt: !923)
!961 = !DILocation(line: 177, column: 20, scope: !922, inlinedAt: !923)
!962 = !DILocation(line: 177, column: 26, scope: !922, inlinedAt: !923)
!963 = !DILocation(line: 177, column: 32, scope: !922, inlinedAt: !923)
!964 = !DILocation(line: 177, column: 38, scope: !922, inlinedAt: !923)
!965 = !DILocation(line: 177, column: 44, scope: !922, inlinedAt: !923)
!966 = !DILocation(line: 177, column: 50, scope: !922, inlinedAt: !923)
!967 = !DILocation(line: 177, column: 56, scope: !922, inlinedAt: !923)
!968 = !DILocation(line: 178, column: 6, scope: !922, inlinedAt: !923)
!969 = !DILocation(line: 178, column: 8, scope: !922, inlinedAt: !923)
!970 = !DILocation(line: 178, column: 19, scope: !922, inlinedAt: !923)
!971 = !DILocation(line: 178, column: 14, scope: !922, inlinedAt: !923)
!972 = !DILocation(line: 178, column: 25, scope: !922, inlinedAt: !923)
!973 = !DILocation(line: 178, column: 35, scope: !922, inlinedAt: !923)
!974 = !DILocation(line: 178, column: 31, scope: !922, inlinedAt: !923)
!975 = !DILocation(line: 178, column: 41, scope: !922, inlinedAt: !923)
!976 = !DILocation(line: 179, column: 3, scope: !922, inlinedAt: !923)
!977 = !DILocation(line: 179, column: 5, scope: !922, inlinedAt: !923)
!978 = !DILocation(line: 179, column: 16, scope: !922, inlinedAt: !923)
!979 = !DILocation(line: 179, column: 11, scope: !922, inlinedAt: !923)
!980 = !DILocation(line: 179, column: 22, scope: !922, inlinedAt: !923)
!981 = !DILocation(line: 179, column: 32, scope: !922, inlinedAt: !923)
!982 = !DILocation(line: 179, column: 28, scope: !922, inlinedAt: !923)
!983 = !DILocation(line: 179, column: 38, scope: !922, inlinedAt: !923)
!984 = !DILocation(line: 180, column: 6, scope: !922, inlinedAt: !923)
!985 = !DILocation(line: 180, column: 8, scope: !922, inlinedAt: !923)
!986 = !DILocation(line: 180, column: 18, scope: !922, inlinedAt: !923)
!987 = !DILocation(line: 180, column: 14, scope: !922, inlinedAt: !923)
!988 = !DILocation(line: 180, column: 24, scope: !922, inlinedAt: !923)
!989 = !DILocation(line: 180, column: 34, scope: !922, inlinedAt: !923)
!990 = !DILocation(line: 180, column: 30, scope: !922, inlinedAt: !923)
!991 = !DILocation(line: 180, column: 40, scope: !922, inlinedAt: !923)
!992 = !DILocation(line: 181, column: 6, scope: !922, inlinedAt: !923)
!993 = !DILocation(line: 181, column: 8, scope: !922, inlinedAt: !923)
!994 = !DILocation(line: 181, column: 14, scope: !922, inlinedAt: !923)
!995 = !DILocation(line: 181, column: 20, scope: !922, inlinedAt: !923)
!996 = !DILocation(line: 181, column: 26, scope: !922, inlinedAt: !923)
!997 = !DILocation(line: 181, column: 32, scope: !922, inlinedAt: !923)
!998 = !DILocation(line: 181, column: 38, scope: !922, inlinedAt: !923)
!999 = !DILocation(line: 181, column: 44, scope: !922, inlinedAt: !923)
!1000 = !DILocation(line: 181, column: 50, scope: !922, inlinedAt: !923)
!1001 = !DILocation(line: 181, column: 56, scope: !922, inlinedAt: !923)
!1002 = distinct !DISubprogram(name: "rotate_quat", linkageName: "std.math.vector.double[<3>].rotate_quat", scope: !8, file: !8, line: 73, type: !1003, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !17)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!203, !204, !1005}
!1005 = !DICompositeType(tag: DW_TAG_union_type, name: "Quaternion", scope: !8, file: !8, line: 3, size: 256, align: 256, elements: !1006, identifier: "std_math_quaternion$double$.Quaternion")
!1006 = !{!1007, !1015}
!1007 = !DIDerivedType(tag: DW_TAG_member, scope: !1005, file: !8, line: 5, baseType: !1008, size: 256, align: 256)
!1008 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !1005, file: !8, line: 5, size: 256, align: 256, elements: !1009)
!1009 = !{!1010, !1012, !1013, !1014}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !1008, file: !8, line: 7, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "Real", scope: !8, file: !8, line: 99, baseType: !159, align: 8)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !1008, file: !8, line: 7, baseType: !1011, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !1008, file: !8, line: 7, baseType: !1011, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1008, file: !8, line: 7, baseType: !1011, size: 64, align: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1005, file: !8, line: 9, baseType: !249, size: 256, align: 256)
!1016 = !DILocalVariable(name: "self", arg: 1, scope: !1002, file: !8, line: 73, type: !204)
!1017 = !DILocation(line: 73, column: 26, scope: !1002)
!1018 = !DILocalVariable(name: "q", arg: 2, scope: !1002, file: !8, line: 73, type: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quaternion", scope: !8, file: !8, line: 99, baseType: !1005, align: 32)
!1020 = !DILocation(line: 73, column: 43, scope: !1002)
!1021 = !DILocation(line: 173, column: 3, scope: !1022, inlinedAt: !1023)
!1022 = distinct !DISubprogram(name: "rotate_by_quat3", linkageName: "rotate_by_quat3", scope: !8, file: !8, line: 170, scopeLine: 170, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!1023 = !DILocation(line: 73, column: 49, scope: !1002)
!1024 = !DILocation(line: 173, column: 5, scope: !1022, inlinedAt: !1023)
!1025 = !DILocation(line: 173, column: 11, scope: !1022, inlinedAt: !1023)
!1026 = !DILocation(line: 173, column: 17, scope: !1022, inlinedAt: !1023)
!1027 = !DILocation(line: 173, column: 23, scope: !1022, inlinedAt: !1023)
!1028 = !DILocation(line: 173, column: 29, scope: !1022, inlinedAt: !1023)
!1029 = !DILocation(line: 173, column: 35, scope: !1022, inlinedAt: !1023)
!1030 = !DILocation(line: 173, column: 41, scope: !1022, inlinedAt: !1023)
!1031 = !DILocation(line: 173, column: 47, scope: !1022, inlinedAt: !1023)
!1032 = !DILocation(line: 173, column: 53, scope: !1022, inlinedAt: !1023)
!1033 = !DILocation(line: 174, column: 6, scope: !1022, inlinedAt: !1023)
!1034 = !DILocation(line: 174, column: 8, scope: !1022, inlinedAt: !1023)
!1035 = !DILocation(line: 174, column: 18, scope: !1022, inlinedAt: !1023)
!1036 = !DILocation(line: 174, column: 14, scope: !1022, inlinedAt: !1023)
!1037 = !DILocation(line: 174, column: 24, scope: !1022, inlinedAt: !1023)
!1038 = !DILocation(line: 174, column: 34, scope: !1022, inlinedAt: !1023)
!1039 = !DILocation(line: 174, column: 30, scope: !1022, inlinedAt: !1023)
!1040 = !DILocation(line: 174, column: 40, scope: !1022, inlinedAt: !1023)
!1041 = !DILocation(line: 175, column: 6, scope: !1022, inlinedAt: !1023)
!1042 = !DILocation(line: 175, column: 8, scope: !1022, inlinedAt: !1023)
!1043 = !DILocation(line: 175, column: 18, scope: !1022, inlinedAt: !1023)
!1044 = !DILocation(line: 175, column: 14, scope: !1022, inlinedAt: !1023)
!1045 = !DILocation(line: 175, column: 24, scope: !1022, inlinedAt: !1023)
!1046 = !DILocation(line: 175, column: 34, scope: !1022, inlinedAt: !1023)
!1047 = !DILocation(line: 175, column: 30, scope: !1022, inlinedAt: !1023)
!1048 = !DILocation(line: 175, column: 40, scope: !1022, inlinedAt: !1023)
!1049 = !DILocation(line: 172, column: 9, scope: !1022, inlinedAt: !1023)
!1050 = !DILocation(line: 176, column: 3, scope: !1022, inlinedAt: !1023)
!1051 = !DILocation(line: 176, column: 5, scope: !1022, inlinedAt: !1023)
!1052 = !DILocation(line: 176, column: 15, scope: !1022, inlinedAt: !1023)
!1053 = !DILocation(line: 176, column: 11, scope: !1022, inlinedAt: !1023)
!1054 = !DILocation(line: 176, column: 21, scope: !1022, inlinedAt: !1023)
!1055 = !DILocation(line: 176, column: 31, scope: !1022, inlinedAt: !1023)
!1056 = !DILocation(line: 176, column: 27, scope: !1022, inlinedAt: !1023)
!1057 = !DILocation(line: 176, column: 37, scope: !1022, inlinedAt: !1023)
!1058 = !DILocation(line: 177, column: 6, scope: !1022, inlinedAt: !1023)
!1059 = !DILocation(line: 177, column: 8, scope: !1022, inlinedAt: !1023)
!1060 = !DILocation(line: 177, column: 14, scope: !1022, inlinedAt: !1023)
!1061 = !DILocation(line: 177, column: 20, scope: !1022, inlinedAt: !1023)
!1062 = !DILocation(line: 177, column: 26, scope: !1022, inlinedAt: !1023)
!1063 = !DILocation(line: 177, column: 32, scope: !1022, inlinedAt: !1023)
