; ModuleID = 'std::io::os'
source_filename = "std::io::os"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%PathImp = type { %"char[]", i32 }
%List = type { i64, i64, %any, ptr }
%"any[]" = type { ptr, i64 }
%Stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [3 x i64] }
%File = type { ptr }

$std.io.os.native_rmtree = comdat any

$std.io.os.native_fopen = comdat any

$std.io.os.native_remove = comdat any

$std.io.os.native_freopen = comdat any

$std.io.os.native_fseek = comdat any

$std.io.os.native_ftell = comdat any

$std.io.os.native_fwrite = comdat any

$std.io.os.native_fputc = comdat any

$std.io.os.native_fread = comdat any

$std.io.os.native_ls = comdat any

$std.io.os.native_temp_directory = comdat any

$std.io.os.native_file_or_dir_exists = comdat any

$std.io.os.native_is_file = comdat any

$std.io.os.native_is_dir = comdat any

$std.io.os.native_stat = comdat any

$std.io.os.native_file_size = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any

$"std.io.IoError$BUSY" = comdat any

$"std.io.IoError$CANNOT_READ_DIR" = comdat any

$"std.io.IoError$DIR_NOT_EMPTY" = comdat any

$"std.io.IoError$EOF" = comdat any

$"std.io.IoError$FILE_CANNOT_DELETE" = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, splitDebugInlining: false)
!8 = !DIFile(filename: "chdir.c3", directory: "/usr/local/lib/c3/std/io/os")
!9 = !{!10, !29}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PathEnv", scope: !12, file: !11, line: 26, baseType: !25, size: 32, align: 32, elements: !26)
!11 = !DIFile(filename: "rmtree.c3", directory: "/usr/local/lib/c3/std/io/os")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "PathImp", scope: !11, file: !11, line: 20, size: 192, align: 64, elements: !13, identifier: "std.io.path.PathImp")
!13 = !{!14, !24}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "path_string", scope: !12, file: !11, line: 22, baseType: !15, size: 128, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !17, identifier: "char[]")
!17 = !{!18, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !16, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !16, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !23)
!23 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !12, file: !11, line: 23, baseType: !10, size: 32, align: 32, offset: 128)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !{!27, !28}
!27 = !DIEnumerator(name: "WIN32", value: 0)
!28 = !DIEnumerator(name: "POSIX", value: 1)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Seek", scope: !30, file: !30, line: 7, baseType: !25, size: 32, align: 32, elements: !31)
!30 = !DIFile(filename: "file_libc.c3", directory: "/usr/local/lib/c3/std/io/os")
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "SET", value: 0)
!33 = !DIEnumerator(name: "CURSOR", value: 1)
!34 = !DIEnumerator(name: "END", value: 2)
!35 = distinct !DISubprogram(name: "native_rmtree", linkageName: "std.io.os.native_rmtree", scope: !11, file: !11, line: 7, type: !36, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !40, !12}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !39)
!39 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !{}
!42 = !DILocalVariable(name: "dir", arg: 1, scope: !35, file: !11, line: 7, type: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "Path", scope: !44, file: !44, line: 18, baseType: !12, align: 8)
!44 = !DIFile(filename: "temp_directory.c3", directory: "/usr/local/lib/c3/std/io/os")
!45 = !DILocation(line: 7, column: 29, scope: !35)
!46 = !DILocation(line: 5, column: 11, scope: !47)
!47 = distinct !DILexicalBlock(scope: !35, file: !11, line: 8, column: 1)
!48 = !DILocalVariable(name: "directory", scope: !35, file: !11, line: 9, type: !49, align: 8)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIRPtr", scope: !11, file: !11, line: 5, baseType: !40, align: 8)
!50 = !DILocation(line: 9, column: 9, scope: !35)
!51 = !DILocation(line: 9, column: 36, scope: !35)
!52 = !DILocation(line: 9, column: 21, scope: !35)
!53 = !DILocation(line: 11, column: 6, scope: !35)
!54 = !DILocation(line: 11, column: 25, scope: !35)
!55 = !DILocation(line: 11, column: 45, scope: !35)
!56 = !DILocation(line: 11, column: 72, scope: !35)
!57 = !DILocation(line: 10, column: 12, scope: !58)
!58 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!59 = !DILocation(line: 10, column: 39, scope: !58)
!60 = !DILocation(line: 10, column: 23, scope: !58)
!61 = !DILocation(line: 10, column: 12, scope: !62)
!62 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!63 = !DILocation(line: 10, column: 39, scope: !62)
!64 = !DILocation(line: 10, column: 23, scope: !62)
!65 = !DILocalVariable(name: "entry", scope: !35, file: !11, line: 12, type: !66, align: 8)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Posix_dirent*", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Posix_dirent", scope: !11, file: !11, line: 7, size: 192, align: 64, elements: !68, identifier: "std.os.posix.Posix_dirent")
!68 = !{!69, !72, !74, !76, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "d_fileno", scope: !67, file: !11, line: 9, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ino_t", scope: !71, file: !71, line: 8, baseType: !23, align: 8)
!71 = !DIFile(filename: "fileinfo.c3", directory: "/usr/local/lib/c3/std/io/os")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !67, file: !11, line: 10, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "Off_t", scope: !71, file: !71, line: 65, baseType: !23, align: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !67, file: !11, line: 11, baseType: !75, size: 16, align: 16, offset: 128)
!75 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !67, file: !11, line: 13, baseType: !20, size: 8, align: 8, offset: 144)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !11, line: 25, baseType: !78, align: 8, offset: 152)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 0, lowerBound: 0)
!81 = !DILocation(line: 12, column: 16, scope: !35)
!82 = !DILocation(line: 13, column: 2, scope: !35)
!83 = !DILocation(line: 13, column: 33, scope: !84)
!84 = distinct !DILexicalBlock(scope: !35, file: !11, line: 13, column: 2)
!85 = !DILocation(line: 13, column: 18, scope: !84)
!86 = !DILocalVariable(name: "current", scope: !87, file: !11, line: 592, type: !89, align: 8)
!87 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !88, file: !88, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !41)
!88 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !11, file: !11, line: 10, size: 320, align: 64, elements: !91, identifier: "std.core.mem.allocator.TempAllocator")
!91 = !{!92, !98, !108, !109, !110}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !90, file: !11, line: 12, baseType: !93, size: 128, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !94, identifier: "Allocator")
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !93, baseType: !40, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !90, file: !11, line: 13, baseType: !99, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !11, file: !11, line: 22, size: 320, align: 64, elements: !101, identifier: "std.core.mem.allocator.TempAllocatorPage")
!101 = !{!102, !103, !104, !105, !106, !107}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !100, file: !11, line: 24, baseType: !99, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !100, file: !11, line: 25, baseType: !40, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !100, file: !11, line: 26, baseType: !22, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !11, line: 27, baseType: !22, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !100, file: !11, line: 28, baseType: !22, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !11, line: 29, baseType: !78, align: 8, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !90, file: !11, line: 14, baseType: !22, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !90, file: !11, line: 15, baseType: !22, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !11, line: 16, baseType: !78, align: 8, offset: 320)
!111 = !DILocation(line: 592, column: 17, scope: !87, inlinedAt: !112)
!112 = !DILocation(line: 15, column: 3, scope: !113)
!113 = distinct !DILexicalBlock(scope: !84, file: !11, line: 14, column: 2)
!114 = !DILocation(line: 396, column: 6, scope: !115, inlinedAt: !117)
!115 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !116, file: !116, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!116 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!117 = !DILocation(line: 592, column: 27, scope: !87, inlinedAt: !112)
!118 = !DILocation(line: 398, column: 3, scope: !119, inlinedAt: !117)
!119 = distinct !DILexicalBlock(scope: !115, file: !116, line: 397, column: 2)
!120 = !DILocation(line: 400, column: 9, scope: !115, inlinedAt: !117)
!121 = !DILocalVariable(name: "mark", scope: !87, file: !11, line: 597, type: !22, align: 8)
!122 = !DILocation(line: 597, column: 6, scope: !87, inlinedAt: !112)
!123 = !DILocation(line: 597, column: 13, scope: !87, inlinedAt: !112)
!124 = !DILocalVariable(name: "name", scope: !125, file: !11, line: 17, type: !15, align: 8)
!125 = distinct !DILexicalBlock(scope: !113, file: !11, line: 16, column: 3)
!126 = !DILocation(line: 17, column: 11, scope: !125)
!127 = !DILocation(line: 17, column: 29, scope: !125)
!128 = !DILocation(line: 17, column: 20, scope: !125)
!129 = !DILocation(line: 18, column: 9, scope: !125)
!130 = !DILocation(line: 18, column: 17, scope: !125)
!131 = !DILocation(line: 18, column: 32, scope: !125)
!132 = !DILocation(line: 600, column: 17, scope: !133, inlinedAt: !112)
!133 = distinct !DILexicalBlock(scope: !87, file: !88, line: 599, column: 2)
!134 = !DILocation(line: 600, column: 3, scope: !133, inlinedAt: !112)
!135 = !DILocation(line: 603, column: 9, scope: !133, inlinedAt: !112)
!136 = !DILocalVariable(name: "new_path", scope: !125, file: !11, line: 19, type: !43, align: 8)
!137 = !DILocation(line: 19, column: 9, scope: !125)
!138 = !DILocation(line: 19, column: 20, scope: !125)
!139 = !DILocation(line: 600, column: 17, scope: !140, inlinedAt: !112)
!140 = distinct !DILexicalBlock(scope: !87, file: !88, line: 599, column: 2)
!141 = !DILocation(line: 600, column: 3, scope: !140, inlinedAt: !112)
!142 = !DILocation(line: 10, column: 12, scope: !143)
!143 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!144 = !DILocation(line: 10, column: 39, scope: !143)
!145 = !DILocation(line: 10, column: 23, scope: !143)
!146 = !DILocation(line: 20, column: 8, scope: !125)
!147 = !DILocation(line: 22, column: 5, scope: !148)
!148 = distinct !DILexicalBlock(scope: !125, file: !11, line: 21, column: 4)
!149 = !DILocation(line: 600, column: 17, scope: !150, inlinedAt: !112)
!150 = distinct !DILexicalBlock(scope: !87, file: !88, line: 599, column: 2)
!151 = !DILocation(line: 600, column: 3, scope: !150, inlinedAt: !112)
!152 = !DILocation(line: 10, column: 12, scope: !153)
!153 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!154 = !DILocation(line: 10, column: 39, scope: !153)
!155 = !DILocation(line: 10, column: 23, scope: !153)
!156 = !DILocation(line: 600, column: 17, scope: !157, inlinedAt: !112)
!157 = distinct !DILexicalBlock(scope: !87, file: !88, line: 599, column: 2)
!158 = !DILocation(line: 600, column: 3, scope: !157, inlinedAt: !112)
!159 = !DILocation(line: 603, column: 9, scope: !157, inlinedAt: !112)
!160 = !DILocation(line: 25, column: 21, scope: !125)
!161 = !DILocation(line: 25, column: 8, scope: !125)
!162 = !DILocation(line: 600, column: 17, scope: !163, inlinedAt: !112)
!163 = distinct !DILexicalBlock(scope: !87, file: !88, line: 599, column: 2)
!164 = !DILocation(line: 600, column: 3, scope: !163, inlinedAt: !112)
!165 = !DILocation(line: 10, column: 12, scope: !166)
!166 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!167 = !DILocation(line: 10, column: 39, scope: !166)
!168 = !DILocation(line: 10, column: 23, scope: !166)
!169 = !DILocation(line: 600, column: 17, scope: !170, inlinedAt: !112)
!170 = distinct !DILexicalBlock(scope: !87, file: !88, line: 599, column: 2)
!171 = !DILocation(line: 600, column: 3, scope: !170, inlinedAt: !112)
!172 = !DILocation(line: 603, column: 9, scope: !170, inlinedAt: !112)
!173 = !DILocation(line: 11, column: 22, scope: !174, inlinedAt: !176)
!174 = distinct !DISubprogram(name: "native_rmdir", linkageName: "native_rmdir", scope: !175, file: !175, line: 7, scopeLine: 7, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!175 = !DIFile(filename: "rmdir.c3", directory: "/usr/local/lib/c3/std/io/os")
!176 = !DILocation(line: 32, column: 2, scope: !35)
!177 = !DILocation(line: 11, column: 8, scope: !174, inlinedAt: !176)
!178 = !DILocation(line: 11, column: 46, scope: !174, inlinedAt: !176)
!179 = !DILocation(line: 12, column: 12, scope: !180, inlinedAt: !176)
!180 = distinct !DILexicalBlock(scope: !174, file: !175, line: 12, column: 4)
!181 = !DILocation(line: 14, column: 31, scope: !182, inlinedAt: !176)
!182 = distinct !DILexicalBlock(scope: !180, file: !175, line: 14, column: 24)
!183 = !DILocation(line: 18, column: 32, scope: !184, inlinedAt: !176)
!184 = distinct !DILexicalBlock(scope: !180, file: !175, line: 18, column: 25)
!185 = !DILocation(line: 19, column: 38, scope: !186, inlinedAt: !176)
!186 = distinct !DILexicalBlock(scope: !180, file: !175, line: 19, column: 31)
!187 = !DILocation(line: 21, column: 32, scope: !188, inlinedAt: !176)
!188 = distinct !DILexicalBlock(scope: !180, file: !175, line: 21, column: 25)
!189 = !DILocation(line: 22, column: 35, scope: !190, inlinedAt: !176)
!190 = distinct !DILexicalBlock(scope: !180, file: !175, line: 22, column: 28)
!191 = !DILocation(line: 23, column: 31, scope: !192, inlinedAt: !176)
!192 = distinct !DILexicalBlock(scope: !180, file: !175, line: 23, column: 24)
!193 = !DILocation(line: 24, column: 21, scope: !194, inlinedAt: !176)
!194 = distinct !DILexicalBlock(scope: !180, file: !175, line: 24, column: 14)
!195 = !DILocation(line: 10, column: 12, scope: !196)
!196 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!197 = !DILocation(line: 10, column: 39, scope: !196)
!198 = !DILocation(line: 10, column: 23, scope: !196)
!199 = !DILocation(line: 10, column: 12, scope: !200)
!200 = distinct !DILexicalBlock(scope: !35, file: !11, line: 10, column: 8)
!201 = !DILocation(line: 10, column: 39, scope: !200)
!202 = !DILocation(line: 10, column: 23, scope: !200)
!203 = distinct !DISubprogram(name: "native_fopen", linkageName: "std.io.os.native_fopen", scope: !30, file: !30, line: 8, type: !204, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!204 = !DISubroutineType(types: !205)
!205 = !{!38, !206, !15, !15}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!207 = !DILocalVariable(name: "filename", arg: 1, scope: !203, file: !30, line: 8, type: !15)
!208 = !DILocation(line: 8, column: 31, scope: !203)
!209 = !DILocalVariable(name: "mode", arg: 2, scope: !203, file: !30, line: 8, type: !15)
!210 = !DILocation(line: 8, column: 48, scope: !203)
!211 = !DILocation(line: 5, column: 11, scope: !212)
!212 = distinct !DILexicalBlock(scope: !203, file: !30, line: 8, column: 65)
!213 = !DILocation(line: 6, column: 11, scope: !212)
!214 = !DILocalVariable(name: "current", scope: !215, file: !30, line: 592, type: !89, align: 8)
!215 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !88, file: !88, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !41)
!216 = !DILocation(line: 592, column: 17, scope: !215, inlinedAt: !217)
!217 = !DILocation(line: 8, column: 65, scope: !203)
!218 = !DILocation(line: 396, column: 6, scope: !219, inlinedAt: !220)
!219 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !116, file: !116, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!220 = !DILocation(line: 592, column: 27, scope: !215, inlinedAt: !217)
!221 = !DILocation(line: 398, column: 3, scope: !222, inlinedAt: !220)
!222 = distinct !DILexicalBlock(scope: !219, file: !116, line: 397, column: 2)
!223 = !DILocation(line: 400, column: 9, scope: !219, inlinedAt: !220)
!224 = !DILocalVariable(name: "mark", scope: !215, file: !30, line: 597, type: !22, align: 8)
!225 = !DILocation(line: 597, column: 6, scope: !215, inlinedAt: !217)
!226 = !DILocation(line: 597, column: 13, scope: !215, inlinedAt: !217)
!227 = !DILocalVariable(name: "file", scope: !228, file: !30, line: 13, type: !40, align: 8)
!228 = distinct !DILexicalBlock(scope: !203, file: !30, line: 9, column: 1)
!229 = !DILocation(line: 13, column: 9, scope: !228)
!230 = !DILocation(line: 13, column: 28, scope: !228)
!231 = !DILocation(line: 13, column: 51, scope: !228)
!232 = !DILocation(line: 13, column: 16, scope: !228)
!233 = !DILocation(line: 15, column: 10, scope: !228)
!234 = !DILocation(line: 81, column: 10, scope: !235, inlinedAt: !237)
!235 = distinct !DILexicalBlock(scope: !236, file: !30, line: 81, column: 2)
!236 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !30, file: !30, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!237 = !DILocation(line: 15, column: 18, scope: !228)
!238 = !DILocation(line: 83, column: 30, scope: !239, inlinedAt: !237)
!239 = distinct !DILexicalBlock(scope: !235, file: !30, line: 83, column: 23)
!240 = !DILocation(line: 84, column: 30, scope: !241, inlinedAt: !237)
!241 = distinct !DILexicalBlock(scope: !235, file: !30, line: 84, column: 23)
!242 = !DILocation(line: 85, column: 29, scope: !243, inlinedAt: !237)
!243 = distinct !DILexicalBlock(scope: !235, file: !30, line: 85, column: 22)
!244 = !DILocation(line: 86, column: 30, scope: !245, inlinedAt: !237)
!245 = distinct !DILexicalBlock(scope: !235, file: !30, line: 86, column: 23)
!246 = !DILocation(line: 87, column: 29, scope: !247, inlinedAt: !237)
!247 = distinct !DILexicalBlock(scope: !235, file: !30, line: 87, column: 22)
!248 = !DILocation(line: 88, column: 30, scope: !249, inlinedAt: !237)
!249 = distinct !DILexicalBlock(scope: !235, file: !30, line: 88, column: 23)
!250 = !DILocation(line: 89, column: 30, scope: !251, inlinedAt: !237)
!251 = distinct !DILexicalBlock(scope: !235, file: !30, line: 89, column: 23)
!252 = !DILocation(line: 90, column: 29, scope: !253, inlinedAt: !237)
!253 = distinct !DILexicalBlock(scope: !235, file: !30, line: 90, column: 22)
!254 = !DILocation(line: 91, column: 30, scope: !255, inlinedAt: !237)
!255 = distinct !DILexicalBlock(scope: !235, file: !30, line: 91, column: 23)
!256 = !DILocation(line: 92, column: 36, scope: !257, inlinedAt: !237)
!257 = distinct !DILexicalBlock(scope: !235, file: !30, line: 92, column: 29)
!258 = !DILocation(line: 93, column: 30, scope: !259, inlinedAt: !237)
!259 = distinct !DILexicalBlock(scope: !235, file: !30, line: 93, column: 23)
!260 = !DILocation(line: 94, column: 31, scope: !261, inlinedAt: !237)
!261 = distinct !DILexicalBlock(scope: !235, file: !30, line: 94, column: 24)
!262 = !DILocation(line: 95, column: 30, scope: !263, inlinedAt: !237)
!263 = distinct !DILexicalBlock(scope: !235, file: !30, line: 95, column: 23)
!264 = !DILocation(line: 96, column: 30, scope: !265, inlinedAt: !237)
!265 = distinct !DILexicalBlock(scope: !235, file: !30, line: 96, column: 23)
!266 = !DILocation(line: 97, column: 29, scope: !267, inlinedAt: !237)
!267 = distinct !DILexicalBlock(scope: !235, file: !30, line: 97, column: 22)
!268 = !DILocation(line: 98, column: 33, scope: !269, inlinedAt: !237)
!269 = distinct !DILexicalBlock(scope: !235, file: !30, line: 98, column: 26)
!270 = !DILocation(line: 99, column: 29, scope: !271, inlinedAt: !237)
!271 = distinct !DILexicalBlock(scope: !235, file: !30, line: 99, column: 22)
!272 = !DILocation(line: 100, column: 34, scope: !273, inlinedAt: !237)
!273 = distinct !DILexicalBlock(scope: !235, file: !30, line: 100, column: 27)
!274 = !DILocation(line: 101, column: 27, scope: !275, inlinedAt: !237)
!275 = distinct !DILexicalBlock(scope: !235, file: !30, line: 101, column: 20)
!276 = !DILocation(line: 102, column: 35, scope: !277, inlinedAt: !237)
!277 = distinct !DILexicalBlock(scope: !235, file: !30, line: 102, column: 28)
!278 = !DILocation(line: 103, column: 19, scope: !279, inlinedAt: !237)
!279 = distinct !DILexicalBlock(scope: !235, file: !30, line: 103, column: 12)
!280 = !DILocation(line: 600, column: 17, scope: !281, inlinedAt: !217)
!281 = distinct !DILexicalBlock(scope: !215, file: !88, line: 599, column: 2)
!282 = !DILocation(line: 600, column: 3, scope: !281, inlinedAt: !217)
!283 = !DILocation(line: 603, column: 9, scope: !281, inlinedAt: !217)
!284 = !DILocation(line: 600, column: 17, scope: !285, inlinedAt: !217)
!285 = distinct !DILexicalBlock(scope: !215, file: !88, line: 599, column: 2)
!286 = !DILocation(line: 600, column: 3, scope: !285, inlinedAt: !217)
!287 = !DILocation(line: 603, column: 9, scope: !285, inlinedAt: !217)
!288 = distinct !DISubprogram(name: "native_remove", linkageName: "std.io.os.native_remove", scope: !30, file: !30, line: 18, type: !289, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!289 = !DISubroutineType(types: !290)
!290 = !{!38, !40, !15}
!291 = !DILocalVariable(name: "filename", arg: 1, scope: !288, file: !30, line: 18, type: !15)
!292 = !DILocation(line: 18, column: 31, scope: !288)
!293 = !DILocalVariable(name: "current", scope: !294, file: !30, line: 592, type: !89, align: 8)
!294 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !88, file: !88, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !41)
!295 = !DILocation(line: 592, column: 17, scope: !294, inlinedAt: !296)
!296 = !DILocation(line: 18, column: 44, scope: !288)
!297 = !DILocation(line: 396, column: 6, scope: !298, inlinedAt: !299)
!298 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !116, file: !116, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!299 = !DILocation(line: 592, column: 27, scope: !294, inlinedAt: !296)
!300 = !DILocation(line: 398, column: 3, scope: !301, inlinedAt: !299)
!301 = distinct !DILexicalBlock(scope: !298, file: !116, line: 397, column: 2)
!302 = !DILocation(line: 400, column: 9, scope: !298, inlinedAt: !299)
!303 = !DILocalVariable(name: "mark", scope: !294, file: !30, line: 597, type: !22, align: 8)
!304 = !DILocation(line: 597, column: 6, scope: !294, inlinedAt: !296)
!305 = !DILocation(line: 597, column: 13, scope: !294, inlinedAt: !296)
!306 = !DILocalVariable(name: "result", scope: !307, file: !30, line: 23, type: !308, align: 4)
!307 = distinct !DILexicalBlock(scope: !288, file: !30, line: 19, column: 1)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !71, file: !71, line: 21, baseType: !25, align: 4)
!309 = !DILocation(line: 23, column: 8, scope: !307)
!310 = !DILocation(line: 23, column: 30, scope: !307)
!311 = !DILocation(line: 23, column: 17, scope: !307)
!312 = !DILocation(line: 25, column: 6, scope: !307)
!313 = !DILocation(line: 27, column: 11, scope: !314)
!314 = distinct !DILexicalBlock(scope: !315, file: !30, line: 27, column: 3)
!315 = distinct !DILexicalBlock(scope: !307, file: !30, line: 26, column: 2)
!316 = !DILocation(line: 600, column: 17, scope: !317, inlinedAt: !296)
!317 = distinct !DILexicalBlock(scope: !294, file: !88, line: 599, column: 2)
!318 = !DILocation(line: 600, column: 3, scope: !317, inlinedAt: !296)
!319 = !DILocation(line: 603, column: 9, scope: !317, inlinedAt: !296)
!320 = !DILocation(line: 600, column: 17, scope: !321, inlinedAt: !296)
!321 = distinct !DILexicalBlock(scope: !294, file: !88, line: 599, column: 2)
!322 = !DILocation(line: 600, column: 3, scope: !321, inlinedAt: !296)
!323 = !DILocation(line: 603, column: 9, scope: !321, inlinedAt: !296)
!324 = !DILocation(line: 600, column: 17, scope: !325, inlinedAt: !296)
!325 = distinct !DILexicalBlock(scope: !294, file: !88, line: 599, column: 2)
!326 = !DILocation(line: 600, column: 3, scope: !325, inlinedAt: !296)
!327 = !DILocation(line: 603, column: 9, scope: !325, inlinedAt: !296)
!328 = distinct !DISubprogram(name: "native_freopen", linkageName: "std.io.os.native_freopen", scope: !30, file: !30, line: 42, type: !329, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!329 = !DISubroutineType(types: !330)
!330 = !{!38, !206, !40, !15, !15}
!331 = !DILocalVariable(name: "file", arg: 1, scope: !328, file: !30, line: 42, type: !40)
!332 = !DILocation(line: 42, column: 32, scope: !328)
!333 = !DILocalVariable(name: "filename", arg: 2, scope: !328, file: !30, line: 42, type: !15)
!334 = !DILocation(line: 42, column: 45, scope: !328)
!335 = !DILocalVariable(name: "mode", arg: 3, scope: !328, file: !30, line: 42, type: !15)
!336 = !DILocation(line: 42, column: 62, scope: !328)
!337 = !DILocation(line: 39, column: 11, scope: !338)
!338 = distinct !DILexicalBlock(scope: !328, file: !30, line: 42, column: 79)
!339 = !DILocation(line: 40, column: 11, scope: !338)
!340 = !DILocalVariable(name: "current", scope: !341, file: !30, line: 592, type: !89, align: 8)
!341 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !88, file: !88, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !41)
!342 = !DILocation(line: 592, column: 17, scope: !341, inlinedAt: !343)
!343 = !DILocation(line: 42, column: 79, scope: !328)
!344 = !DILocation(line: 396, column: 6, scope: !345, inlinedAt: !346)
!345 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !116, file: !116, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!346 = !DILocation(line: 592, column: 27, scope: !341, inlinedAt: !343)
!347 = !DILocation(line: 398, column: 3, scope: !348, inlinedAt: !346)
!348 = distinct !DILexicalBlock(scope: !345, file: !116, line: 397, column: 2)
!349 = !DILocation(line: 400, column: 9, scope: !345, inlinedAt: !346)
!350 = !DILocalVariable(name: "mark", scope: !341, file: !30, line: 597, type: !22, align: 8)
!351 = !DILocation(line: 597, column: 6, scope: !341, inlinedAt: !343)
!352 = !DILocation(line: 597, column: 13, scope: !341, inlinedAt: !343)
!353 = !DILocation(line: 47, column: 24, scope: !354)
!354 = distinct !DILexicalBlock(scope: !328, file: !30, line: 43, column: 1)
!355 = !DILocation(line: 47, column: 47, scope: !354)
!356 = !DILocation(line: 47, column: 66, scope: !354)
!357 = !DILocation(line: 47, column: 10, scope: !354)
!358 = !DILocation(line: 49, column: 10, scope: !354)
!359 = !DILocation(line: 81, column: 10, scope: !360, inlinedAt: !362)
!360 = distinct !DILexicalBlock(scope: !361, file: !30, line: 81, column: 2)
!361 = distinct !DISubprogram(name: "file_open_errno", linkageName: "file_open_errno", scope: !30, file: !30, line: 79, scopeLine: 79, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!362 = !DILocation(line: 49, column: 18, scope: !354)
!363 = !DILocation(line: 83, column: 30, scope: !364, inlinedAt: !362)
!364 = distinct !DILexicalBlock(scope: !360, file: !30, line: 83, column: 23)
!365 = !DILocation(line: 84, column: 30, scope: !366, inlinedAt: !362)
!366 = distinct !DILexicalBlock(scope: !360, file: !30, line: 84, column: 23)
!367 = !DILocation(line: 85, column: 29, scope: !368, inlinedAt: !362)
!368 = distinct !DILexicalBlock(scope: !360, file: !30, line: 85, column: 22)
!369 = !DILocation(line: 86, column: 30, scope: !370, inlinedAt: !362)
!370 = distinct !DILexicalBlock(scope: !360, file: !30, line: 86, column: 23)
!371 = !DILocation(line: 87, column: 29, scope: !372, inlinedAt: !362)
!372 = distinct !DILexicalBlock(scope: !360, file: !30, line: 87, column: 22)
!373 = !DILocation(line: 88, column: 30, scope: !374, inlinedAt: !362)
!374 = distinct !DILexicalBlock(scope: !360, file: !30, line: 88, column: 23)
!375 = !DILocation(line: 89, column: 30, scope: !376, inlinedAt: !362)
!376 = distinct !DILexicalBlock(scope: !360, file: !30, line: 89, column: 23)
!377 = !DILocation(line: 90, column: 29, scope: !378, inlinedAt: !362)
!378 = distinct !DILexicalBlock(scope: !360, file: !30, line: 90, column: 22)
!379 = !DILocation(line: 91, column: 30, scope: !380, inlinedAt: !362)
!380 = distinct !DILexicalBlock(scope: !360, file: !30, line: 91, column: 23)
!381 = !DILocation(line: 92, column: 36, scope: !382, inlinedAt: !362)
!382 = distinct !DILexicalBlock(scope: !360, file: !30, line: 92, column: 29)
!383 = !DILocation(line: 93, column: 30, scope: !384, inlinedAt: !362)
!384 = distinct !DILexicalBlock(scope: !360, file: !30, line: 93, column: 23)
!385 = !DILocation(line: 94, column: 31, scope: !386, inlinedAt: !362)
!386 = distinct !DILexicalBlock(scope: !360, file: !30, line: 94, column: 24)
!387 = !DILocation(line: 95, column: 30, scope: !388, inlinedAt: !362)
!388 = distinct !DILexicalBlock(scope: !360, file: !30, line: 95, column: 23)
!389 = !DILocation(line: 96, column: 30, scope: !390, inlinedAt: !362)
!390 = distinct !DILexicalBlock(scope: !360, file: !30, line: 96, column: 23)
!391 = !DILocation(line: 97, column: 29, scope: !392, inlinedAt: !362)
!392 = distinct !DILexicalBlock(scope: !360, file: !30, line: 97, column: 22)
!393 = !DILocation(line: 98, column: 33, scope: !394, inlinedAt: !362)
!394 = distinct !DILexicalBlock(scope: !360, file: !30, line: 98, column: 26)
!395 = !DILocation(line: 99, column: 29, scope: !396, inlinedAt: !362)
!396 = distinct !DILexicalBlock(scope: !360, file: !30, line: 99, column: 22)
!397 = !DILocation(line: 100, column: 34, scope: !398, inlinedAt: !362)
!398 = distinct !DILexicalBlock(scope: !360, file: !30, line: 100, column: 27)
!399 = !DILocation(line: 101, column: 27, scope: !400, inlinedAt: !362)
!400 = distinct !DILexicalBlock(scope: !360, file: !30, line: 101, column: 20)
!401 = !DILocation(line: 102, column: 35, scope: !402, inlinedAt: !362)
!402 = distinct !DILexicalBlock(scope: !360, file: !30, line: 102, column: 28)
!403 = !DILocation(line: 103, column: 19, scope: !404, inlinedAt: !362)
!404 = distinct !DILexicalBlock(scope: !360, file: !30, line: 103, column: 12)
!405 = !DILocation(line: 600, column: 17, scope: !406, inlinedAt: !343)
!406 = distinct !DILexicalBlock(scope: !341, file: !88, line: 599, column: 2)
!407 = !DILocation(line: 600, column: 3, scope: !406, inlinedAt: !343)
!408 = !DILocation(line: 603, column: 9, scope: !406, inlinedAt: !343)
!409 = !DILocation(line: 600, column: 17, scope: !410, inlinedAt: !343)
!410 = distinct !DILexicalBlock(scope: !341, file: !88, line: 599, column: 2)
!411 = !DILocation(line: 600, column: 3, scope: !410, inlinedAt: !343)
!412 = !DILocation(line: 603, column: 9, scope: !410, inlinedAt: !343)
!413 = distinct !DISubprogram(name: "native_fseek", linkageName: "std.io.os.native_fseek", scope: !30, file: !30, line: 52, type: !414, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!414 = !DISubroutineType(types: !415)
!415 = !{!38, !40, !40, !39, !29}
!416 = !DILocalVariable(name: "file", arg: 1, scope: !413, file: !30, line: 52, type: !40)
!417 = !DILocation(line: 52, column: 29, scope: !413)
!418 = !DILocalVariable(name: "offset", arg: 2, scope: !413, file: !30, line: 52, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !39)
!420 = !DILocation(line: 52, column: 39, scope: !413)
!421 = !DILocalVariable(name: "seek_mode", arg: 3, scope: !413, file: !30, line: 52, type: !29)
!422 = !DILocation(line: 52, column: 52, scope: !413)
!423 = !DILocation(line: 54, column: 43, scope: !413)
!424 = !DILocation(line: 54, column: 6, scope: !413)
!425 = !DILocation(line: 109, column: 10, scope: !426, inlinedAt: !428)
!426 = distinct !DILexicalBlock(scope: !427, file: !30, line: 109, column: 2)
!427 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !30, file: !30, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!428 = !DILocation(line: 54, column: 70, scope: !413)
!429 = !DILocation(line: 111, column: 30, scope: !430, inlinedAt: !428)
!430 = distinct !DILexicalBlock(scope: !426, file: !30, line: 111, column: 23)
!431 = !DILocation(line: 112, column: 29, scope: !432, inlinedAt: !428)
!432 = distinct !DILexicalBlock(scope: !426, file: !30, line: 112, column: 22)
!433 = !DILocation(line: 113, column: 33, scope: !434, inlinedAt: !428)
!434 = distinct !DILexicalBlock(scope: !426, file: !30, line: 113, column: 26)
!435 = !DILocation(line: 114, column: 29, scope: !436, inlinedAt: !428)
!436 = distinct !DILexicalBlock(scope: !426, file: !30, line: 114, column: 22)
!437 = !DILocation(line: 115, column: 30, scope: !438, inlinedAt: !428)
!438 = distinct !DILexicalBlock(scope: !426, file: !30, line: 115, column: 23)
!439 = !DILocation(line: 116, column: 27, scope: !440, inlinedAt: !428)
!440 = distinct !DILexicalBlock(scope: !426, file: !30, line: 116, column: 20)
!441 = !DILocation(line: 117, column: 30, scope: !442, inlinedAt: !428)
!442 = distinct !DILexicalBlock(scope: !426, file: !30, line: 117, column: 23)
!443 = !DILocation(line: 118, column: 29, scope: !444, inlinedAt: !428)
!444 = distinct !DILexicalBlock(scope: !426, file: !30, line: 118, column: 22)
!445 = !DILocation(line: 119, column: 29, scope: !446, inlinedAt: !428)
!446 = distinct !DILexicalBlock(scope: !426, file: !30, line: 119, column: 22)
!447 = !DILocation(line: 120, column: 29, scope: !448, inlinedAt: !428)
!448 = distinct !DILexicalBlock(scope: !426, file: !30, line: 120, column: 22)
!449 = !DILocation(line: 121, column: 30, scope: !450, inlinedAt: !428)
!450 = distinct !DILexicalBlock(scope: !426, file: !30, line: 121, column: 23)
!451 = !DILocation(line: 122, column: 19, scope: !452, inlinedAt: !428)
!452 = distinct !DILexicalBlock(scope: !426, file: !30, line: 122, column: 12)
!453 = distinct !DISubprogram(name: "native_ftell", linkageName: "std.io.os.native_ftell", scope: !30, file: !30, line: 58, type: !454, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!454 = !DISubroutineType(types: !455)
!455 = !{!38, !456, !40}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!457 = !DILocalVariable(name: "file", arg: 1, scope: !453, file: !30, line: 58, type: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !30, file: !30, line: 357, baseType: !40, align: 8)
!459 = !DILocation(line: 58, column: 28, scope: !453)
!460 = !DILocalVariable(name: "index", scope: !453, file: !30, line: 60, type: !39, align: 8)
!461 = !DILocation(line: 60, column: 7, scope: !453)
!462 = !DILocation(line: 60, column: 27, scope: !453)
!463 = !DILocation(line: 60, column: 15, scope: !453)
!464 = !DILocation(line: 61, column: 9, scope: !453)
!465 = !DILocation(line: 61, column: 23, scope: !453)
!466 = !DILocation(line: 109, column: 10, scope: !467, inlinedAt: !469)
!467 = distinct !DILexicalBlock(scope: !468, file: !30, line: 109, column: 2)
!468 = distinct !DISubprogram(name: "file_seek_errno", linkageName: "file_seek_errno", scope: !30, file: !30, line: 107, scopeLine: 107, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!469 = !DILocation(line: 61, column: 35, scope: !453)
!470 = !DILocation(line: 111, column: 30, scope: !471, inlinedAt: !469)
!471 = distinct !DILexicalBlock(scope: !467, file: !30, line: 111, column: 23)
!472 = !DILocation(line: 112, column: 29, scope: !473, inlinedAt: !469)
!473 = distinct !DILexicalBlock(scope: !467, file: !30, line: 112, column: 22)
!474 = !DILocation(line: 113, column: 33, scope: !475, inlinedAt: !469)
!475 = distinct !DILexicalBlock(scope: !467, file: !30, line: 113, column: 26)
!476 = !DILocation(line: 114, column: 29, scope: !477, inlinedAt: !469)
!477 = distinct !DILexicalBlock(scope: !467, file: !30, line: 114, column: 22)
!478 = !DILocation(line: 115, column: 30, scope: !479, inlinedAt: !469)
!479 = distinct !DILexicalBlock(scope: !467, file: !30, line: 115, column: 23)
!480 = !DILocation(line: 116, column: 27, scope: !481, inlinedAt: !469)
!481 = distinct !DILexicalBlock(scope: !467, file: !30, line: 116, column: 20)
!482 = !DILocation(line: 117, column: 30, scope: !483, inlinedAt: !469)
!483 = distinct !DILexicalBlock(scope: !467, file: !30, line: 117, column: 23)
!484 = !DILocation(line: 118, column: 29, scope: !485, inlinedAt: !469)
!485 = distinct !DILexicalBlock(scope: !467, file: !30, line: 118, column: 22)
!486 = !DILocation(line: 119, column: 29, scope: !487, inlinedAt: !469)
!487 = distinct !DILexicalBlock(scope: !467, file: !30, line: 119, column: 22)
!488 = !DILocation(line: 120, column: 29, scope: !489, inlinedAt: !469)
!489 = distinct !DILexicalBlock(scope: !467, file: !30, line: 120, column: 22)
!490 = !DILocation(line: 121, column: 30, scope: !491, inlinedAt: !469)
!491 = distinct !DILexicalBlock(scope: !467, file: !30, line: 121, column: 23)
!492 = !DILocation(line: 122, column: 19, scope: !493, inlinedAt: !469)
!493 = distinct !DILexicalBlock(scope: !467, file: !30, line: 122, column: 12)
!494 = distinct !DISubprogram(name: "native_fwrite", linkageName: "std.io.os.native_fwrite", scope: !30, file: !30, line: 64, type: !495, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!495 = !DISubroutineType(types: !496)
!496 = !{!38, !456, !40, !16}
!497 = !DILocalVariable(name: "file", arg: 1, scope: !494, file: !30, line: 64, type: !458)
!498 = !DILocation(line: 64, column: 29, scope: !494)
!499 = !DILocalVariable(name: "buffer", arg: 2, scope: !494, file: !30, line: 64, type: !16)
!500 = !DILocation(line: 64, column: 42, scope: !494)
!501 = !DILocation(line: 66, column: 22, scope: !494)
!502 = !DILocation(line: 66, column: 37, scope: !494)
!503 = !DILocation(line: 66, column: 49, scope: !494)
!504 = !DILocation(line: 66, column: 9, scope: !494)
!505 = distinct !DISubprogram(name: "native_fputc", linkageName: "std.io.os.native_fputc", scope: !30, file: !30, line: 69, type: !506, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!506 = !DISubroutineType(types: !507)
!507 = !{!38, !40, !25, !40}
!508 = !DILocalVariable(name: "c", arg: 1, scope: !505, file: !30, line: 69, type: !308)
!509 = !DILocation(line: 69, column: 28, scope: !505)
!510 = !DILocalVariable(name: "stream", arg: 2, scope: !505, file: !30, line: 69, type: !458)
!511 = !DILocation(line: 69, column: 37, scope: !505)
!512 = !DILocation(line: 71, column: 21, scope: !505)
!513 = !DILocation(line: 71, column: 6, scope: !505)
!514 = !DILocation(line: 71, column: 50, scope: !505)
!515 = distinct !DISubprogram(name: "native_fread", linkageName: "std.io.os.native_fread", scope: !30, file: !30, line: 74, type: !495, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!516 = !DILocalVariable(name: "file", arg: 1, scope: !515, file: !30, line: 74, type: !458)
!517 = !DILocation(line: 74, column: 28, scope: !515)
!518 = !DILocalVariable(name: "buffer", arg: 2, scope: !515, file: !30, line: 74, type: !16)
!519 = !DILocation(line: 74, column: 41, scope: !515)
!520 = !DILocation(line: 76, column: 21, scope: !515)
!521 = !DILocation(line: 76, column: 36, scope: !515)
!522 = !DILocation(line: 76, column: 48, scope: !515)
!523 = !DILocation(line: 76, column: 9, scope: !515)
!524 = distinct !DISubprogram(name: "native_ls", linkageName: "std.io.os.native_ls", scope: !525, file: !525, line: 4, type: !526, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!525 = !DIFile(filename: "ls.c3", directory: "/usr/local/lib/c3/std/io/os")
!526 = !DISubroutineType(types: !527)
!527 = !{!38, !528, !12, !538, !538, !15, !93}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "PathList*", baseType: !529, size: 64, align: 64, dwarfAddressSpace: 0)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "PathList", scope: !525, file: !525, line: 10, baseType: !530, align: 8)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !525, file: !525, line: 14, size: 320, align: 64, elements: !531, identifier: "std_collections_list$std.io.path.PathImp$.List")
!531 = !{!532, !533, !534, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !530, file: !525, line: 16, baseType: !22, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !530, file: !525, line: 17, baseType: !22, size: 64, align: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !530, file: !525, line: 18, baseType: !93, size: 128, align: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !530, file: !525, line: 19, baseType: !536, size: 64, align: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !537, size: 64, align: 64, dwarfAddressSpace: 0)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !525, file: !525, line: 10, baseType: !12, align: 8)
!538 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!539 = !DILocalVariable(name: "dir", arg: 1, scope: !524, file: !525, line: 4, type: !43)
!540 = !DILocation(line: 4, column: 29, scope: !524)
!541 = !DILocalVariable(name: "no_dirs", arg: 2, scope: !524, file: !525, line: 4, type: !538)
!542 = !DILocation(line: 4, column: 39, scope: !524)
!543 = !DILocalVariable(name: "no_symlinks", arg: 3, scope: !524, file: !525, line: 4, type: !538)
!544 = !DILocation(line: 4, column: 53, scope: !524)
!545 = !DILocalVariable(name: "mask", arg: 4, scope: !524, file: !525, line: 4, type: !15)
!546 = !DILocation(line: 4, column: 73, scope: !524)
!547 = !DILocalVariable(name: "allocator", arg: 5, scope: !524, file: !525, line: 4, type: !93)
!548 = !DILocation(line: 4, column: 89, scope: !524)
!549 = !DILocalVariable(name: "list", scope: !524, file: !525, line: 6, type: !529, align: 8)
!550 = !DILocation(line: 6, column: 11, scope: !524)
!551 = !DILocation(line: 7, column: 27, scope: !524)
!552 = !DILocation(line: 7, column: 2, scope: !524)
!553 = !DILocalVariable(name: "directory", scope: !524, file: !525, line: 8, type: !49, align: 8)
!554 = !DILocation(line: 8, column: 9, scope: !524)
!555 = !DILocation(line: 8, column: 36, scope: !524)
!556 = !DILocation(line: 8, column: 53, scope: !524)
!557 = !DILocation(line: 8, column: 70, scope: !524)
!558 = !DILocation(line: 8, column: 21, scope: !524)
!559 = !DILocation(line: 10, column: 6, scope: !524)
!560 = !DILocation(line: 10, column: 26, scope: !524)
!561 = !DILocation(line: 10, column: 72, scope: !524)
!562 = !DILocation(line: 9, column: 12, scope: !563)
!563 = distinct !DILexicalBlock(scope: !524, file: !525, line: 9, column: 8)
!564 = !DILocation(line: 9, column: 39, scope: !563)
!565 = !DILocation(line: 9, column: 23, scope: !563)
!566 = !DILocalVariable(name: "entry", scope: !524, file: !525, line: 11, type: !66, align: 8)
!567 = !DILocation(line: 11, column: 16, scope: !524)
!568 = !DILocation(line: 12, column: 2, scope: !524)
!569 = !DILocation(line: 12, column: 33, scope: !570)
!570 = distinct !DILexicalBlock(scope: !524, file: !525, line: 12, column: 2)
!571 = !DILocation(line: 12, column: 18, scope: !570)
!572 = !DILocalVariable(name: "name", scope: !573, file: !525, line: 14, type: !15, align: 8)
!573 = distinct !DILexicalBlock(scope: !570, file: !525, line: 13, column: 2)
!574 = !DILocation(line: 14, column: 10, scope: !573)
!575 = !DILocation(line: 14, column: 28, scope: !573)
!576 = !DILocation(line: 14, column: 19, scope: !573)
!577 = !DILocation(line: 15, column: 8, scope: !573)
!578 = !DILocation(line: 15, column: 16, scope: !573)
!579 = !DILocation(line: 15, column: 31, scope: !573)
!580 = !DILocation(line: 15, column: 45, scope: !573)
!581 = !DILocation(line: 16, column: 7, scope: !573)
!582 = !DILocation(line: 16, column: 40, scope: !573)
!583 = !DILocation(line: 16, column: 53, scope: !573)
!584 = !DILocation(line: 17, column: 7, scope: !573)
!585 = !DILocation(line: 17, column: 40, scope: !573)
!586 = !DILocation(line: 17, column: 49, scope: !573)
!587 = !DILocalVariable(name: "path", scope: !573, file: !525, line: 18, type: !43, align: 8)
!588 = !DILocation(line: 18, column: 8, scope: !573)
!589 = !DILocation(line: 18, column: 15, scope: !573)
!590 = !DILocation(line: 19, column: 3, scope: !573)
!591 = !DILocation(line: 9, column: 12, scope: !592)
!592 = distinct !DILexicalBlock(scope: !524, file: !525, line: 9, column: 8)
!593 = !DILocation(line: 9, column: 39, scope: !592)
!594 = !DILocation(line: 9, column: 23, scope: !592)
!595 = distinct !DISubprogram(name: "native_temp_directory", linkageName: "std.io.os.native_temp_directory", scope: !44, file: !44, line: 4, type: !596, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!596 = !DISubroutineType(types: !597)
!597 = !{!38, !598, !93}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Path*", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!599 = !DILocalVariable(name: "allocator", arg: 1, scope: !595, file: !44, line: 4, type: !93)
!600 = !DILocation(line: 4, column: 42, scope: !595)
!601 = !DILocalVariable(name: ".temp", scope: !602, file: !44, line: 6, type: !603, align: 16)
!602 = distinct !DILexicalBlock(scope: !595, file: !44, line: 6, column: 2)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, align: 64, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 4, lowerBound: 0)
!606 = !DILocation(line: 6, column: 24, scope: !602)
!607 = !DILocalVariable(name: ".temp", scope: !602, file: !44, line: 6, type: !22, align: 8)
!608 = !DILocalVariable(name: "env", scope: !609, file: !44, line: 6, type: !15, align: 8)
!609 = distinct !DILexicalBlock(scope: !602, file: !44, line: 7, column: 2)
!610 = !DILocation(line: 6, column: 18, scope: !609)
!611 = !DILocation(line: 6, column: 24, scope: !609)
!612 = !DILocalVariable(name: "tmpdir", scope: !613, file: !44, line: 8, type: !15, align: 8)
!613 = distinct !DILexicalBlock(scope: !609, file: !44, line: 7, column: 2)
!614 = !DILocation(line: 8, column: 10, scope: !613)
!615 = !DILocation(line: 8, column: 19, scope: !613)
!616 = !DILocation(line: 8, column: 40, scope: !613)
!617 = !DILocation(line: 9, column: 7, scope: !613)
!618 = !DILocation(line: 9, column: 22, scope: !613)
!619 = !DILocation(line: 11, column: 9, scope: !595)
!620 = distinct !DISubprogram(name: "native_file_or_dir_exists", linkageName: "std.io.os.native_file_or_dir_exists", scope: !71, file: !71, line: 64, type: !621, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!621 = !DISubroutineType(types: !622)
!622 = !{!538, !15}
!623 = !DILocalVariable(name: "path", arg: 1, scope: !620, file: !71, line: 64, type: !15)
!624 = !DILocation(line: 64, column: 42, scope: !620)
!625 = !DILocalVariable(name: "stat", scope: !620, file: !71, line: 72, type: !626, align: 8)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Stat", scope: !71, file: !71, line: 14, size: 1152, align: 64, elements: !627, identifier: "libc.Stat")
!627 = !{!628, !630, !631, !633, !636, !638, !640, !641, !642, !643, !645, !647, !649, !650, !651, !652, !653, !654}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !626, file: !71, line: 16, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dev_t", scope: !71, file: !71, line: 9, baseType: !23, align: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !626, file: !71, line: 17, baseType: !70, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !626, file: !71, line: 18, baseType: !632, size: 64, align: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nlink_t", scope: !71, file: !71, line: 6, baseType: !23, align: 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !626, file: !71, line: 19, baseType: !634, size: 32, align: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mode_t", scope: !71, file: !71, line: 10, baseType: !635, align: 4)
!635 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !626, file: !71, line: 20, baseType: !637, size: 32, align: 32, offset: 224)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uid_t", scope: !71, file: !71, line: 22, baseType: !635, align: 4)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !626, file: !71, line: 21, baseType: !639, size: 32, align: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gid_t", scope: !71, file: !71, line: 23, baseType: !635, align: 4)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !626, file: !71, line: 22, baseType: !308, size: 32, align: 32, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !626, file: !71, line: 23, baseType: !629, size: 64, align: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !626, file: !71, line: 24, baseType: !73, size: 64, align: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !626, file: !71, line: 25, baseType: !644, size: 64, align: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blksize_t", scope: !71, file: !71, line: 5, baseType: !39, align: 8)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !626, file: !71, line: 26, baseType: !646, size: 64, align: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "Blkcnt_t", scope: !71, file: !71, line: 7, baseType: !39, align: 8)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime", scope: !626, file: !71, line: 27, baseType: !648, size: 64, align: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time_t", scope: !71, file: !71, line: 64, baseType: !39, align: 8)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_atime_nsec", scope: !626, file: !71, line: 28, baseType: !39, size: 64, align: 64, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime", scope: !626, file: !71, line: 29, baseType: !648, size: 64, align: 64, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtime_nsec", scope: !626, file: !71, line: 30, baseType: !39, size: 64, align: 64, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime", scope: !626, file: !71, line: 31, baseType: !648, size: 64, align: 64, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctime_nsec", scope: !626, file: !71, line: 32, baseType: !39, size: 64, align: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !626, file: !71, line: 33, baseType: !655, size: 192, align: 64, offset: 960)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, align: 64, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 3, lowerBound: 0)
!658 = !DILocation(line: 72, column: 9, scope: !620)
!659 = !DILocation(line: 73, column: 34, scope: !660, inlinedAt: !662)
!660 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !661, file: !661, line: 363, scopeLine: 363, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!661 = !DIFile(filename: "builtin.c3", directory: "/usr/local/lib/c3/std/core")
!662 = !DILocation(line: 73, column: 11, scope: !620)
!663 = !DILocation(line: 365, column: 12, scope: !660, inlinedAt: !662)
!664 = !DILocation(line: 365, column: 26, scope: !660, inlinedAt: !662)
!665 = !DILocation(line: 366, column: 9, scope: !660, inlinedAt: !662)
!666 = distinct !DISubprogram(name: "native_is_file", linkageName: "std.io.os.native_is_file", scope: !71, file: !71, line: 89, type: !621, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!667 = !DILocalVariable(name: "path", arg: 1, scope: !666, file: !71, line: 89, type: !15)
!668 = !DILocation(line: 89, column: 31, scope: !666)
!669 = !DILocalVariable(name: "stat", scope: !666, file: !71, line: 97, type: !626, align: 8)
!670 = !DILocation(line: 97, column: 9, scope: !666)
!671 = !DILocation(line: 98, column: 34, scope: !672, inlinedAt: !673)
!672 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !661, file: !661, line: 363, scopeLine: 363, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!673 = !DILocation(line: 98, column: 11, scope: !666)
!674 = !DILocation(line: 365, column: 12, scope: !672, inlinedAt: !673)
!675 = !DILocation(line: 365, column: 26, scope: !672, inlinedAt: !673)
!676 = !DILocation(line: 366, column: 9, scope: !672, inlinedAt: !673)
!677 = !DILocation(line: 98, column: 58, scope: !666)
!678 = !DILocation(line: 375, column: 52, scope: !679, inlinedAt: !681)
!679 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !680, file: !680, line: 375, scopeLine: 375, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!680 = !DIFile(filename: "libc.c3", directory: "/usr/local/lib/c3/std/libc")
!681 = !DILocation(line: 98, column: 44, scope: !666)
!682 = !DILocation(line: 375, column: 71, scope: !679, inlinedAt: !681)
!683 = distinct !DISubprogram(name: "native_is_dir", linkageName: "std.io.os.native_is_dir", scope: !71, file: !71, line: 106, type: !621, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !41)
!684 = !DILocalVariable(name: "path", arg: 1, scope: !683, file: !71, line: 106, type: !15)
!685 = !DILocation(line: 106, column: 30, scope: !683)
!686 = !DILocalVariable(name: "stat", scope: !683, file: !71, line: 109, type: !626, align: 8)
!687 = !DILocation(line: 109, column: 8, scope: !683)
!688 = !DILocation(line: 110, column: 33, scope: !689, inlinedAt: !690)
!689 = distinct !DISubprogram(name: "@ok", linkageName: "@ok", scope: !661, file: !661, line: 363, scopeLine: 363, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!690 = !DILocation(line: 110, column: 10, scope: !683)
!691 = !DILocation(line: 365, column: 12, scope: !689, inlinedAt: !690)
!692 = !DILocation(line: 365, column: 26, scope: !689, inlinedAt: !690)
!693 = !DILocation(line: 366, column: 9, scope: !689, inlinedAt: !690)
!694 = !DILocation(line: 110, column: 57, scope: !683)
!695 = !DILocation(line: 375, column: 52, scope: !696, inlinedAt: !697)
!696 = distinct !DISubprogram(name: "libc_S_ISTYPE", linkageName: "libc_S_ISTYPE", scope: !680, file: !680, line: 375, scopeLine: 375, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!697 = !DILocation(line: 110, column: 43, scope: !683)
