; ModuleID = 'std::thread::threadpool'
source_filename = "std::thread::threadpool"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%FixedThreadPool = type { %NativeMutex, %"QueueItem[]", i64, i64, i8, %"void*[]", [6 x i64] }
%NativeMutex = type { [5 x i64], i8 }
%"QueueItem[]" = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%QueueItem = type { ptr, %"any[]" }

$std.thread.threadpool.FixedThreadPool.init = comdat any

$std.thread.threadpool.FixedThreadPool.destroy = comdat any

$std.thread.threadpool.FixedThreadPool.stop_and_destroy = comdat any

$std.thread.threadpool.FixedThreadPool.push = comdat any

$.dyn_search = comdat any

$"std.thread.threadpool.ThreadPoolResult$QUEUE_FULL" = comdat any

$"$ct.std.thread.threadpool.ThreadPoolResult" = comdat any

$"$ct.std.thread.threadpool.FixedThreadPool" = comdat any

$"$ct.std.thread.threadpool.QueueItem" = comdat any

$"$ct.anyfault" = comdat any

$"$ct.ulong" = comdat any

$"$sel.acquire" = comdat any

@"std.thread.threadpool.ThreadPoolResult$QUEUE_FULL" = linkonce constant %.fault { i64 ptrtoint (ptr @"$ct.std.thread.threadpool.ThreadPoolResult" to i64), %"char[]" { ptr @.fault, i64 10 }, i64 1 }, comdat, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!8 = !DIFile(filename: "fixed_pool.c3", directory: "/usr/local/lib/c3/std/threads")
!9 = distinct !DISubprogram(name: "init", linkageName: "std.thread.threadpool.FixedThreadPool.init", scope: !8, file: !8, line: 39, type: !10, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !73)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !15, !25, !25}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !13)
!13 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "FixedThreadPool*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "FixedThreadPool", scope: !8, file: !8, line: 13, size: 1216, align: 64, elements: !17, identifier: "std.thread.threadpool.FixedThreadPool")
!17 = !{!18, !30, !55, !56, !57, !59, !67}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "mu", scope: !16, file: !8, line: 15, baseType: !19, size: 384, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mutex", scope: !8, file: !8, line: 11, baseType: !20, align: 8)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "NativeMutex", scope: !8, file: !8, line: 4, size: 384, align: 64, elements: !21, identifier: "std.thread.os.NativeMutex")
!21 = !{!22, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !20, file: !8, line: 6, baseType: !23, size: 320, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_mutex_t", scope: !8, file: !8, line: 108, baseType: !24, align: 8)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 320, align: 64, elements: !26)
!25 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 5, lowerBound: 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !20, file: !8, line: 7, baseType: !29, size: 8, align: 8, offset: 320)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !16, file: !8, line: 16, baseType: !31, size: 128, align: 64, offset: 384)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem[]", size: 128, align: 64, elements: !32, identifier: "QueueItem[]")
!32 = !{!33, !54}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !31, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "QueueItem*", baseType: !35, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "QueueItem", scope: !8, file: !8, line: 28, size: 192, align: 64, elements: !36, identifier: "std.thread.threadpool.QueueItem")
!36 = !{!37, !53}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !35, file: !8, line: 30, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolFn", scope: !8, file: !8, line: 11, baseType: !39, align: 8)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ThreadPoolFn", baseType: !40, size: 64, align: 64, dwarfAddressSpace: 0)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "any[]", size: 128, align: 64, elements: !43, identifier: "any[]")
!43 = !{!44, !51}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !42, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "any*", baseType: !46, size: 64, align: 64, dwarfAddressSpace: 0)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", size: 128, align: 64, elements: !47, identifier: "any")
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !14, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !42, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !25)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !35, file: !8, line: 31, baseType: !42, size: 128, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, baseType: !52, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "qindex", scope: !16, file: !8, line: 17, baseType: !52, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "num_threads", scope: !16, file: !8, line: 18, baseType: !52, size: 64, align: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !8, line: 19, baseType: !58, size: 8, align: 8, offset: 640)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !16, file: !8, line: 24, baseType: !60, size: 128, align: 64, offset: 704)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread[]", size: 128, align: 64, elements: !61, identifier: "Thread[]")
!61 = !{!62, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !60, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Thread*", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "Thread", scope: !8, file: !8, line: 16, baseType: !65, align: 8)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_t", scope: !8, file: !8, line: 10, baseType: !14, align: 8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !60, baseType: !52, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !16, file: !8, line: 25, baseType: !68, size: 384, align: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConditionVariable", scope: !8, file: !8, line: 15, baseType: !69, align: 8)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pthread_cond_t", scope: !8, file: !8, line: 105, baseType: !70, align: 8)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 384, align: 64, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 6, lowerBound: 0)
!73 = !{}
!74 = !DILocation(line: 40, column: 1, scope: !9)
!75 = !DILocalVariable(name: "self", arg: 1, scope: !9, file: !8, line: 39, type: !15)
!76 = !DILocation(line: 39, column: 31, scope: !9)
!77 = !DILocalVariable(name: "threads", arg: 2, scope: !9, file: !8, line: 39, type: !52)
!78 = !DILocation(line: 39, column: 42, scope: !9)
!79 = !DILocalVariable(name: "queue_size", arg: 3, scope: !9, file: !8, line: 39, type: !52)
!80 = !DILocation(line: 39, column: 55, scope: !9)
!81 = !DILocation(line: 35, column: 12, scope: !82)
!82 = distinct !DILexicalBlock(scope: !9, file: !8, line: 40, column: 1)
!83 = !DILocation(line: 35, column: 11, scope: !82)
!84 = !DILocation(line: 36, column: 11, scope: !82)
!85 = !DILocation(line: 36, column: 26, scope: !82)
!86 = !DILocation(line: 37, column: 11, scope: !82)
!87 = !DILocation(line: 41, column: 6, scope: !9)
!88 = !DILocation(line: 41, column: 36, scope: !9)
!89 = !DILocation(line: 43, column: 9, scope: !9)
!90 = !DILocation(line: 44, column: 3, scope: !9)
!91 = !DILocation(line: 45, column: 18, scope: !9)
!92 = !DILocation(line: 46, column: 18, scope: !9)
!93 = !DILocation(line: 286, column: 55, scope: !94, inlinedAt: !96)
!94 = distinct !DISubprogram(name: "alloc_array_try", linkageName: "alloc_array_try", scope: !95, file: !95, line: 284, scopeLine: 284, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!95 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!96 = !DILocation(line: 269, column: 9, scope: !97, inlinedAt: !98)
!97 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !95, file: !95, line: 267, scopeLine: 267, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!98 = !DILocation(line: 806, column: 9, scope: !99, inlinedAt: !101)
!99 = distinct !DISubprogram(name: "alloc_array", linkageName: "alloc_array", scope: !100, file: !100, line: 804, scopeLine: 804, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!100 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!101 = !DILocation(line: 47, column: 12, scope: !9)
!102 = !DILocation(line: 286, column: 40, scope: !94, inlinedAt: !96)
!103 = !DILocation(line: 62, column: 6, scope: !104, inlinedAt: !105)
!104 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !95, file: !95, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!105 = !DILocation(line: 286, column: 18, scope: !94, inlinedAt: !96)
!106 = !DILocation(line: 62, column: 20, scope: !104, inlinedAt: !105)
!107 = !DILocation(line: 28, column: 71, scope: !108, inlinedAt: !109)
!108 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !95, file: !95, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!109 = !DILocation(line: 68, column: 10, scope: !104, inlinedAt: !105)
!110 = !DILocation(line: 286, column: 67, scope: !94, inlinedAt: !96)
!111 = !DILocation(line: 252, column: 55, scope: !112, inlinedAt: !113)
!112 = distinct !DISubprogram(name: "new_array_try", linkageName: "new_array_try", scope: !95, file: !95, line: 250, scopeLine: 250, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!113 = !DILocation(line: 244, column: 9, scope: !114, inlinedAt: !115)
