; ModuleID = 'std::math::uuid'
source_filename = "std::math::uuid"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%"char[]" = type { ptr, i64 }

$std.math.uuid.Uuid.to_format = comdat any

$std.math.uuid.Uuid.to_string = comdat any

$std.math.uuid.generate = comdat any

$std.math.uuid.generate_from_random = comdat any

$.dyn_search = comdat any

$"$ct.std.math.uuid.Uuid" = comdat any

$"$ct.a16$char" = comdat any

$"$ct.char" = comdat any

$"$ct.std.math.random.Sfc64Random" = comdat any

$"$ct.a4$ulong" = comdat any

$"$ct.ulong" = comdat any

$"$sel.next_bytes" = comdat any

$"$ct.dyn.std.math.uuid.Uuid.to_format" = comdat any

$"$sel.to_format" = comdat any

$"$ct.dyn.std.math.uuid.Uuid.to_string" = comdat any

$"$sel.to_string" = comdat any

@"$ct.std.math.uuid.Uuid" = linkonce global %.introspect { i8 18, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.a16$char" to i64), i64 0, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.a16$char" = linkonce global %.introspect { i8 15, i64 0, ptr null, i64 16, i64 ptrtoint (ptr @"$ct.char" to i64), i64 16, [0 x i64] zeroinitializer }, comdat, align 8
@"$ct.char" = linkonce global %.introspect { i8 3, i64 0, ptr null, i64 1, i64 0, i64 0, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!8 = !DIFile(filename: "uuid.c3", directory: "/usr/local/lib/c3/std/math")
!9 = distinct !DISubprogram(name: "to_format", linkageName: "std.math.uuid.Uuid.to_format", scope: !8, file: !8, line: 28, type: !10, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !42)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !17, !23}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !13)
!13 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !16)
!16 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Uuid*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uuid", scope: !8, file: !8, line: 5, baseType: !19, align: 1)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, align: 8, elements: !21)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !{!22}
!22 = !DISubrange(count: 16, lowerBound: 0)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !8, file: !8, line: 71, size: 384, align: 64, elements: !25, identifier: "std.io.Formatter")
!25 = !{!26, !28, !33}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !24, file: !8, line: 73, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !24, file: !8, line: 74, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !8, file: !8, line: 23, baseType: !30, align: 8)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DISubroutineType(types: !32)
!32 = !{!12, !27, !27, !20}
!33 = !DIDerivedType(tag: DW_TAG_member, scope: !24, file: !8, line: 75, baseType: !34, size: 256, align: 64, offset: 128)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !24, file: !8, line: 75, size: 256, align: 64, elements: !35)
!35 = !{!36, !38, !39, !40, !41}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !8, line: 77, baseType: !37, size: 32, align: 32)
!37 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !34, file: !8, line: 78, baseType: !37, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !34, file: !8, line: 79, baseType: !37, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !34, file: !8, line: 80, baseType: !15, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !34, file: !8, line: 81, baseType: !12, size: 64, align: 64, offset: 192)
!42 = !{}
!43 = !DILocation(line: 29, column: 1, scope: !9)
!44 = !DILocalVariable(name: "self", arg: 1, scope: !9, file: !8, line: 28, type: !17)
!45 = !DILocation(line: 28, column: 24, scope: !9)
!46 = !DILocalVariable(name: "formatter", arg: 2, scope: !9, file: !8, line: 28, type: !23)
!47 = !DILocation(line: 28, column: 42, scope: !9)
!48 = !DILocation(line: 31, column: 5, scope: !9)
!49 = !DILocation(line: 31, column: 4, scope: !9)
!50 = !DILocation(line: 31, column: 17, scope: !9)
!51 = !DILocation(line: 31, column: 23, scope: !9)
!52 = !DILocation(line: 31, column: 16, scope: !9)
!53 = !DILocation(line: 31, column: 29, scope: !9)
!54 = !DILocation(line: 31, column: 35, scope: !9)
!55 = !DILocation(line: 31, column: 28, scope: !9)
!56 = !DILocation(line: 31, column: 41, scope: !9)
!57 = !DILocation(line: 31, column: 47, scope: !9)
!58 = !DILocation(line: 31, column: 40, scope: !9)
!59 = !DILocation(line: 32, column: 5, scope: !9)
!60 = !DILocation(line: 32, column: 11, scope: !9)
!61 = !DILocation(line: 32, column: 4, scope: !9)
!62 = !DILocation(line: 32, column: 17, scope: !9)
!63 = !DILocation(line: 32, column: 23, scope: !9)
!64 = !DILocation(line: 32, column: 16, scope: !9)
!65 = !DILocation(line: 33, column: 5, scope: !9)
!66 = !DILocation(line: 33, column: 11, scope: !9)
!67 = !DILocation(line: 33, column: 4, scope: !9)
!68 = !DILocation(line: 33, column: 17, scope: !9)
!69 = !DILocation(line: 33, column: 23, scope: !9)
!70 = !DILocation(line: 33, column: 16, scope: !9)
!71 = !DILocation(line: 34, column: 5, scope: !9)
!72 = !DILocation(line: 34, column: 11, scope: !9)
!73 = !DILocation(line: 34, column: 4, scope: !9)
!74 = !DILocation(line: 34, column: 17, scope: !9)
!75 = !DILocation(line: 34, column: 23, scope: !9)
!76 = !DILocation(line: 34, column: 16, scope: !9)
!77 = !DILocation(line: 35, column: 5, scope: !9)
!78 = !DILocation(line: 35, column: 11, scope: !9)
!79 = !DILocation(line: 35, column: 4, scope: !9)
!80 = !DILocation(line: 35, column: 18, scope: !9)
!81 = !DILocation(line: 35, column: 24, scope: !9)
!82 = !DILocation(line: 35, column: 17, scope: !9)
!83 = !DILocation(line: 35, column: 31, scope: !9)
!84 = !DILocation(line: 35, column: 37, scope: !9)
!85 = !DILocation(line: 35, column: 30, scope: !9)
!86 = !DILocation(line: 35, column: 44, scope: !9)
!87 = !DILocation(line: 35, column: 50, scope: !9)
!88 = !DILocation(line: 35, column: 43, scope: !9)
!89 = !DILocation(line: 35, column: 57, scope: !9)
!90 = !DILocation(line: 35, column: 63, scope: !9)
!91 = !DILocation(line: 35, column: 56, scope: !9)
!92 = !DILocation(line: 35, column: 70, scope: !9)
!93 = !DILocation(line: 35, column: 76, scope: !9)
!94 = !DILocation(line: 35, column: 69, scope: !9)
!95 = !DILocation(line: 30, column: 9, scope: !9)
!96 = distinct !DISubprogram(name: "to_string", linkageName: "std.math.uuid.Uuid.to_string", scope: !8, file: !8, line: 38, type: !97, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !42)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !17, !105}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !101, identifier: "char[]")
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !100, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !20, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, baseType: !15, size: 64, align: 64, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !106, identifier: "Allocator")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !105, baseType: !27, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!110 = !DILocation(line: 39, column: 1, scope: !96)
!111 = !DILocalVariable(name: "self", arg: 1, scope: !96, file: !8, line: 38, type: !17)
!112 = !DILocation(line: 38, column: 26, scope: !96)
!113 = !DILocalVariable(name: "allocator", arg: 2, scope: !96, file: !8, line: 38, type: !105)
!114 = !DILocation(line: 38, column: 43, scope: !96)
!115 = !DILocation(line: 40, column: 35, scope: !96)
!116 = !DILocation(line: 40, column: 52, scope: !96)
!117 = !DILocation(line: 40, column: 9, scope: !96)
!118 = distinct !DISubprogram(name: "generate", linkageName: "std.math.uuid.generate", scope: !8, file: !8, line: 10, type: !119, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7)
!119 = !DISubroutineType(types: !120)
!120 = !{!18}
!121 = !DILocation(line: 179, column: 7, scope: !122, inlinedAt: !124)
!122 = distinct !DISubprogram(name: "init_default_random", linkageName: "init_default_random", scope: !123, file: !123, line: 177, scopeLine: 177, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!123 = !DIFile(filename: "math_random.c3", directory: "/usr/local/lib/c3/std/math")
!124 = !DILocation(line: 12, column: 2, scope: !118)
!125 = !DILocation(line: 136, column: 33, scope: !126, inlinedAt: !127)
!126 = distinct !DISubprogram(name: "is_random", linkageName: "is_random", scope: !123, file: !123, line: 136, scopeLine: 136, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!127 = !DILocation(line: 24, column: 11, scope: !128, inlinedAt: !130)
!128 = distinct !DILexicalBlock(scope: !129, file: !123, line: 27, column: 1)
!129 = distinct !DISubprogram(name: "seed_entropy", linkageName: "seed_entropy", scope: !123, file: !123, line: 26, scopeLine: 26, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!130 = !DILocation(line: 181, column: 3, scope: !131, inlinedAt: !124)
!131 = distinct !DILexicalBlock(scope: !122, file: !123, line: 180, column: 2)
!132 = !DILocation(line: 28, column: 20, scope: !129, inlinedAt: !130)
!133 = !DILocation(line: 28, column: 2, scope: !129, inlinedAt: !130)
!134 = !DILocation(line: 182, column: 32, scope: !131, inlinedAt: !124)
!135 = !DILocation(line: 13, column: 9, scope: !118)
!136 = distinct !DISubprogram(name: "generate_from_random", linkageName: "std.math.uuid.generate_from_random", scope: !8, file: !8, line: 19, type: !137, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !42)
!137 = !DISubroutineType(types: !138)
!138 = !{!18, !139}
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "Random", size: 128, align: 64, elements: !140, identifier: "Random")
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !139, baseType: !27, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, baseType: !109, size: 64, align: 64, offset: 64)
!143 = !DILocalVariable(name: "random", arg: 1, scope: !136, file: !8, line: 19, type: !139)
!144 = !DILocation(line: 19, column: 37, scope: !136)
!145 = !DILocalVariable(name: "uuid", scope: !136, file: !8, line: 21, type: !18, align: 16)
!146 = !DILocation(line: 21, column: 7, scope: !136)
!147 = !DILocation(line: 22, column: 22, scope: !136)
!148 = !DILocation(line: 22, column: 2, scope: !136)
!149 = !DILocation(line: 23, column: 7, scope: !136)
!150 = !DILocation(line: 23, column: 18, scope: !136)
!151 = !DILocation(line: 23, column: 13, scope: !136)
!152 = !DILocation(line: 24, column: 7, scope: !136)
!153 = !DILocation(line: 24, column: 18, scope: !136)
!154 = !DILocation(line: 24, column: 13, scope: !136)
!155 = !DILocation(line: 25, column: 9, scope: !136)
