; ModuleID = 'std::encoding::csv'
source_filename = "std::encoding::csv"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%any = type { ptr, i64 }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%CsvReader = type { %any, %"char[]" }
%CsvRow = type { %"char[][]", %"char[]", %any }
%"char[][]" = type { ptr, i64 }

$std.encoding.csv.CsvRow.to_format = comdat any

$std.encoding.csv.CsvRow.len = comdat any

$std.encoding.csv.CsvRow.get_col = comdat any

$std.encoding.csv.CsvReader.init = comdat any

$std.encoding.csv.CsvReader.read_new_row = comdat any

$std.encoding.csv.CsvReader.read_row = comdat any

$std.encoding.csv.CsvReader.read_temp_row = comdat any

$std.encoding.csv.CsvRow.free = comdat any

$std.encoding.csv.CsvReader.skip_row = comdat any

$.dyn_search = comdat any

$"$ct.std.encoding.csv.CsvReader" = comdat any

$"$ct.std.encoding.csv.CsvRow" = comdat any

$"$ct.sa$String" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.ulong" = comdat any

$"$sel.read_byte" = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any

$"std.io.IoError$BUSY" = comdat any

$"std.io.IoError$CANNOT_READ_DIR" = comdat any

$"std.io.IoError$DIR_NOT_EMPTY" = comdat any

$"std.io.IoError$EOF" = comdat any


!0 = !{i32 2, !"Dwarf Version", i32 4}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"wchar_size", i32 4}
!3 = !{i32 4, !"PIE Level", i32 2}
!4 = !{i32 4, !"PIC Level", i32 2}
!5 = !{i32 1, !"uwtable", i32 2}
!6 = !{i32 2, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false)
!8 = !DIFile(filename: "csv.c3", directory: "/usr/local/lib/c3/std/encoding")
!9 = distinct !DISubprogram(name: "to_format", linkageName: "std.encoding.csv.CsvRow.to_format", scope: !8, file: !8, line: 18, type: !10, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !17, !41}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !13)
!13 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !15, size: 64, align: 64, dwarfAddressSpace: 0)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !16)
!16 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvRow*", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvRow", scope: !8, file: !8, line: 11, size: 384, align: 64, elements: !19, identifier: "std.encoding.csv.CsvRow")
!19 = !{!20, !33, !34}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !18, file: !8, line: 13, baseType: !21, size: 128, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !22, identifier: "String[]")
!22 = !{!23, !32}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !27, identifier: "char[]")
!27 = !{!28, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !26, baseType: !15, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, baseType: !15, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !18, file: !8, line: 14, baseType: !25, size: 128, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !18, file: !8, line: 15, baseType: !35, size: 128, align: 64, offset: 256)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !36, identifier: "Allocator")
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !35, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !42, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !8, file: !8, line: 71, size: 384, align: 64, elements: !43, identifier: "std.io.Formatter")
!43 = !{!44, !45, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !42, file: !8, line: 73, baseType: !38, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !42, file: !8, line: 74, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !8, file: !8, line: 23, baseType: !47, align: 8)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !48, size: 64, align: 64, dwarfAddressSpace: 0)
!48 = !DISubroutineType(types: !49)
!49 = !{!12, !38, !38, !30}
!50 = !DIDerivedType(tag: DW_TAG_member, scope: !42, file: !8, line: 75, baseType: !51, size: 256, align: 64, offset: 128)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !42, file: !8, line: 75, size: 256, align: 64, elements: !52)
!52 = !{!53, !55, !56, !57, !58}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !8, line: 77, baseType: !54, size: 32, align: 32)
!54 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !51, file: !8, line: 78, baseType: !54, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !51, file: !8, line: 79, baseType: !54, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !51, file: !8, line: 80, baseType: !15, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !51, file: !8, line: 81, baseType: !12, size: 64, align: 64, offset: 192)
!59 = !{}
!60 = !DILocation(line: 19, column: 1, scope: !9)
!61 = !DILocalVariable(name: "self", arg: 1, scope: !9, file: !8, line: 18, type: !17)
!62 = !DILocation(line: 18, column: 26, scope: !9)
!63 = !DILocalVariable(name: "f", arg: 2, scope: !9, file: !8, line: 18, type: !41)
!64 = !DILocation(line: 18, column: 44, scope: !9)
!65 = !DILocation(line: 20, column: 24, scope: !9)
!66 = !DILocation(line: 20, column: 9, scope: !9)
!67 = distinct !DISubprogram(name: "len", linkageName: "std.encoding.csv.CsvRow.len", scope: !8, file: !8, line: 23, type: !68, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!68 = !DISubroutineType(types: !69)
!69 = !{!15, !17}
!70 = !DILocation(line: 24, column: 1, scope: !67)
!71 = !DILocalVariable(name: "self", arg: 1, scope: !67, file: !8, line: 23, type: !17)
!72 = !DILocation(line: 23, column: 19, scope: !67)
!73 = !DILocation(line: 25, column: 9, scope: !67)
!74 = distinct !DISubprogram(name: "get_col", linkageName: "std.encoding.csv.CsvRow.get_col", scope: !8, file: !8, line: 31, type: !75, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!75 = !DISubroutineType(types: !76)
!76 = !{!25, !17, !16}
!77 = !DILocation(line: 32, column: 1, scope: !74)
!78 = !DILocalVariable(name: "self", arg: 1, scope: !74, file: !8, line: 31, type: !17)
!79 = !DILocation(line: 31, column: 26, scope: !74)
!80 = !DILocalVariable(name: "col", arg: 2, scope: !74, file: !8, line: 31, type: !15)
!81 = !DILocation(line: 31, column: 37, scope: !74)
!82 = !DILocation(line: 29, column: 11, scope: !83)
!83 = distinct !DILexicalBlock(scope: !74, file: !8, line: 32, column: 1)
!84 = !DILocation(line: 29, column: 17, scope: !83)
!85 = !DILocation(line: 33, column: 9, scope: !74)
!86 = !DILocation(line: 33, column: 19, scope: !74)
!87 = distinct !DISubprogram(name: "init", linkageName: "std.encoding.csv.CsvReader.init", scope: !8, file: !8, line: 36, type: !88, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !90, !94, !25}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "CsvReader*", baseType: !91, size: 64, align: 64, dwarfAddressSpace: 0)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "CsvReader", scope: !8, file: !8, line: 5, size: 256, align: 64, elements: !92, identifier: "std.encoding.csv.CsvReader")
!92 = !{!93, !98}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !91, file: !8, line: 7, baseType: !94, size: 128, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "InStream", size: 128, align: 64, elements: !95, identifier: "InStream")
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !94, baseType: !38, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, baseType: !40, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "separator", scope: !91, file: !8, line: 8, baseType: !25, size: 128, align: 64, offset: 128)
!99 = !DILocation(line: 37, column: 1, scope: !87)
!100 = !DILocalVariable(name: "self", arg: 1, scope: !87, file: !8, line: 36, type: !90)
!101 = !DILocation(line: 36, column: 24, scope: !87)
!102 = !DILocalVariable(name: "stream", arg: 2, scope: !87, file: !8, line: 36, type: !94)
!103 = !DILocation(line: 36, column: 40, scope: !87)
!104 = !DILocalVariable(name: "separator", arg: 3, scope: !87, file: !8, line: 36, type: !25)
!105 = !DILocation(line: 36, column: 55, scope: !87)
!106 = !DILocation(line: 38, column: 2, scope: !87)
!107 = !DILocation(line: 38, column: 16, scope: !87)
!108 = !DILocation(line: 39, column: 2, scope: !87)
!109 = !DILocation(line: 39, column: 19, scope: !87)
!110 = distinct !DISubprogram(name: "read_new_row", linkageName: "std.encoding.csv.CsvReader.read_new_row", scope: !8, file: !8, line: 42, type: !111, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!111 = !DISubroutineType(types: !112)
!112 = !{!12, !17, !91}
!113 = !DILocalVariable(name: "self", arg: 1, scope: !110, file: !8, line: 42, type: !91)
!114 = !DILocation(line: 42, column: 35, scope: !110)
!115 = !DILocation(line: 44, column: 9, scope: !110)
!116 = distinct !DISubprogram(name: "read_row", linkageName: "std.encoding.csv.CsvReader.read_row", scope: !8, file: !8, line: 50, type: !117, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !59)
!117 = !DISubroutineType(types: !118)
!118 = !{!12, !17, !91, !35}
!119 = !DILocalVariable(name: "self", arg: 1, scope: !116, file: !8, line: 50, type: !91)
!120 = !DILocation(line: 50, column: 31, scope: !116)
!121 = !DILocalVariable(name: "allocator", arg: 2, scope: !116, file: !8, line: 50, type: !35)
!122 = !DILocation(line: 50, column: 47, scope: !116)
!123 = !DILocalVariable(name: "row", scope: !116, file: !8, line: 52, type: !25, align: 8)
!124 = !DILocation(line: 52, column: 9, scope: !116)
!125 = !DILocalVariable(name: "func", scope: !126, file: !8, line: 62, type: !128, align: 8)
!126 = distinct !DISubprogram(name: "readline", linkageName: "readline", scope: !127, file: !127, line: 58, scopeLine: 58, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !59)
!127 = !DIFile(filename: "io.c3", directory: "/usr/local/lib/c3/std/io")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "read_byte", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{!12, !29, !38}
!131 = !DILocation(line: 62, column: 30, scope: !126, inlinedAt: !132)
!132 = !DILocation(line: 52, column: 15, scope: !116)
!133 = !DILocation(line: 62, column: 38, scope: !126, inlinedAt: !132)
!134 = !DILocalVariable(name: "val", scope: !126, file: !8, line: 63, type: !30, align: 1)
!135 = !DILocation(line: 63, column: 8, scope: !126, inlinedAt: !132)
!136 = !DILocation(line: 63, column: 14, scope: !126, inlinedAt: !132)
!137 = !DILocation(line: 68, column: 6, scope: !126, inlinedAt: !132)
!138 = !DILocation(line: 68, column: 26, scope: !126, inlinedAt: !132)
!139 = !DILocalVariable(name: "current", scope: !140, file: !8, line: 592, type: !142, align: 8)
!140 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !141, file: !141, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !59)
!141 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !8, file: !8, line: 10, size: 320, align: 64, elements: !144, identifier: "std.core.mem.allocator.TempAllocator")
!144 = !{!145, !146, !159, !160, !161}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !143, file: !8, line: 12, baseType: !35, size: 128, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !143, file: !8, line: 13, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !148, size: 64, align: 64, dwarfAddressSpace: 0)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !8, file: !8, line: 22, size: 320, align: 64, elements: !149, identifier: "std.core.mem.allocator.TempAllocatorPage")
!149 = !{!150, !151, !152, !153, !154, !155}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !148, file: !8, line: 24, baseType: !147, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !148, file: !8, line: 25, baseType: !38, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !148, file: !8, line: 26, baseType: !15, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !148, file: !8, line: 27, baseType: !15, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !148, file: !8, line: 28, baseType: !15, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !8, line: 29, baseType: !156, align: 8, offset: 320)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, align: 8, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 0, lowerBound: 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !143, file: !8, line: 14, baseType: !15, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !143, file: !8, line: 15, baseType: !15, size: 64, align: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !8, line: 16, baseType: !156, align: 8, offset: 320)
!162 = !DILocation(line: 592, column: 17, scope: !140, inlinedAt: !163)
!163 = !DILocation(line: 69, column: 2, scope: !126, inlinedAt: !132)
!164 = !DILocation(line: 396, column: 6, scope: !165, inlinedAt: !167)
!165 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !166, file: !166, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!166 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!167 = !DILocation(line: 592, column: 27, scope: !140, inlinedAt: !163)
!168 = !DILocation(line: 398, column: 3, scope: !169, inlinedAt: !167)
!169 = distinct !DILexicalBlock(scope: !165, file: !166, line: 397, column: 2)
!170 = !DILocation(line: 400, column: 9, scope: !165, inlinedAt: !167)
!171 = !DILocalVariable(name: "original", scope: !140, file: !8, line: 594, type: !142, align: 8)
!172 = !DILocation(line: 594, column: 18, scope: !140, inlinedAt: !163)
!173 = !DILocation(line: 594, column: 29, scope: !140, inlinedAt: !163)
!174 = !DILocation(line: 595, column: 7, scope: !140, inlinedAt: !163)
!175 = !DILocation(line: 595, column: 18, scope: !140, inlinedAt: !163)
!176 = !DILocation(line: 595, column: 45, scope: !140, inlinedAt: !163)
!177 = !DILocalVariable(name: "mark", scope: !140, file: !8, line: 597, type: !15, align: 8)
!178 = !DILocation(line: 597, column: 6, scope: !140, inlinedAt: !163)
!179 = !DILocation(line: 597, column: 13, scope: !140, inlinedAt: !163)
!180 = !DILocalVariable(name: "str", scope: !181, file: !8, line: 71, type: !182, align: 8)
!181 = distinct !DILexicalBlock(scope: !126, file: !127, line: 70, column: 2)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "DString", scope: !8, file: !8, line: 4, baseType: !183, align: 8)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "DStringOpaque*", baseType: !184, size: 64, align: 64, dwarfAddressSpace: 0)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "DStringOpaque", scope: !8, file: !8, line: 5, baseType: null, align: 1)
!185 = !DILocation(line: 71, column: 11, scope: !181, inlinedAt: !132)
!186 = !DILocation(line: 71, column: 17, scope: !181, inlinedAt: !132)
!187 = !DILocation(line: 72, column: 7, scope: !181, inlinedAt: !132)
!188 = !DILocation(line: 393, column: 21, scope: !189, inlinedAt: !191)
!189 = distinct !DISubprogram(name: "append", linkageName: "append", scope: !190, file: !190, line: 387, scopeLine: 387, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7)
!190 = !DIFile(filename: "dstring.c3", directory: "/usr/local/lib/c3/std/core")
!191 = !DILocation(line: 72, column: 20, scope: !181, inlinedAt: !132)
!192 = !DILocation(line: 393, column: 4, scope: !189, inlinedAt: !191)
!193 = !DILocation(line: 73, column: 3, scope: !181, inlinedAt: !132)
!194 = !DILocalVariable(name: "c", scope: !195, file: !8, line: 76, type: !30, align: 1)
!195 = distinct !DILexicalBlock(scope: !196, file: !127, line: 74, column: 3)
!196 = distinct !DILexicalBlock(scope: !181, file: !127, line: 73, column: 3)
!197 = !DILocation(line: 76, column: 11, scope: !195, inlinedAt: !132)
!198 = !DILocation(line: 76, column: 15, scope: !195, inlinedAt: !132)
!199 = !DILocalVariable(name: "err", scope: !195, file: !8, line: 80, type: !12, align: 8)
!200 = !DILocation(line: 80, column: 14, scope: !195, inlinedAt: !132)
!201 = !DILocation(line: 80, column: 20, scope: !195, inlinedAt: !132)
!202 = !DILocation(line: 82, column: 9, scope: !203, inlinedAt: !132)
!203 = distinct !DILexicalBlock(scope: !195, file: !127, line: 81, column: 4)
!204 = !DILocation(line: 82, column: 29, scope: !203, inlinedAt: !132)
!205 = !DILocation(line: 83, column: 12, scope: !203, inlinedAt: !132)
!206 = !DILocation(line: 600, column: 17, scope: !207, inlinedAt: !163)
!207 = distinct !DILexicalBlock(scope: !140, file: !141, line: 599, column: 2)
!208 = !DILocation(line: 600, column: 3, scope: !207, inlinedAt: !163)
