; ModuleID = 'std::os::linux'
source_filename = "std::os::linux"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%File = type { ptr }
%Elf64_Ehdr = type { [16 x i8], i16, i16, i32, i64, i64, i64, i32, i16, i16, i16, i16, i16, i16 }
%Elf64_Phdr = type { i32, i32, i64, i64, i64, i64, i64, i64 }
%Elf32_Ehdr = type { [16 x i8], i16, i16, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16 }
%Elf32_Phdr = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%"char[][]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Linux_Dl_info = type { ptr, ptr, ptr, ptr }
%"void*[]" = type { ptr, i64 }
%List = type { i64, i64, %any, ptr }

$std.os.linux.backtrace_line_parse = comdat any

$std.os.linux.symbolize_backtrace = comdat any

$"$ct.std.os.linux.Elf32_Ehdr" = comdat any

$"$ct.std.os.linux.Elf32_Phdr" = comdat any

$"$ct.std.os.linux.Elf64_Ehdr" = comdat any

$"$ct.std.os.linux.Elf64_Phdr" = comdat any

$"$ct.std.os.linux.Linux_Dl_info" = comdat any

$std.os.linux.PT_PHDR = comdat any

$std.os.linux.EI_NIDENT = comdat any

$"std.io.IoError$ALREADY_EXISTS" = comdat any

$"std.io.IoError$BUSY" = comdat any

$"std.io.IoError$CANNOT_READ_DIR" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PT_PHDR", linkageName: "std.os.linux.PT_PHDR", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "linux.c3", directory: "/usr/local/lib/c3/std/os/linux")
!3 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "EI_NIDENT", linkageName: "std.os.linux.EI_NIDENT", scope: !2, file: !2, line: 7, type: !3, isLocal: false, isDefinition: true, align: 4)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 2, !"wchar_size", i32 4}
!9 = !{i32 4, !"PIE Level", i32 2}
!10 = !{i32 4, !"PIC Level", i32 2}
!11 = !{i32 1, !"uwtable", i32 2}
!12 = !{i32 2, !"frame-pointer", i32 2}
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !14, splitDebugInlining: false)
!14 = !{!0, !4}
!15 = distinct !DISubprogram(name: "elf_module_image_base", linkageName: "std.os.linux.elf_module_image_base", scope: !2, file: !2, line: 92, type: !16, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !20, !22}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !19)
!19 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ulong*", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !24, identifier: "char[]")
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !23, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !23, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !21)
!30 = !{}
!31 = !DILocalVariable(name: "path", arg: 1, scope: !15, file: !2, line: 92, type: !22)
!32 = !DILocation(line: 92, column: 40, scope: !15)
!33 = !DILocalVariable(name: "file", scope: !15, file: !2, line: 94, type: !34, align: 8)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", scope: !2, file: !2, line: 4, size: 64, align: 64, elements: !35, identifier: "std.io.File")
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !34, file: !2, line: 6, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "CFile", scope: !2, file: !2, line: 357, baseType: !38, align: 8)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!39 = !DILocation(line: 94, column: 7, scope: !15)
!40 = !DILocation(line: 94, column: 14, scope: !15)
!41 = !DILocalVariable(name: "buffer", scope: !15, file: !2, line: 96, type: !42, align: 1)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, align: 8, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 4, lowerBound: 0)
!45 = !DILocation(line: 96, column: 10, scope: !15)
!46 = !DILocation(line: 97, column: 23, scope: !15)
!47 = !DILocation(line: 74, column: 6, scope: !48, inlinedAt: !50)
!48 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!49 = !DIFile(filename: "stream.c3", directory: "/usr/local/lib/c3/std/io")
!50 = !DILocation(line: 97, column: 2, scope: !15)
!51 = !DILocation(line: 74, column: 30, scope: !48, inlinedAt: !50)
!52 = !DILocalVariable(name: "n", scope: !48, file: !2, line: 75, type: !29, align: 8)
!53 = !DILocation(line: 75, column: 6, scope: !48, inlinedAt: !50)
!54 = !DILocation(line: 75, column: 10, scope: !48, inlinedAt: !50)
!55 = !DILocation(line: 76, column: 6, scope: !48, inlinedAt: !50)
!56 = !DILocation(line: 76, column: 11, scope: !48, inlinedAt: !50)
!57 = !DILocation(line: 76, column: 30, scope: !48, inlinedAt: !50)
!58 = !DILocation(line: 77, column: 9, scope: !48, inlinedAt: !50)
!59 = !DILocation(line: 95, column: 9, scope: !60)
!60 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!61 = !DILocation(line: 98, column: 6, scope: !15)
!62 = !DILocation(line: 95, column: 9, scope: !63)
!63 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!64 = !DILocalVariable(name: "is_64", scope: !15, file: !2, line: 99, type: !65, align: 1)
!65 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!66 = !DILocation(line: 99, column: 7, scope: !15)
!67 = !DILocation(line: 99, column: 15, scope: !15)
!68 = !DILocation(line: 95, column: 9, scope: !69)
!69 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!70 = !DILocalVariable(name: "is_little_endian", scope: !15, file: !2, line: 100, type: !65, align: 1)
!71 = !DILocation(line: 100, column: 7, scope: !15)
!72 = !DILocation(line: 100, column: 26, scope: !15)
!73 = !DILocation(line: 95, column: 9, scope: !74)
!74 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!75 = !DILocation(line: 102, column: 7, scope: !15)
!76 = !DILocation(line: 95, column: 9, scope: !77)
!77 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!78 = !DILocation(line: 103, column: 2, scope: !15)
!79 = !DILocation(line: 95, column: 9, scope: !80)
!80 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!81 = !DILocation(line: 104, column: 6, scope: !15)
!82 = !DILocalVariable(name: "file_header", scope: !83, file: !2, line: 106, type: !84, align: 8)
!83 = distinct !DILexicalBlock(scope: !15, file: !2, line: 105, column: 2)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf64_Ehdr", scope: !2, file: !2, line: 52, size: 512, align: 64, elements: !85, identifier: "std.os.linux.Elf64_Ehdr")
!85 = !{!86, !90, !93, !94, !97, !99, !101, !102, !103, !104, !105, !106, !107, !108}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !84, file: !2, line: 54, baseType: !87, size: 128, align: 8)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 16, lowerBound: 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !84, file: !2, line: 55, baseType: !91, size: 16, align: 16, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", scope: !2, file: !2, line: 44, baseType: !92, align: 2)
!92 = !DIBasicType(name: "ushort", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !84, file: !2, line: 56, baseType: !91, size: 16, align: 16, offset: 144)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !84, file: !2, line: 57, baseType: !95, size: 32, align: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", scope: !2, file: !2, line: 46, baseType: !96, align: 4)
!96 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !84, file: !2, line: 58, baseType: !98, size: 64, align: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", scope: !2, file: !2, line: 43, baseType: !21, align: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !84, file: !2, line: 59, baseType: !100, size: 64, align: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Off", scope: !2, file: !2, line: 45, baseType: !21, align: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !84, file: !2, line: 60, baseType: !100, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !84, file: !2, line: 61, baseType: !95, size: 32, align: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !84, file: !2, line: 62, baseType: !91, size: 16, align: 16, offset: 416)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !84, file: !2, line: 63, baseType: !91, size: 16, align: 16, offset: 432)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !84, file: !2, line: 64, baseType: !91, size: 16, align: 16, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !84, file: !2, line: 65, baseType: !91, size: 16, align: 16, offset: 464)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !84, file: !2, line: 66, baseType: !91, size: 16, align: 16, offset: 480)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !84, file: !2, line: 67, baseType: !91, size: 16, align: 16, offset: 496)
!109 = !DILocation(line: 106, column: 14, scope: !83)
!110 = !DILocation(line: 107, column: 23, scope: !83)
!111 = !DILocation(line: 56, column: 28, scope: !112, inlinedAt: !113)
!112 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!113 = !DILocation(line: 107, column: 3, scope: !83)
!114 = !DILocation(line: 56, column: 40, scope: !112, inlinedAt: !113)
!115 = !DILocation(line: 74, column: 6, scope: !116, inlinedAt: !117)
!116 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!117 = !DILocation(line: 56, column: 9, scope: !112, inlinedAt: !113)
!118 = !DILocation(line: 74, column: 30, scope: !116, inlinedAt: !117)
!119 = !DILocalVariable(name: "n", scope: !116, file: !2, line: 75, type: !29, align: 8)
!120 = !DILocation(line: 75, column: 6, scope: !116, inlinedAt: !117)
!121 = !DILocation(line: 75, column: 10, scope: !116, inlinedAt: !117)
!122 = !DILocation(line: 76, column: 6, scope: !116, inlinedAt: !117)
!123 = !DILocation(line: 76, column: 11, scope: !116, inlinedAt: !117)
!124 = !DILocation(line: 76, column: 30, scope: !116, inlinedAt: !117)
!125 = !DILocation(line: 77, column: 9, scope: !116, inlinedAt: !117)
!126 = !DILocation(line: 95, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!128 = !DILocation(line: 108, column: 7, scope: !83)
!129 = !DILocation(line: 95, column: 9, scope: !130)
!130 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!131 = !DILocalVariable(name: "i", scope: !132, file: !2, line: 109, type: !133, align: 8)
!132 = distinct !DILexicalBlock(scope: !83, file: !2, line: 109, column: 3)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "isz", baseType: !19)
!134 = !DILocation(line: 109, column: 12, scope: !132)
!135 = !DILocation(line: 109, column: 16, scope: !132)
!136 = !DILocation(line: 109, column: 19, scope: !132)
!137 = !DILocation(line: 109, column: 23, scope: !132)
!138 = !DILocalVariable(name: "header", scope: !139, file: !2, line: 111, type: !140, align: 8)
!139 = distinct !DILexicalBlock(scope: !132, file: !2, line: 110, column: 3)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf64_Phdr", scope: !2, file: !2, line: 70, size: 448, align: 64, elements: !141, identifier: "std.os.linux.Elf64_Phdr")
!141 = !{!142, !143, !144, !145, !146, !147, !149, !150}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "p_type", scope: !140, file: !2, line: 72, baseType: !95, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !140, file: !2, line: 73, baseType: !95, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "p_offset", scope: !140, file: !2, line: 74, baseType: !100, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "p_vaddr", scope: !140, file: !2, line: 75, baseType: !98, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "p_paddr", scope: !140, file: !2, line: 76, baseType: !98, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "p_filesz", scope: !140, file: !2, line: 77, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", scope: !2, file: !2, line: 50, baseType: !21, align: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_memsz", scope: !140, file: !2, line: 78, baseType: !148, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "p_align", scope: !140, file: !2, line: 79, baseType: !148, size: 64, align: 64, offset: 384)
!151 = !DILocation(line: 111, column: 15, scope: !139)
!152 = !DILocation(line: 112, column: 19, scope: !139)
!153 = !DILocation(line: 112, column: 46, scope: !139)
!154 = !DILocation(line: 112, column: 72, scope: !139)
!155 = !DILocation(line: 112, column: 42, scope: !139)
!156 = !DILocation(line: 112, column: 15, scope: !139)
!157 = !DILocation(line: 112, column: 4, scope: !139)
!158 = !DILocation(line: 95, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!160 = !DILocation(line: 113, column: 24, scope: !139)
!161 = !DILocation(line: 56, column: 28, scope: !162, inlinedAt: !163)
!162 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!163 = !DILocation(line: 113, column: 4, scope: !139)
!164 = !DILocation(line: 56, column: 40, scope: !162, inlinedAt: !163)
!165 = !DILocation(line: 74, column: 6, scope: !166, inlinedAt: !167)
!166 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!167 = !DILocation(line: 56, column: 9, scope: !162, inlinedAt: !163)
!168 = !DILocation(line: 74, column: 30, scope: !166, inlinedAt: !167)
!169 = !DILocalVariable(name: "n", scope: !166, file: !2, line: 75, type: !29, align: 8)
!170 = !DILocation(line: 75, column: 6, scope: !166, inlinedAt: !167)
!171 = !DILocation(line: 75, column: 10, scope: !166, inlinedAt: !167)
!172 = !DILocation(line: 76, column: 6, scope: !166, inlinedAt: !167)
!173 = !DILocation(line: 76, column: 11, scope: !166, inlinedAt: !167)
!174 = !DILocation(line: 76, column: 30, scope: !166, inlinedAt: !167)
!175 = !DILocation(line: 77, column: 9, scope: !166, inlinedAt: !167)
!176 = !DILocation(line: 95, column: 9, scope: !177)
!177 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!178 = !DILocation(line: 114, column: 8, scope: !139)
!179 = !DILocation(line: 114, column: 41, scope: !139)
!180 = !DILocation(line: 114, column: 58, scope: !139)
!181 = !DILocation(line: 95, column: 9, scope: !182)
!182 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!183 = !DILocation(line: 109, column: 44, scope: !132)
!184 = !DILocation(line: 95, column: 9, scope: !185)
!185 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!186 = !DILocalVariable(name: "file_header", scope: !15, file: !2, line: 118, type: !187, align: 4)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf32_Ehdr", scope: !2, file: !2, line: 13, size: 416, align: 32, elements: !188, identifier: "std.os.linux.Elf32_Ehdr")
!188 = !{!189, !190, !192, !193, !195, !197, !199, !200, !201, !202, !203, !204, !205, !206}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "e_ident", scope: !187, file: !2, line: 15, baseType: !87, size: 128, align: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "e_type", scope: !187, file: !2, line: 16, baseType: !191, size: 16, align: 16, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Half", scope: !2, file: !2, line: 8, baseType: !92, align: 2)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "e_machine", scope: !187, file: !2, line: 17, baseType: !191, size: 16, align: 16, offset: 144)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "e_version", scope: !187, file: !2, line: 18, baseType: !194, size: 32, align: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Word", scope: !2, file: !2, line: 9, baseType: !96, align: 4)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "e_entry", scope: !187, file: !2, line: 19, baseType: !196, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Addr", scope: !2, file: !2, line: 10, baseType: !96, align: 4)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "e_phoff", scope: !187, file: !2, line: 20, baseType: !198, size: 32, align: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf32_Off", scope: !2, file: !2, line: 11, baseType: !96, align: 4)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "e_shoff", scope: !187, file: !2, line: 21, baseType: !198, size: 32, align: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "e_flags", scope: !187, file: !2, line: 22, baseType: !194, size: 32, align: 32, offset: 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "e_ehsize", scope: !187, file: !2, line: 23, baseType: !191, size: 16, align: 16, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "e_phentsize", scope: !187, file: !2, line: 24, baseType: !191, size: 16, align: 16, offset: 336)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "e_phnum", scope: !187, file: !2, line: 25, baseType: !191, size: 16, align: 16, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "e_shentsize", scope: !187, file: !2, line: 26, baseType: !191, size: 16, align: 16, offset: 368)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "e_shnum", scope: !187, file: !2, line: 27, baseType: !191, size: 16, align: 16, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "e_shstrndx", scope: !187, file: !2, line: 28, baseType: !191, size: 16, align: 16, offset: 400)
!207 = !DILocation(line: 118, column: 13, scope: !15)
!208 = !DILocation(line: 119, column: 22, scope: !15)
!209 = !DILocation(line: 56, column: 28, scope: !210, inlinedAt: !211)
!210 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!211 = !DILocation(line: 119, column: 2, scope: !15)
!212 = !DILocation(line: 56, column: 40, scope: !210, inlinedAt: !211)
!213 = !DILocation(line: 74, column: 6, scope: !214, inlinedAt: !215)
!214 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!215 = !DILocation(line: 56, column: 9, scope: !210, inlinedAt: !211)
!216 = !DILocation(line: 74, column: 30, scope: !214, inlinedAt: !215)
!217 = !DILocalVariable(name: "n", scope: !214, file: !2, line: 75, type: !29, align: 8)
!218 = !DILocation(line: 75, column: 6, scope: !214, inlinedAt: !215)
!219 = !DILocation(line: 75, column: 10, scope: !214, inlinedAt: !215)
!220 = !DILocation(line: 76, column: 6, scope: !214, inlinedAt: !215)
!221 = !DILocation(line: 76, column: 11, scope: !214, inlinedAt: !215)
!222 = !DILocation(line: 76, column: 30, scope: !214, inlinedAt: !215)
!223 = !DILocation(line: 77, column: 9, scope: !214, inlinedAt: !215)
!224 = !DILocation(line: 95, column: 9, scope: !225)
!225 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!226 = !DILocation(line: 120, column: 6, scope: !15)
!227 = !DILocation(line: 95, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!229 = !DILocalVariable(name: "i", scope: !230, file: !2, line: 121, type: !133, align: 8)
!230 = distinct !DILexicalBlock(scope: !15, file: !2, line: 121, column: 2)
!231 = !DILocation(line: 121, column: 11, scope: !230)
!232 = !DILocation(line: 121, column: 15, scope: !230)
!233 = !DILocation(line: 121, column: 18, scope: !230)
!234 = !DILocation(line: 121, column: 22, scope: !230)
!235 = !DILocalVariable(name: "header", scope: !236, file: !2, line: 123, type: !237, align: 4)
!236 = distinct !DILexicalBlock(scope: !230, file: !2, line: 122, column: 2)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elf32_Phdr", scope: !2, file: !2, line: 31, size: 256, align: 32, elements: !238, identifier: "std.os.linux.Elf32_Phdr")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "p_type", scope: !237, file: !2, line: 33, baseType: !194, size: 32, align: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "p_offset", scope: !237, file: !2, line: 34, baseType: !198, size: 32, align: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "p_vaddr", scope: !237, file: !2, line: 35, baseType: !196, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "p_paddr", scope: !237, file: !2, line: 36, baseType: !196, size: 32, align: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "p_filesz", scope: !237, file: !2, line: 37, baseType: !194, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "p_memsz", scope: !237, file: !2, line: 38, baseType: !194, size: 32, align: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !237, file: !2, line: 39, baseType: !194, size: 32, align: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "p_align", scope: !237, file: !2, line: 40, baseType: !194, size: 32, align: 32, offset: 224)
!247 = !DILocation(line: 123, column: 14, scope: !236)
!248 = !DILocation(line: 124, column: 13, scope: !236)
!249 = !DILocation(line: 124, column: 40, scope: !236)
!250 = !DILocation(line: 124, column: 66, scope: !236)
!251 = !DILocation(line: 124, column: 36, scope: !236)
!252 = !DILocation(line: 124, column: 3, scope: !236)
!253 = !DILocation(line: 95, column: 9, scope: !254)
!254 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!255 = !DILocation(line: 125, column: 23, scope: !236)
!256 = !DILocation(line: 56, column: 28, scope: !257, inlinedAt: !258)
!257 = distinct !DISubprogram(name: "read_any", linkageName: "read_any", scope: !49, file: !49, line: 54, scopeLine: 54, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!258 = !DILocation(line: 125, column: 3, scope: !236)
!259 = !DILocation(line: 56, column: 40, scope: !257, inlinedAt: !258)
!260 = !DILocation(line: 74, column: 6, scope: !261, inlinedAt: !262)
!261 = distinct !DISubprogram(name: "read_all", linkageName: "read_all", scope: !49, file: !49, line: 72, scopeLine: 72, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!262 = !DILocation(line: 56, column: 9, scope: !257, inlinedAt: !258)
!263 = !DILocation(line: 74, column: 30, scope: !261, inlinedAt: !262)
!264 = !DILocalVariable(name: "n", scope: !261, file: !2, line: 75, type: !29, align: 8)
!265 = !DILocation(line: 75, column: 6, scope: !261, inlinedAt: !262)
!266 = !DILocation(line: 75, column: 10, scope: !261, inlinedAt: !262)
!267 = !DILocation(line: 76, column: 6, scope: !261, inlinedAt: !262)
!268 = !DILocation(line: 76, column: 11, scope: !261, inlinedAt: !262)
!269 = !DILocation(line: 76, column: 30, scope: !261, inlinedAt: !262)
!270 = !DILocation(line: 77, column: 9, scope: !261, inlinedAt: !262)
!271 = !DILocation(line: 95, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!273 = !DILocation(line: 126, column: 7, scope: !236)
!274 = !DILocation(line: 126, column: 47, scope: !236)
!275 = !DILocation(line: 126, column: 64, scope: !236)
!276 = !DILocation(line: 126, column: 41, scope: !236)
!277 = !DILocation(line: 95, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!279 = !DILocation(line: 121, column: 43, scope: !230)
!280 = !DILocation(line: 95, column: 9, scope: !281)
!281 = distinct !DILexicalBlock(scope: !15, file: !2, line: 95, column: 8)
!282 = distinct !DISubprogram(name: "backtrace_add_from_exec", linkageName: "std.os.linux.backtrace_add_from_exec", scope: !2, file: !2, line: 131, type: !283, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!283 = !DISubroutineType(types: !284)
!284 = !{!18, !38, !285, !38, !291}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "List*", baseType: !286, size: 64, align: 64, dwarfAddressSpace: 0)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "List", scope: !2, file: !2, line: 14, size: 320, align: 64, elements: !287, identifier: "std_collections_list$std.os.backtrace.Backtrace$.List")
!287 = !{!288, !289, !290, !296}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !286, file: !2, line: 16, baseType: !29, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !286, file: !2, line: 17, baseType: !29, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !286, file: !2, line: 18, baseType: !291, size: 128, align: 64, offset: 128)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !292, identifier: "Allocator")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !291, baseType: !38, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, baseType: !295, size: 64, align: 64, offset: 64)
!295 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !286, file: !2, line: 19, baseType: !297, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Type*", baseType: !298, size: 64, align: 64, dwarfAddressSpace: 0)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", scope: !2, file: !2, line: 94, baseType: !299, align: 8)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !300, identifier: "std.os.backtrace.Backtrace")
!300 = !{!301, !303, !304, !305, !306, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !299, file: !2, line: 17, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !21)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !299, file: !2, line: 18, baseType: !22, size: 128, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !299, file: !2, line: 19, baseType: !22, size: 128, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !299, file: !2, line: 20, baseType: !22, size: 128, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !299, file: !2, line: 21, baseType: !96, size: 32, align: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !299, file: !2, line: 22, baseType: !291, size: 128, align: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !299, file: !2, line: 23, baseType: !65, size: 8, align: 8, offset: 640)
!309 = !DILocalVariable(name: "list", arg: 1, scope: !282, file: !2, line: 131, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "BacktraceList*", baseType: !311, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "BacktraceList", scope: !2, file: !2, line: 94, baseType: !286, align: 8)
!312 = !DILocation(line: 131, column: 49, scope: !282)
!313 = !DILocalVariable(name: "addr", arg: 2, scope: !282, file: !2, line: 131, type: !38)
!314 = !DILocation(line: 131, column: 61, scope: !282)
!315 = !DILocalVariable(name: "allocator", arg: 3, scope: !282, file: !2, line: 131, type: !291)
!316 = !DILocation(line: 131, column: 77, scope: !282)
!317 = !DILocalVariable(name: "buf", scope: !282, file: !2, line: 133, type: !23, align: 8)
!318 = !DILocation(line: 133, column: 9, scope: !282)
!319 = !DILocation(line: 820, column: 41, scope: !320, inlinedAt: !322)
!320 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !321, file: !321, line: 818, scopeLine: 818, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!321 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!322 = !DILocation(line: 133, column: 15, scope: !282)
!323 = !DILocation(line: 820, column: 26, scope: !320, inlinedAt: !322)
!324 = !DILocation(line: 820, column: 18, scope: !320, inlinedAt: !322)
!325 = !DILocation(line: 820, column: 68, scope: !320, inlinedAt: !322)
!326 = !DILocalVariable(name: "exec_path", scope: !282, file: !2, line: 135, type: !22, align: 8)
!327 = !DILocation(line: 135, column: 9, scope: !282)
!328 = !DILocation(line: 135, column: 61, scope: !282)
!329 = !DILocation(line: 135, column: 73, scope: !282)
!330 = !DILocation(line: 135, column: 111, scope: !282)
!331 = !DILocation(line: 135, column: 79, scope: !282)
!332 = !DILocation(line: 135, column: 21, scope: !282)
!333 = !DILocalVariable(name: "obj_name", scope: !282, file: !2, line: 136, type: !22, align: 8)
!334 = !DILocation(line: 136, column: 9, scope: !282)
!335 = !DILocation(line: 136, column: 35, scope: !282)
!336 = !DILocation(line: 136, column: 20, scope: !282)
!337 = !DILocalVariable(name: "addr2line", scope: !282, file: !2, line: 137, type: !22, align: 8)
!338 = !DILocation(line: 137, column: 9, scope: !282)
!339 = !DILocation(line: 137, column: 61, scope: !282)
!340 = !DILocation(line: 137, column: 74, scope: !282)
!341 = !DILocation(line: 137, column: 80, scope: !282)
!342 = !DILocation(line: 137, column: 86, scope: !282)
!343 = !DILocation(line: 137, column: 92, scope: !282)
!344 = !DILocation(line: 137, column: 98, scope: !282)
!345 = !DILocation(line: 137, column: 104, scope: !282)
!346 = !DILocation(line: 137, column: 139, scope: !282)
!347 = !DILocation(line: 137, column: 115, scope: !282)
!348 = !DILocation(line: 137, column: 21, scope: !282)
!349 = !DILocation(line: 138, column: 73, scope: !282)
!350 = !DILocation(line: 138, column: 9, scope: !282)
!351 = distinct !DISubprogram(name: "backtrace_add_from_dlinfo", linkageName: "std.os.linux.backtrace_add_from_dlinfo", scope: !2, file: !2, line: 141, type: !352, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!352 = !DISubroutineType(types: !353)
!353 = !{!18, !38, !285, !38, !354, !291}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Linux_Dl_info*", baseType: !355, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Linux_Dl_info", scope: !2, file: !2, line: 84, size: 256, align: 64, elements: !356, identifier: "std.os.linux.Linux_Dl_info")
!356 = !{!357, !359, !360, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !355, file: !2, line: 86, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZString", scope: !2, file: !2, line: 6, baseType: !26, align: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !355, file: !2, line: 87, baseType: !38, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !355, file: !2, line: 88, baseType: !358, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !355, file: !2, line: 89, baseType: !38, size: 64, align: 64, offset: 192)
!362 = !DILocalVariable(name: "list", arg: 1, scope: !351, file: !2, line: 141, type: !310)
!363 = !DILocation(line: 141, column: 51, scope: !351)
!364 = !DILocalVariable(name: "addr", arg: 2, scope: !351, file: !2, line: 141, type: !38)
!365 = !DILocation(line: 141, column: 63, scope: !351)
!366 = !DILocalVariable(name: "info", arg: 3, scope: !351, file: !2, line: 141, type: !354)
!367 = !DILocation(line: 141, column: 84, scope: !351)
!368 = !DILocalVariable(name: "allocator", arg: 4, scope: !351, file: !2, line: 141, type: !291)
!369 = !DILocation(line: 141, column: 100, scope: !351)
!370 = !DILocalVariable(name: "buf", scope: !351, file: !2, line: 143, type: !23, align: 8)
!371 = !DILocation(line: 143, column: 9, scope: !351)
!372 = !DILocation(line: 820, column: 41, scope: !373, inlinedAt: !374)
!373 = distinct !DISubprogram(name: "temp_alloc_array", linkageName: "temp_alloc_array", scope: !321, file: !321, line: 818, scopeLine: 818, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!374 = !DILocation(line: 143, column: 15, scope: !351)
!375 = !DILocation(line: 820, column: 26, scope: !373, inlinedAt: !374)
!376 = !DILocation(line: 820, column: 18, scope: !373, inlinedAt: !374)
!377 = !DILocation(line: 820, column: 68, scope: !373, inlinedAt: !374)
!378 = !DILocalVariable(name: "obj_addr", scope: !351, file: !2, line: 145, type: !38, align: 8)
!379 = !DILocation(line: 145, column: 10, scope: !351)
!380 = !DILocation(line: 145, column: 22, scope: !351)
!381 = !DILocation(line: 145, column: 35, scope: !351)
!382 = !DILocation(line: 145, column: 80, scope: !351)
!383 = !DILocation(line: 145, column: 58, scope: !351)
!384 = !DILocalVariable(name: "obj_path", scope: !351, file: !2, line: 146, type: !358, align: 8)
!385 = !DILocation(line: 146, column: 10, scope: !351)
!386 = !DILocation(line: 146, column: 22, scope: !351)
!387 = !DILocalVariable(name: "sname", scope: !351, file: !2, line: 147, type: !22, align: 8)
!388 = !DILocation(line: 147, column: 10, scope: !351)
!389 = !DILocation(line: 147, column: 22, scope: !351)
!390 = !DILocation(line: 147, column: 39, scope: !351)
!391 = !DILocation(line: 147, column: 67, scope: !351)
!392 = !DILocalVariable(name: "addr2line", scope: !351, file: !2, line: 148, type: !22, align: 8)
!393 = !DILocation(line: 148, column: 10, scope: !351)
!394 = !DILocation(line: 148, column: 62, scope: !351)
!395 = !DILocation(line: 148, column: 75, scope: !351)
!396 = !DILocation(line: 148, column: 81, scope: !351)
!397 = !DILocation(line: 148, column: 87, scope: !351)
!398 = !DILocation(line: 148, column: 93, scope: !351)
!399 = !DILocation(line: 148, column: 99, scope: !351)
!400 = !DILocation(line: 148, column: 105, scope: !351)
!401 = !DILocation(line: 148, column: 150, scope: !351)
!402 = !DILocation(line: 148, column: 161, scope: !351)
!403 = !DILocation(line: 148, column: 126, scope: !351)
!404 = !DILocation(line: 148, column: 22, scope: !351)
!405 = !DILocation(line: 149, column: 56, scope: !351)
!406 = !DILocation(line: 149, column: 90, scope: !351)
!407 = !DILocation(line: 149, column: 9, scope: !351)
!408 = distinct !DISubprogram(name: "backtrace_line_parse", linkageName: "std.os.linux.backtrace_line_parse", scope: !2, file: !2, line: 152, type: !409, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !30)
!409 = !DISubroutineType(types: !410)
!410 = !{!18, !411, !22, !22, !22, !65, !291}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !299, size: 64, align: 64, dwarfAddressSpace: 0)
!412 = !DILocalVariable(name: "string", arg: 1, scope: !408, file: !2, line: 152, type: !22)
!413 = !DILocation(line: 152, column: 43, scope: !408)
!414 = !DILocalVariable(name: "obj_name", arg: 2, scope: !408, file: !2, line: 152, type: !22)
!415 = !DILocation(line: 152, column: 58, scope: !408)
!416 = !DILocalVariable(name: "func_name", arg: 3, scope: !408, file: !2, line: 152, type: !22)
!417 = !DILocation(line: 152, column: 75, scope: !408)
!418 = !DILocalVariable(name: "is_inlined", arg: 4, scope: !408, file: !2, line: 152, type: !65)
!419 = !DILocation(line: 152, column: 91, scope: !408)
!420 = !DILocalVariable(name: "allocator", arg: 5, scope: !408, file: !2, line: 152, type: !291)
!421 = !DILocation(line: 152, column: 113, scope: !408)
!422 = !DILocalVariable(name: "parts", scope: !408, file: !2, line: 154, type: !423, align: 8)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "String[]", size: 128, align: 64, elements: !424, identifier: "String[]")
!424 = !{!425, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !423, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "String*", baseType: !22, size: 64, align: 64, dwarfAddressSpace: 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !423, baseType: !29, size: 64, align: 64, offset: 64)
!428 = !DILocation(line: 154, column: 11, scope: !408)
!429 = !DILocation(line: 141, column: 48, scope: !430, inlinedAt: !432)
!430 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !431, file: !431, line: 141, scopeLine: 141, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!431 = !DIFile(filename: "string.c3", directory: "/usr/local/lib/c3/std/core")
!432 = !DILocation(line: 154, column: 19, scope: !408)
!433 = !DILocation(line: 306, column: 76, scope: !434, inlinedAt: !432)
!434 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !431, file: !431, line: 306, scopeLine: 306, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!435 = !DILocation(line: 155, column: 6, scope: !408)
!436 = !DILocation(line: 155, column: 29, scope: !408)
!437 = !DILocalVariable(name: "line", scope: !408, file: !2, line: 157, type: !96, align: 4)
!438 = !DILocation(line: 157, column: 7, scope: !408)
!439 = !DILocation(line: 157, column: 16, scope: !408)
!440 = !DILocalVariable(name: "source", scope: !408, file: !2, line: 158, type: !22, align: 8)
!441 = !DILocation(line: 158, column: 9, scope: !408)
!442 = !DILocation(line: 158, column: 18, scope: !408)
!443 = !DILocation(line: 159, column: 7, scope: !408)
!444 = !DILocation(line: 159, column: 13, scope: !408)
!445 = !DILocation(line: 159, column: 25, scope: !408)
!446 = !DILocation(line: 159, column: 33, scope: !408)
!447 = !DILocation(line: 159, column: 39, scope: !408)
!448 = !DILocation(line: 159, column: 51, scope: !408)
!449 = !DILocalVariable(name: "index", scope: !450, file: !2, line: 161, type: !29, align: 8)
!450 = distinct !DILexicalBlock(scope: !408, file: !2, line: 160, column: 2)
!451 = !DILocation(line: 161, column: 7, scope: !450)
!452 = !DILocation(line: 161, column: 15, scope: !450)
!453 = !DILocation(line: 161, column: 21, scope: !450)
!454 = !DILocation(line: 162, column: 12, scope: !450)
!455 = !DILocation(line: 162, column: 18, scope: !450)
!456 = !DILocation(line: 162, column: 21, scope: !450)
!457 = !DILocation(line: 162, column: 22, scope: !450)
!458 = !DILocation(line: 163, column: 12, scope: !450)
!459 = !DILocation(line: 163, column: 18, scope: !450)
!460 = !DILocation(line: 163, column: 21, scope: !450)
!461 = !DILocation(line: 166, column: 18, scope: !408)
!462 = !DILocation(line: 166, column: 24, scope: !408)
!463 = !DILocation(line: 166, column: 32, scope: !408)
!464 = !DILocation(line: 167, column: 32, scope: !408)
!465 = !DILocation(line: 167, column: 18, scope: !408)
!466 = !DILocation(line: 168, column: 30, scope: !408)
!467 = !DILocation(line: 168, column: 18, scope: !408)
!468 = !DILocation(line: 169, column: 18, scope: !408)
!469 = !DILocation(line: 170, column: 18, scope: !408)
!470 = !DILocation(line: 171, column: 18, scope: !408)
!471 = distinct !DISubprogram(name: "backtrace_add_addr2line", linkageName: "std.os.linux.backtrace_add_addr2line", scope: !2, file: !2, line: 174, type: !472, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!472 = !DISubroutineType(types: !473)
!473 = !{!18, !38, !285, !38, !22, !22, !22, !291}
!474 = !DILocalVariable(name: "list", arg: 1, scope: !471, file: !2, line: 174, type: !310)
!475 = !DILocation(line: 174, column: 49, scope: !471)
!476 = !DILocalVariable(name: "addr", arg: 2, scope: !471, file: !2, line: 174, type: !38)
!477 = !DILocation(line: 174, column: 61, scope: !471)
!478 = !DILocalVariable(name: "addr2line", arg: 3, scope: !471, file: !2, line: 174, type: !22)
!479 = !DILocation(line: 174, column: 74, scope: !471)
!480 = !DILocalVariable(name: "obj_name", arg: 4, scope: !471, file: !2, line: 174, type: !22)
!481 = !DILocation(line: 174, column: 92, scope: !471)
!482 = !DILocalVariable(name: "func_name", arg: 5, scope: !471, file: !2, line: 174, type: !22)
!483 = !DILocation(line: 174, column: 109, scope: !471)
!484 = !DILocalVariable(name: "allocator", arg: 6, scope: !471, file: !2, line: 174, type: !291)
!485 = !DILocation(line: 174, column: 130, scope: !471)
!486 = !DILocalVariable(name: "inline_parts", scope: !471, file: !2, line: 176, type: !423, align: 8)
!487 = !DILocation(line: 176, column: 11, scope: !471)
!488 = !DILocation(line: 306, column: 76, scope: !489, inlinedAt: !490)
!489 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !431, file: !431, line: 306, scopeLine: 306, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!490 = !DILocation(line: 176, column: 26, scope: !471)
!491 = !DILocalVariable(name: "last", scope: !471, file: !2, line: 177, type: !29, align: 8)
!492 = !DILocation(line: 177, column: 6, scope: !471)
!493 = !DILocation(line: 177, column: 13, scope: !471)
!494 = !DILocation(line: 178, column: 21, scope: !495)
!495 = distinct !DILexicalBlock(scope: !471, file: !2, line: 178, column: 2)
!496 = !DILocalVariable(name: ".temp", scope: !495, file: !2, line: 178, type: !29, align: 8)
!497 = !DILocation(line: 178, column: 11, scope: !495)
!498 = !DILocalVariable(name: "i", scope: !499, file: !2, line: 178, type: !29, align: 8)
!499 = distinct !DILexicalBlock(scope: !495, file: !2, line: 179, column: 2)
!500 = !DILocation(line: 178, column: 11, scope: !499)
!501 = !DILocalVariable(name: "part", scope: !499, file: !2, line: 178, type: !22, align: 8)
!502 = !DILocation(line: 178, column: 14, scope: !499)
!503 = !DILocation(line: 178, column: 21, scope: !499)
!504 = !DILocalVariable(name: "is_inline", scope: !505, file: !2, line: 180, type: !65, align: 1)
!505 = distinct !DILexicalBlock(scope: !499, file: !2, line: 179, column: 2)
!506 = !DILocation(line: 180, column: 8, scope: !505)
!507 = !DILocation(line: 180, column: 20, scope: !505)
!508 = !DILocation(line: 180, column: 25, scope: !505)
!509 = !DILocalVariable(name: "trace", scope: !505, file: !2, line: 181, type: !299, align: 8)
!510 = !DILocation(line: 181, column: 14, scope: !505)
!511 = !DILocation(line: 181, column: 22, scope: !505)
!512 = !DILocation(line: 182, column: 13, scope: !505)
!513 = !DILocation(line: 185, column: 35, scope: !514)
!514 = distinct !DILexicalBlock(scope: !505, file: !2, line: 183, column: 3)
!515 = !DILocation(line: 185, column: 20, scope: !514)
!516 = !DILocation(line: 186, column: 34, scope: !514)
!517 = !DILocation(line: 186, column: 20, scope: !514)
!518 = !DILocation(line: 187, column: 21, scope: !514)
!519 = !DILocation(line: 188, column: 28, scope: !514)
!520 = !DILocation(line: 188, column: 20, scope: !514)
!521 = !DILocation(line: 189, column: 20, scope: !514)
!522 = !DILocation(line: 190, column: 20, scope: !514)
!523 = !DILocation(line: 191, column: 20, scope: !514)
!524 = !DILocation(line: 184, column: 4, scope: !514)
!525 = !DILocation(line: 193, column: 4, scope: !514)
!526 = !DILocation(line: 195, column: 13, scope: !505)
!527 = !DILocation(line: 195, column: 3, scope: !505)
!528 = distinct !DISubprogram(name: "backtrace_add_element", linkageName: "std.os.linux.backtrace_add_element", scope: !2, file: !2, line: 199, type: !283, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!529 = !DILocalVariable(name: "list", arg: 1, scope: !528, file: !2, line: 199, type: !310)
!530 = !DILocation(line: 199, column: 47, scope: !528)
!531 = !DILocalVariable(name: "addr", arg: 2, scope: !528, file: !2, line: 199, type: !38)
!532 = !DILocation(line: 199, column: 59, scope: !528)
!533 = !DILocalVariable(name: "allocator", arg: 3, scope: !528, file: !2, line: 199, type: !291)
!534 = !DILocation(line: 199, column: 75, scope: !528)
!535 = !DILocation(line: 201, column: 6, scope: !528)
!536 = !DILocation(line: 203, column: 13, scope: !537)
!537 = distinct !DILexicalBlock(scope: !528, file: !2, line: 202, column: 2)
!538 = !DILocation(line: 203, column: 3, scope: !537)
!539 = !DILocalVariable(name: "current", scope: !540, file: !2, line: 592, type: !541, align: 8)
!540 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !321, file: !321, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !542, size: 64, align: 64, dwarfAddressSpace: 0)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !543, identifier: "std.core.mem.allocator.TempAllocator")
!543 = !{!544, !545, !558, !559, !560}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !542, file: !2, line: 12, baseType: !291, size: 128, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !542, file: !2, line: 13, baseType: !546, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !547, size: 64, align: 64, dwarfAddressSpace: 0)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !548, identifier: "std.core.mem.allocator.TempAllocatorPage")
!548 = !{!549, !550, !551, !552, !553, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !547, file: !2, line: 24, baseType: !546, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !547, file: !2, line: 25, baseType: !38, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !547, file: !2, line: 26, baseType: !29, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !547, file: !2, line: 27, baseType: !29, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !547, file: !2, line: 28, baseType: !29, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !547, file: !2, line: 29, baseType: !555, align: 8, offset: 320)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, align: 8, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 0, lowerBound: 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !542, file: !2, line: 14, baseType: !29, size: 64, align: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !542, file: !2, line: 15, baseType: !29, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !542, file: !2, line: 16, baseType: !555, align: 8, offset: 320)
!561 = !DILocation(line: 592, column: 17, scope: !540, inlinedAt: !562)
!562 = !DILocation(line: 207, column: 2, scope: !528)
!563 = !DILocation(line: 396, column: 6, scope: !564, inlinedAt: !566)
!564 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !565, file: !565, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!565 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!566 = !DILocation(line: 592, column: 27, scope: !540, inlinedAt: !562)
!567 = !DILocation(line: 398, column: 3, scope: !568, inlinedAt: !566)
!568 = distinct !DILexicalBlock(scope: !564, file: !565, line: 397, column: 2)
!569 = !DILocation(line: 400, column: 9, scope: !564, inlinedAt: !566)
!570 = !DILocalVariable(name: "original", scope: !540, file: !2, line: 594, type: !541, align: 8)
!571 = !DILocation(line: 594, column: 18, scope: !540, inlinedAt: !562)
!572 = !DILocation(line: 594, column: 29, scope: !540, inlinedAt: !562)
!573 = !DILocation(line: 595, column: 7, scope: !540, inlinedAt: !562)
!574 = !DILocation(line: 595, column: 18, scope: !540, inlinedAt: !562)
!575 = !DILocation(line: 595, column: 45, scope: !540, inlinedAt: !562)
!576 = !DILocalVariable(name: "mark", scope: !540, file: !2, line: 597, type: !29, align: 8)
!577 = !DILocation(line: 597, column: 6, scope: !540, inlinedAt: !562)
!578 = !DILocation(line: 597, column: 13, scope: !540, inlinedAt: !562)
!579 = !DILocalVariable(name: "info", scope: !580, file: !2, line: 209, type: !355, align: 8)
!580 = distinct !DILexicalBlock(scope: !528, file: !2, line: 208, column: 2)
!581 = !DILocation(line: 209, column: 17, scope: !580)
!582 = !DILocation(line: 210, column: 21, scope: !580)
!583 = !DILocation(line: 210, column: 7, scope: !580)
!584 = !DILocation(line: 212, column: 47, scope: !585)
!585 = distinct !DILexicalBlock(scope: !580, file: !2, line: 211, column: 3)
!586 = !DILocation(line: 212, column: 11, scope: !585)
!587 = !DILocation(line: 600, column: 17, scope: !588, inlinedAt: !562)
!588 = distinct !DILexicalBlock(scope: !540, file: !321, line: 599, column: 2)
!589 = !DILocation(line: 600, column: 3, scope: !588, inlinedAt: !562)
!590 = !DILocation(line: 602, column: 39, scope: !588, inlinedAt: !562)
!591 = !DILocation(line: 603, column: 9, scope: !588, inlinedAt: !562)
!592 = !DILocation(line: 600, column: 17, scope: !593, inlinedAt: !562)
!593 = distinct !DILexicalBlock(scope: !540, file: !321, line: 599, column: 2)
!594 = !DILocation(line: 600, column: 3, scope: !593, inlinedAt: !562)
!595 = !DILocation(line: 602, column: 39, scope: !593, inlinedAt: !562)
!596 = !DILocation(line: 603, column: 9, scope: !593, inlinedAt: !562)
!597 = !DILocation(line: 214, column: 55, scope: !580)
!598 = !DILocation(line: 214, column: 10, scope: !580)
!599 = !DILocation(line: 600, column: 17, scope: !600, inlinedAt: !562)
!600 = distinct !DILexicalBlock(scope: !540, file: !321, line: 599, column: 2)
!601 = !DILocation(line: 600, column: 3, scope: !600, inlinedAt: !562)
!602 = !DILocation(line: 602, column: 39, scope: !600, inlinedAt: !562)
!603 = !DILocation(line: 603, column: 9, scope: !600, inlinedAt: !562)
!604 = !DILocation(line: 600, column: 17, scope: !605, inlinedAt: !562)
!605 = distinct !DILexicalBlock(scope: !540, file: !321, line: 599, column: 2)
!606 = !DILocation(line: 600, column: 3, scope: !605, inlinedAt: !562)
!607 = !DILocation(line: 602, column: 39, scope: !605, inlinedAt: !562)
!608 = !DILocation(line: 603, column: 9, scope: !605, inlinedAt: !562)
!609 = distinct !DISubprogram(name: "symbolize_backtrace", linkageName: "std.os.linux.symbolize_backtrace", scope: !2, file: !2, line: 218, type: !610, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !30)
!610 = !DISubroutineType(types: !611)
!611 = !{!18, !310, !612, !291}
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !613, identifier: "void*[]")
!613 = !{!614, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !612, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !38, size: 64, align: 64, dwarfAddressSpace: 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !612, baseType: !29, size: 64, align: 64, offset: 64)
!617 = !DILocalVariable(name: "backtrace", arg: 1, scope: !609, file: !2, line: 218, type: !612)
!618 = !DILocation(line: 218, column: 47, scope: !609)
!619 = !DILocalVariable(name: "allocator", arg: 2, scope: !609, file: !2, line: 218, type: !291)
!620 = !DILocation(line: 218, column: 68, scope: !609)
!621 = !DILocalVariable(name: "list", scope: !609, file: !2, line: 220, type: !311, align: 8)
!622 = !DILocation(line: 220, column: 16, scope: !609)
!623 = !DILocation(line: 221, column: 16, scope: !609)
!624 = !DILocation(line: 221, column: 31, scope: !609)
!625 = !DILocation(line: 221, column: 2, scope: !609)
!626 = !DILocalVariable(name: "current", scope: !627, file: !2, line: 592, type: !541, align: 8)
!627 = distinct !DISubprogram(name: "@pool", linkageName: "@pool", scope: !321, file: !321, line: 590, scopeLine: 590, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13, retainedNodes: !30)
!628 = !DILocation(line: 592, column: 17, scope: !627, inlinedAt: !629)
!629 = !DILocation(line: 230, column: 2, scope: !609)
!630 = !DILocation(line: 396, column: 6, scope: !631, inlinedAt: !632)
!631 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !565, file: !565, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !13)
!632 = !DILocation(line: 592, column: 27, scope: !627, inlinedAt: !629)
!633 = !DILocation(line: 398, column: 3, scope: !634, inlinedAt: !632)
!634 = distinct !DILexicalBlock(scope: !631, file: !565, line: 397, column: 2)
!635 = !DILocation(line: 400, column: 9, scope: !631, inlinedAt: !632)
!636 = !DILocalVariable(name: "original", scope: !627, file: !2, line: 594, type: !541, align: 8)
!637 = !DILocation(line: 594, column: 18, scope: !627, inlinedAt: !629)
!638 = !DILocation(line: 594, column: 29, scope: !627, inlinedAt: !629)
!639 = !DILocation(line: 595, column: 7, scope: !627, inlinedAt: !629)
!640 = !DILocation(line: 595, column: 18, scope: !627, inlinedAt: !629)
!641 = !DILocation(line: 595, column: 45, scope: !627, inlinedAt: !629)
!642 = !DILocalVariable(name: "mark", scope: !627, file: !2, line: 597, type: !29, align: 8)
!643 = !DILocation(line: 597, column: 6, scope: !627, inlinedAt: !629)
!644 = !DILocation(line: 597, column: 13, scope: !627, inlinedAt: !629)
!645 = !DILocation(line: 232, column: 19, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !2, line: 232, column: 3)
!647 = distinct !DILexicalBlock(scope: !609, file: !2, line: 231, column: 2)
!648 = !DILocalVariable(name: ".temp", scope: !646, file: !2, line: 232, type: !29, align: 8)
!649 = !DILocalVariable(name: "addr", scope: !650, file: !2, line: 232, type: !38, align: 8)
!650 = distinct !DILexicalBlock(scope: !646, file: !2, line: 233, column: 3)
!651 = !DILocation(line: 232, column: 12, scope: !650)
!652 = !DILocation(line: 232, column: 19, scope: !650)
!653 = !DILocation(line: 234, column: 39, scope: !654)
!654 = distinct !DILexicalBlock(scope: !650, file: !2, line: 233, column: 3)
!655 = !DILocation(line: 234, column: 4, scope: !654)
!656 = !DILocation(line: 600, column: 17, scope: !657, inlinedAt: !629)
!657 = distinct !DILexicalBlock(scope: !627, file: !321, line: 599, column: 2)
!658 = !DILocation(line: 600, column: 3, scope: !657, inlinedAt: !629)
!659 = !DILocation(line: 602, column: 39, scope: !657, inlinedAt: !629)
!660 = !DILocation(line: 224, column: 20, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !2, line: 224, column: 3)
!662 = distinct !DILexicalBlock(scope: !609, file: !2, line: 223, column: 2)
!663 = !DILocalVariable(name: ".temp", scope: !661, file: !2, line: 224, type: !29, align: 8)
!664 = !DILocalVariable(name: "trace", scope: !665, file: !2, line: 224, type: !298, align: 8)
!665 = distinct !DILexicalBlock(scope: !661, file: !2, line: 225, column: 3)
!666 = !DILocation(line: 224, column: 12, scope: !665)
