; ModuleID = 'std::os::backtrace'
source_filename = "std::os::backtrace"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.fault = type { i64, %"char[]", i64 }
%"char[]" = type { ptr, i64 }
%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%Backtrace = type { i64, %"char[]", %"char[]", %"char[]", i32, %any, i8 }
%any = type { ptr, i64 }
%"void*[]" = type { ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.os.backtrace.Backtrace.has_file = comdat any

$std.os.backtrace.Backtrace.is_unknown = comdat any

$std.os.backtrace.Backtrace.to_format = comdat any

$std.os.backtrace.Backtrace.free = comdat any

$std.os.backtrace.Backtrace.init = comdat any

$std.os.backtrace.capture_current = comdat any

$.dyn_search = comdat any

$"std.os.backtrace.BacktraceFault$SEGMENT_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$EXECUTABLE_PATH_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$IMAGE_NOT_FOUND" = comdat any

$"std.os.backtrace.BacktraceFault$NO_BACKTRACE_SYMBOLS" = comdat any

$"std.os.backtrace.BacktraceFault$RESOLUTION_FAILED" = comdat any

$"$ct.std.os.backtrace.BacktraceFault" = comdat any

$"$ct.std.os.backtrace.Backtrace" = comdat any

$"$ct.void" = comdat any

$std.os.backtrace.BACKTRACE_UNKNOWN = comdat any

$"$ct.long" = comdat any

$"$ct.String" = comdat any

$"$ct.sa$char" = comdat any

$"$ct.char" = comdat any

$"$ct.uint" = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "BACKTRACE_UNKNOWN", linkageName: "std.os.backtrace.BACKTRACE_UNKNOWN", scope: !2, file: !2, line: 13, type: !3, isLocal: false, isDefinition: true, align: 8)
!2 = !DIFile(filename: "backtrace.c3", directory: "/usr/local/lib/c3/std/os")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "Backtrace", scope: !2, file: !2, line: 15, size: 704, align: 64, elements: !4, identifier: "std.os.backtrace.Backtrace")
!4 = !{!5, !8, !17, !18, !19, !21, !28}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3, file: !2, line: 17, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uptr", baseType: !7)
!7 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !3, file: !2, line: 18, baseType: !9, size: 128, align: 64, offset: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", baseType: !10)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !11, identifier: "char[]")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !10, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !10, baseType: !16, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !7)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "object_file", scope: !3, file: !2, line: 19, baseType: !9, size: 128, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !3, file: !2, line: 20, baseType: !9, size: 128, align: 64, offset: 320)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !3, file: !2, line: 21, baseType: !20, size: 32, align: 32, offset: 448)
!20 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !3, file: !2, line: 22, baseType: !22, size: 128, align: 64, offset: 512)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !23, identifier: "Allocator")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "is_inline", scope: !3, file: !2, line: 23, baseType: !29, size: 8, align: 8, offset: 640)
!29 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 2, !"wchar_size", i32 4}
!33 = !{i32 4, !"PIE Level", i32 2}
!34 = !{i32 4, !"PIC Level", i32 2}
!35 = !{i32 1, !"uwtable", i32 2}
!36 = !{i32 2, !"frame-pointer", i32 2}
!37 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !38, splitDebugInlining: false)
!38 = !{!0}
!39 = distinct !DISubprogram(name: "has_file", linkageName: "std.os.backtrace.Backtrace.has_file", scope: !2, file: !2, line: 27, type: !40, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !43)
!40 = !DISubroutineType(types: !41)
!41 = !{!29, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Backtrace*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!43 = !{}
!44 = !DILocation(line: 28, column: 1, scope: !39)
!45 = !DILocalVariable(name: "self", arg: 1, scope: !39, file: !2, line: 27, type: !42)
!46 = !DILocation(line: 27, column: 28, scope: !39)
!47 = !DILocation(line: 29, column: 9, scope: !39)
!48 = distinct !DISubprogram(name: "is_unknown", linkageName: "std.os.backtrace.Backtrace.is_unknown", scope: !2, file: !2, line: 32, type: !40, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !43)
!49 = !DILocation(line: 33, column: 1, scope: !48)
!50 = !DILocalVariable(name: "self", arg: 1, scope: !48, file: !2, line: 32, type: !42)
!51 = !DILocation(line: 32, column: 30, scope: !48)
!52 = !DILocation(line: 34, column: 10, scope: !48)
!53 = distinct !DISubprogram(name: "to_format", linkageName: "std.os.backtrace.Backtrace.to_format", scope: !2, file: !2, line: 37, type: !54, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !43)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !58, !42, !59}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "anyfault", baseType: !57)
!57 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "usz*", baseType: !16, size: 64, align: 64, dwarfAddressSpace: 0)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Formatter*", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !2, file: !2, line: 71, size: 384, align: 64, elements: !61, identifier: "std.io.Formatter")
!61 = !{!62, !63, !68}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !2, line: 73, baseType: !25, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "out_fn", scope: !60, file: !2, line: 74, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "OutputFn", scope: !2, file: !2, line: 23, baseType: !65, align: 8)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "OutputFn", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !DISubroutineType(types: !67)
!67 = !{!56, !25, !25, !14}
!68 = !DIDerivedType(tag: DW_TAG_member, scope: !60, file: !2, line: 75, baseType: !69, size: 256, align: 64, offset: 128)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "$anon", scope: !60, file: !2, line: 75, size: 256, align: 64, elements: !70)
!70 = !{!71, !72, !73, !74, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !2, line: 77, baseType: !20, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !69, file: !2, line: 78, baseType: !20, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !69, file: !2, line: 79, baseType: !20, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !69, file: !2, line: 80, baseType: !16, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "first_fault", scope: !69, file: !2, line: 81, baseType: !56, size: 64, align: 64, offset: 192)
!76 = !DILocation(line: 38, column: 1, scope: !53)
!77 = !DILocalVariable(name: "self", arg: 1, scope: !53, file: !2, line: 37, type: !42)
!78 = !DILocation(line: 37, column: 29, scope: !53)
!79 = !DILocalVariable(name: "formatter", arg: 2, scope: !53, file: !2, line: 37, type: !59)
!80 = !DILocation(line: 37, column: 47, scope: !53)
!81 = !DILocalVariable(name: "inline_suffix", scope: !53, file: !2, line: 39, type: !9, align: 8)
!82 = !DILocation(line: 39, column: 9, scope: !53)
!83 = !DILocation(line: 39, column: 25, scope: !53)
!84 = !DILocation(line: 39, column: 56, scope: !53)
!85 = !DILocation(line: 40, column: 6, scope: !53)
!86 = !DILocation(line: 42, column: 51, scope: !87)
!87 = distinct !DILexicalBlock(scope: !53, file: !2, line: 41, column: 2)
!88 = !DILocation(line: 42, column: 66, scope: !87)
!89 = !DILocation(line: 42, column: 84, scope: !87)
!90 = !DILocation(line: 42, column: 95, scope: !87)
!91 = !DILocation(line: 42, column: 106, scope: !87)
!92 = !DILocation(line: 42, column: 10, scope: !87)
!93 = !DILocation(line: 44, column: 6, scope: !53)
!94 = !DILocation(line: 46, column: 49, scope: !95)
!95 = distinct !DILexicalBlock(scope: !53, file: !2, line: 45, column: 2)
!96 = !DILocation(line: 46, column: 10, scope: !95)
!97 = !DILocation(line: 48, column: 63, scope: !53)
!98 = !DILocation(line: 48, column: 78, scope: !53)
!99 = !DILocation(line: 48, column: 96, scope: !53)
!100 = !DILocation(line: 48, column: 9, scope: !53)
!101 = distinct !DISubprogram(name: "free", linkageName: "std.os.backtrace.Backtrace.free", scope: !2, file: !2, line: 50, type: !102, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !43)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !42}
!104 = !DILocation(line: 51, column: 1, scope: !101)
!105 = !DILocalVariable(name: "self", arg: 1, scope: !101, file: !2, line: 50, type: !42)
!106 = !DILocation(line: 50, column: 24, scope: !101)
!107 = !DILocation(line: 52, column: 7, scope: !101)
!108 = !DILocation(line: 52, column: 29, scope: !101)
!109 = !DILocation(line: 53, column: 18, scope: !101)
!110 = !DILocation(line: 53, column: 34, scope: !101)
!111 = !DILocation(line: 101, column: 6, scope: !112, inlinedAt: !114)
!112 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !113, file: !113, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37)
!113 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!114 = !DILocation(line: 53, column: 2, scope: !101)
!115 = !DILocation(line: 101, column: 18, scope: !112, inlinedAt: !114)
!116 = !DILocation(line: 105, column: 25, scope: !112, inlinedAt: !114)
!117 = !DILocation(line: 105, column: 2, scope: !112, inlinedAt: !114)
!118 = !DILocation(line: 54, column: 18, scope: !101)
!119 = !DILocation(line: 54, column: 34, scope: !101)
!120 = !DILocation(line: 101, column: 6, scope: !121, inlinedAt: !122)
!121 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !113, file: !113, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37)
!122 = !DILocation(line: 54, column: 2, scope: !101)
!123 = !DILocation(line: 101, column: 18, scope: !121, inlinedAt: !122)
!124 = !DILocation(line: 105, column: 25, scope: !121, inlinedAt: !122)
!125 = !DILocation(line: 105, column: 2, scope: !121, inlinedAt: !122)
!126 = !DILocation(line: 55, column: 18, scope: !101)
!127 = !DILocation(line: 55, column: 34, scope: !101)
!128 = !DILocation(line: 101, column: 6, scope: !129, inlinedAt: !130)
!129 = distinct !DISubprogram(name: "free", linkageName: "free", scope: !113, file: !113, line: 99, scopeLine: 99, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37)
!130 = !DILocation(line: 55, column: 2, scope: !101)
!131 = !DILocation(line: 101, column: 18, scope: !129, inlinedAt: !130)
!132 = !DILocation(line: 105, column: 25, scope: !129, inlinedAt: !130)
!133 = !DILocation(line: 105, column: 2, scope: !129, inlinedAt: !130)
!134 = distinct !DISubprogram(name: "init", linkageName: "std.os.backtrace.Backtrace.init", scope: !2, file: !2, line: 58, type: !135, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !43)
!135 = !DISubroutineType(types: !136)
!136 = !{!42, !42, !7, !9, !9, !9, !20, !22}
!137 = !DILocation(line: 59, column: 1, scope: !134)
!138 = !DILocalVariable(name: "self", arg: 1, scope: !134, file: !2, line: 58, type: !42)
!139 = !DILocation(line: 58, column: 30, scope: !134)
!140 = !DILocalVariable(name: "offset", arg: 2, scope: !134, file: !2, line: 58, type: !6)
!141 = !DILocation(line: 58, column: 42, scope: !134)
!142 = !DILocalVariable(name: "function", arg: 3, scope: !134, file: !2, line: 58, type: !9)
!143 = !DILocation(line: 58, column: 57, scope: !134)
!144 = !DILocalVariable(name: "object_file", arg: 4, scope: !134, file: !2, line: 58, type: !9)
!145 = !DILocation(line: 58, column: 74, scope: !134)
!146 = !DILocalVariable(name: "file", arg: 5, scope: !134, file: !2, line: 58, type: !9)
!147 = !DILocation(line: 58, column: 94, scope: !134)
!148 = !DILocalVariable(name: "line", arg: 6, scope: !134, file: !2, line: 58, type: !20)
!149 = !DILocation(line: 58, column: 110, scope: !134)
!150 = !DILocalVariable(name: "allocator", arg: 7, scope: !134, file: !2, line: 58, type: !22)
!151 = !DILocation(line: 58, column: 130, scope: !134)
!152 = !DILocation(line: 60, column: 6, scope: !134)
!153 = !DILocation(line: 62, column: 3, scope: !154)
!154 = distinct !DILexicalBlock(scope: !134, file: !2, line: 61, column: 2)
!155 = !DILocation(line: 62, column: 17, scope: !154)
!156 = !DILocation(line: 63, column: 3, scope: !154)
!157 = !DILocation(line: 63, column: 19, scope: !154)
!158 = !DILocation(line: 64, column: 3, scope: !154)
!159 = !DILocation(line: 64, column: 22, scope: !154)
!160 = !DILocation(line: 65, column: 3, scope: !154)
!161 = !DILocation(line: 65, column: 15, scope: !154)
!162 = !DILocation(line: 66, column: 3, scope: !154)
!163 = !DILocation(line: 66, column: 15, scope: !154)
!164 = !DILocation(line: 67, column: 3, scope: !154)
!165 = !DILocation(line: 67, column: 20, scope: !154)
!166 = !DILocation(line: 68, column: 10, scope: !154)
!167 = !DILocation(line: 70, column: 2, scope: !134)
!168 = !DILocation(line: 70, column: 16, scope: !134)
!169 = !DILocation(line: 71, column: 2, scope: !134)
!170 = !DILocation(line: 71, column: 32, scope: !134)
!171 = !DILocation(line: 71, column: 18, scope: !134)
!172 = !DILocation(line: 72, column: 2, scope: !134)
!173 = !DILocation(line: 72, column: 38, scope: !134)
!174 = !DILocation(line: 72, column: 21, scope: !134)
!175 = !DILocation(line: 73, column: 2, scope: !134)
!176 = !DILocation(line: 73, column: 24, scope: !134)
!177 = !DILocation(line: 73, column: 14, scope: !134)
!178 = !DILocation(line: 74, column: 2, scope: !134)
!179 = !DILocation(line: 74, column: 19, scope: !134)
!180 = !DILocation(line: 75, column: 2, scope: !134)
!181 = !DILocation(line: 75, column: 14, scope: !134)
!182 = !DILocation(line: 76, column: 9, scope: !134)
!183 = distinct !DISubprogram(name: "capture_current", linkageName: "std.os.backtrace.capture_current", scope: !2, file: !2, line: 79, type: !184, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !37, retainedNodes: !43)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !186}
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "void*[]", size: 128, align: 64, elements: !187, identifier: "void*[]")
!187 = !{!188, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !186, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void**", baseType: !25, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !186, baseType: !16, size: 64, align: 64, offset: 64)
!191 = !DILocalVariable(name: "buffer", arg: 1, scope: !183, file: !2, line: 79, type: !186)
!192 = !DILocation(line: 79, column: 36, scope: !183)
!193 = !DILocation(line: 81, column: 6, scope: !183)
!194 = !DILocation(line: 81, column: 26, scope: !183)
!195 = !DILocalVariable(name: "len", scope: !183, file: !2, line: 84, type: !196, align: 4)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "CInt", scope: !2, file: !2, line: 21, baseType: !197, align: 4)
!197 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!198 = !DILocation(line: 84, column: 9, scope: !183)
!199 = !DILocation(line: 84, column: 44, scope: !183)
!200 = !DILocation(line: 84, column: 15, scope: !183)
!201 = !DILocation(line: 85, column: 11, scope: !183)
!202 = !DILocation(line: 85, column: 18, scope: !183)
!203 = !DILocation(line: 85, column: 19, scope: !183)
