; ModuleID = 'std::core::mem'
source_filename = "std::core::mem"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%TempState = type { ptr, ptr, i64 }
%"any[]" = type { ptr, i64 }

$std.core.mem.aligned_offset = comdat any

$std.core.mem.ptr_is_aligned = comdat any

$std.core.mem.temp_push = comdat any

$std.core.mem.temp_pop = comdat any

$std.core.mem.malloc = comdat any

$std.core.mem.malloc_aligned = comdat any

$std.core.mem.tmalloc = comdat any

$std.core.mem.calloc = comdat any

$std.core.mem.calloc_aligned = comdat any

$std.core.mem.tcalloc = comdat any

$std.core.mem.realloc = comdat any

$std.core.mem.realloc_aligned = comdat any

$std.core.mem.free = comdat any

$std.core.mem.free_aligned = comdat any

$std.core.mem.trealloc = comdat any

$.dyn_search = comdat any

$"$ct.std.core.mem.TempState" = comdat any

$"$ct.int" = comdat any

$"$ct.std.core.mem.AtomicOrdering" = comdat any

$std.core.mem.MAX_MEMORY_ALIGNMENT = comdat any

$std.core.mem.DEFAULT_MEM_ALIGNMENT = comdat any

$"$sel.acquire" = comdat any

$"$ct.anyfault" = comdat any

$"$sel.release" = comdat any

$"$sel.resize" = comdat any

@"$ct.std.core.mem.TempState" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 24, i64 0, i64 3, [0 x i64] zeroinitializer }, comdat, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MAX_MEMORY_ALIGNMENT", linkageName: "std.core.mem.MAX_MEMORY_ALIGNMENT", scope: !2, file: !2, line: 8, type: !3, isLocal: false, isDefinition: true, align: 4)
!2 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!3 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "DEFAULT_MEM_ALIGNMENT", linkageName: "std.core.mem.DEFAULT_MEM_ALIGNMENT", scope: !2, file: !2, line: 9, type: !6, isLocal: false, isDefinition: true, align: 8)
!6 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 2, !"wchar_size", i32 4}
!10 = !{i32 4, !"PIE Level", i32 2}
!11 = !{i32 4, !"PIC Level", i32 2}
!12 = !{i32 1, !"uwtable", i32 2}
!13 = !{i32 2, !"frame-pointer", i32 2}
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !15, splitDebugInlining: false)
!15 = !{!0, !4}
!16 = distinct !DISubprogram(name: "aligned_offset", linkageName: "std.core.mem.aligned_offset", scope: !2, file: !2, line: 281, type: !17, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !20, !20}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !20)
!20 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!21 = !{}
!22 = !DILocalVariable(name: "offset", arg: 1, scope: !16, file: !2, line: 281, type: !19)
!23 = !DILocation(line: 281, column: 27, scope: !16)
!24 = !DILocalVariable(name: "alignment", arg: 2, scope: !16, file: !2, line: 281, type: !19)
!25 = !DILocation(line: 281, column: 39, scope: !16)
!26 = !DILocation(line: 1021, column: 9, scope: !27, inlinedAt: !29)
!27 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !28, file: !28, line: 1019, scopeLine: 1019, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!28 = !DIFile(filename: "math.c3", directory: "/usr/local/lib/c3/std/math")
!29 = !DILocation(line: 279, column: 11, scope: !30)
!30 = distinct !DILexicalBlock(scope: !16, file: !2, line: 282, column: 1)
!31 = !DILocation(line: 1021, column: 20, scope: !27, inlinedAt: !29)
!32 = !DILocation(line: 1021, column: 25, scope: !27, inlinedAt: !29)
!33 = !DILocation(line: 283, column: 9, scope: !16)
!34 = !DILocation(line: 283, column: 23, scope: !16)
!35 = !DILocation(line: 283, column: 32, scope: !16)
!36 = !DILocation(line: 283, column: 49, scope: !16)
!37 = distinct !DISubprogram(name: "ptr_is_aligned", linkageName: "std.core.mem.ptr_is_aligned", scope: !2, file: !2, line: 294, type: !38, scopeLine: 294, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41, !20}
!40 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void*", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!42 = !DILocalVariable(name: "ptr", arg: 1, scope: !37, file: !2, line: 294, type: !41)
!43 = !DILocation(line: 294, column: 30, scope: !37)
!44 = !DILocalVariable(name: "alignment", arg: 2, scope: !37, file: !2, line: 294, type: !19)
!45 = !DILocation(line: 294, column: 39, scope: !37)
!46 = !DILocation(line: 1021, column: 9, scope: !47, inlinedAt: !48)
!47 = distinct !DISubprogram(name: "is_power_of_2", linkageName: "is_power_of_2", scope: !28, file: !28, line: 1019, scopeLine: 1019, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!48 = !DILocation(line: 292, column: 11, scope: !49)
!49 = distinct !DILexicalBlock(scope: !37, file: !2, line: 295, column: 1)
!50 = !DILocation(line: 1021, column: 20, scope: !47, inlinedAt: !48)
!51 = !DILocation(line: 1021, column: 25, scope: !47, inlinedAt: !48)
!52 = !DILocation(line: 296, column: 10, scope: !37)
!53 = !DILocation(line: 296, column: 23, scope: !37)
!54 = distinct !DISubprogram(name: "temp_push", linkageName: "std.core.mem.temp_push", scope: !2, file: !2, line: 565, type: !55, scopeLine: 565, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !60}
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempState", scope: !2, file: !2, line: 556, size: 192, align: 64, elements: !58, identifier: "std.core.mem.TempState")
!58 = !{!59, !86, !87}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "old", scope: !57, file: !2, line: 558, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocator*", baseType: !61, size: 64, align: 64, dwarfAddressSpace: 0)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocator", scope: !2, file: !2, line: 10, size: 320, align: 64, elements: !62, identifier: "std.core.mem.allocator.TempAllocator")
!62 = !{!63, !69, !83, !84, !85}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "backing_allocator", scope: !61, file: !2, line: 12, baseType: !64, size: 128, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Allocator", size: 128, align: 64, elements: !65, identifier: "Allocator")
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !64, baseType: !41, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIBasicType(name: "typeid", size: 64, encoding: DW_ATE_address)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "last_page", scope: !61, file: !2, line: 13, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "TempAllocatorPage*", baseType: !71, size: 64, align: 64, dwarfAddressSpace: 0)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "TempAllocatorPage", scope: !2, file: !2, line: 22, size: 320, align: 64, elements: !72, identifier: "std.core.mem.allocator.TempAllocatorPage")
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prev_page", scope: !71, file: !2, line: 24, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !71, file: !2, line: 25, baseType: !41, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !71, file: !2, line: 26, baseType: !19, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !2, line: 27, baseType: !19, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !71, file: !2, line: 28, baseType: !19, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !2, line: 29, baseType: !79, align: 8, offset: 320)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, align: 8, elements: !81)
!80 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!81 = !{!82}
!82 = !DISubrange(count: 0, lowerBound: 0)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !61, file: !2, line: 14, baseType: !19, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !61, file: !2, line: 15, baseType: !19, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !2, line: 16, baseType: !79, align: 8, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !57, file: !2, line: 559, baseType: !60, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !57, file: !2, line: 560, baseType: !19, size: 64, align: 64, offset: 128)
!88 = !DILocalVariable(name: "other", arg: 1, scope: !54, file: !2, line: 565, type: !60)
!89 = !DILocation(line: 565, column: 39, scope: !54)
!90 = !DILocalVariable(name: "current", scope: !54, file: !2, line: 567, type: !60, align: 8)
!91 = !DILocation(line: 567, column: 17, scope: !54)
!92 = !DILocation(line: 396, column: 6, scope: !93, inlinedAt: !95)
!93 = distinct !DISubprogram(name: "temp", linkageName: "temp", scope: !94, file: !94, line: 394, scopeLine: 394, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!94 = !DIFile(filename: "mem_allocator.c3", directory: "/usr/local/lib/c3/std/core")
!95 = !DILocation(line: 567, column: 27, scope: !54)
!96 = !DILocation(line: 398, column: 3, scope: !97, inlinedAt: !95)
!97 = distinct !DILexicalBlock(scope: !93, file: !94, line: 397, column: 2)
!98 = !DILocation(line: 400, column: 9, scope: !93, inlinedAt: !95)
!99 = !DILocalVariable(name: "old", scope: !54, file: !2, line: 568, type: !60, align: 8)
!100 = !DILocation(line: 568, column: 17, scope: !54)
!101 = !DILocation(line: 568, column: 23, scope: !54)
!102 = !DILocation(line: 569, column: 6, scope: !54)
!103 = !DILocation(line: 569, column: 15, scope: !54)
!104 = !DILocation(line: 571, column: 13, scope: !105)
!105 = distinct !DILexicalBlock(scope: !54, file: !2, line: 570, column: 2)
!106 = !DILocation(line: 573, column: 11, scope: !54)
!107 = !DILocation(line: 573, column: 16, scope: !54)
!108 = !DILocation(line: 573, column: 25, scope: !54)
!109 = distinct !DISubprogram(name: "temp_pop", linkageName: "std.core.mem.temp_pop", scope: !2, file: !2, line: 579, type: !110, scopeLine: 579, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !57}
!112 = !DILocalVariable(name: "old_state", arg: 1, scope: !109, file: !2, line: 579, type: !57)
!113 = !DILocation(line: 579, column: 28, scope: !109)
!114 = !DILocation(line: 581, column: 9, scope: !109)
!115 = !DILocation(line: 581, column: 45, scope: !109)
!116 = !DILocation(line: 582, column: 9, scope: !109)
!117 = !DILocation(line: 582, column: 35, scope: !109)
!118 = !DILocation(line: 583, column: 2, scope: !109)
!119 = !DILocation(line: 583, column: 26, scope: !109)
!120 = !DILocation(line: 584, column: 37, scope: !109)
!121 = distinct !DISubprogram(name: "malloc", linkageName: "std.core.mem.malloc", scope: !2, file: !2, line: 650, type: !122, scopeLine: 650, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !21)
!122 = !DISubroutineType(types: !123)
!123 = !{!41, !20}
!124 = !DILocalVariable(name: "size", arg: 1, scope: !121, file: !2, line: 650, type: !19)
!125 = !DILocation(line: 650, column: 21, scope: !121)
!126 = !DILocation(line: 62, column: 6, scope: !127, inlinedAt: !128)
!127 = distinct !DISubprogram(name: "malloc_try", linkageName: "malloc_try", scope: !94, file: !94, line: 60, scopeLine: 60, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!128 = !DILocation(line: 57, column: 9, scope: !129, inlinedAt: !130)
!129 = distinct !DISubprogram(name: "malloc", linkageName: "malloc", scope: !94, file: !94, line: 55, scopeLine: 55, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!130 = !DILocation(line: 652, column: 9, scope: !121)
!131 = !DILocation(line: 62, column: 20, scope: !127, inlinedAt: !128)
!132 = !DILocation(line: 28, column: 71, scope: !133, inlinedAt: !134)
!133 = distinct !DISubprogram(name: "[DEFAULT INIT]", linkageName: "[DEFAULT INIT]", scope: !94, file: !94, line: 28, scopeLine: 28, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14)
!134 = !DILocation(line: 68, column: 10, scope: !127, inlinedAt: !128)
