; ModuleID = 'std_hash_hmac$std.hash.md5.Md5$16$64$'
source_filename = "std_hash_hmac$std.hash.md5.Md5$16$64$"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%.introspect = type { i8, i64, ptr, i64, i64, i64, [0 x i64] }
%"char[]" = type { ptr, i64 }
%any = type { ptr, i64 }
%"any[]" = type { ptr, i64 }
%Hmac = type { %Md5, %Md5 }
%Md5 = type { i32, i32, i32, i32, i32, i32, [64 x i8], [16 x i32] }

$"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.init" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.update" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.final" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.hash" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.pbkdf2" = comdat any

$"$ct.std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.HASH_BYTES" = comdat any

$"std_hash_hmac$std.hash.md5.Md5$16$64$.BLOCK_BYTES" = comdat any

$"$ct.long" = comdat any

$"$ct.ulong" = comdat any

@"$ct.std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac" = linkonce global %.introspect { i8 10, i64 0, ptr null, i64 304, i64 0, i64 2, [0 x i64] zeroinitializer }, comdat, align 8
@"std_hash_hmac$std.hash.md5.Md5$16$64$.IPAD" = internal unnamed_addr constant i8 54, align 1, !dbg !0
@"std_hash_hmac$std.hash.md5.Md5$16$64$.OPAD" = internal unnamed_addr constant i8 92, align 1, !dbg !4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "IPAD", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.IPAD", scope: !2, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true, align: 1)
!2 = !DIFile(filename: "hmac.c3", directory: "/usr/local/lib/c3/std/hash")
!3 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!4 = !DIGlobalVariableExpression(var: !5, expr: !DIExpression())
!5 = distinct !DIGlobalVariable(name: "OPAD", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.OPAD", scope: !2, file: !2, line: 84, type: !3, isLocal: true, isDefinition: true, align: 1)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "HASH_BYTES", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.HASH_BYTES", scope: !2, file: !2, line: 16, type: !8, isLocal: false, isDefinition: true, align: 4)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "BLOCK_BYTES", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.BLOCK_BYTES", scope: !2, file: !2, line: 16, type: !8, isLocal: false, isDefinition: true, align: 4)
!11 = !{i32 2, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{i32 2, !"wchar_size", i32 4}
!14 = !{i32 4, !"PIE Level", i32 2}
!15 = !{i32 4, !"PIC Level", i32 2}
!16 = !{i32 1, !"uwtable", i32 2}
!17 = !{i32 2, !"frame-pointer", i32 2}
!18 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "c3c", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !19, splitDebugInlining: false)
!19 = !{!0, !4, !6, !9}
!20 = distinct !DISubprogram(name: "init", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.init", scope: !2, file: !2, line: 45, type: !21, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !53)
!21 = !DISubroutineType(types: !22)
!22 = !{null, !23, !46}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Hmac*", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "Hmac", scope: !2, file: !2, line: 4, size: 2432, align: 32, elements: !25, identifier: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac")
!25 = !{!26, !45}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !24, file: !2, line: 6, baseType: !27, size: 1216, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashAlg", scope: !2, file: !2, line: 16, baseType: !28, align: 4)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "Md5", scope: !2, file: !2, line: 8, size: 1216, align: 32, elements: !29, identifier: "std.hash.md5.Md5")
!29 = !{!30, !32, !33, !34, !35, !36, !37, !41}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !28, file: !2, line: 10, baseType: !31, size: 32, align: 32)
!31 = !DIBasicType(name: "uint", size: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !28, file: !2, line: 10, baseType: !31, size: 32, align: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !28, file: !2, line: 11, baseType: !31, size: 32, align: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !28, file: !2, line: 11, baseType: !31, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !28, file: !2, line: 11, baseType: !31, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !28, file: !2, line: 11, baseType: !31, size: 32, align: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !28, file: !2, line: 12, baseType: !38, size: 512, align: 8, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3, size: 512, align: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 64, lowerBound: 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !28, file: !2, line: 13, baseType: !42, size: 512, align: 32, offset: 704)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, align: 32, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 16, lowerBound: 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !24, file: !2, line: 6, baseType: !27, size: 1216, align: 32, offset: 1216)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "char[]", size: 128, align: 64, elements: !47, identifier: "char[]")
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !46, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "char*", baseType: !3, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !46, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "usz", baseType: !52)
!52 = !DIBasicType(name: "ulong", size: 64, encoding: DW_ATE_unsigned)
!53 = !{}
!54 = !DILocation(line: 46, column: 1, scope: !20)
!55 = !DILocalVariable(name: "self", arg: 1, scope: !20, file: !2, line: 45, type: !23)
!56 = !DILocation(line: 45, column: 19, scope: !20)
!57 = !DILocalVariable(name: "key", arg: 2, scope: !20, file: !2, line: 45, type: !46)
!58 = !DILocation(line: 45, column: 33, scope: !20)
!59 = !DILocalVariable(name: "buffer", scope: !20, file: !2, line: 47, type: !38, align: 16)
!60 = !DILocation(line: 47, column: 20, scope: !20)
!61 = !DILocation(line: 48, column: 6, scope: !20)
!62 = !DILocation(line: 50, column: 3, scope: !63)
!63 = distinct !DILexicalBlock(scope: !20, file: !2, line: 49, column: 2)
!64 = !DILocation(line: 51, column: 3, scope: !63)
!65 = !DILocation(line: 51, column: 17, scope: !63)
!66 = !DILocation(line: 52, column: 25, scope: !63)
!67 = !DILocation(line: 52, column: 3, scope: !63)
!68 = !DILocation(line: 56, column: 22, scope: !69)
!69 = distinct !DILexicalBlock(scope: !20, file: !2, line: 55, column: 2)
!70 = !DILocation(line: 56, column: 26, scope: !69)
!71 = !DILocation(line: 56, column: 11, scope: !69)
!72 = !DILocation(line: 56, column: 3, scope: !69)
!73 = !DILocalVariable(name: ".temp", scope: !74, file: !2, line: 59, type: !51, align: 8)
!74 = distinct !DILexicalBlock(scope: !20, file: !2, line: 59, column: 2)
!75 = !DILocation(line: 59, column: 16, scope: !74)
!76 = !DILocalVariable(name: "b", scope: !77, file: !2, line: 59, type: !49, align: 8)
!77 = distinct !DILexicalBlock(scope: !74, file: !2, line: 59, column: 24)
!78 = !DILocation(line: 59, column: 12, scope: !77)
!79 = !DILocation(line: 59, column: 16, scope: !77)
!80 = !DILocation(line: 59, column: 25, scope: !77)
!81 = !DILocation(line: 59, column: 24, scope: !77)
!82 = !DILocation(line: 61, column: 2, scope: !20)
!83 = !DILocation(line: 62, column: 2, scope: !20)
!84 = !DILocation(line: 62, column: 17, scope: !20)
!85 = !DILocalVariable(name: ".temp", scope: !86, file: !2, line: 64, type: !51, align: 8)
!86 = distinct !DILexicalBlock(scope: !20, file: !2, line: 64, column: 2)
!87 = !DILocation(line: 64, column: 16, scope: !86)
!88 = !DILocalVariable(name: "b", scope: !89, file: !2, line: 64, type: !49, align: 8)
!89 = distinct !DILexicalBlock(scope: !86, file: !2, line: 64, column: 24)
!90 = !DILocation(line: 64, column: 12, scope: !89)
!91 = !DILocation(line: 64, column: 16, scope: !89)
!92 = !DILocation(line: 64, column: 25, scope: !89)
!93 = !DILocation(line: 64, column: 24, scope: !89)
!94 = !DILocation(line: 66, column: 2, scope: !20)
!95 = !DILocation(line: 67, column: 2, scope: !20)
!96 = !DILocation(line: 67, column: 17, scope: !20)
!97 = !DILocation(line: 69, column: 22, scope: !20)
!98 = !DILocation(line: 301, column: 11, scope: !99, inlinedAt: !101)
!99 = distinct !DISubprogram(name: "zero_volatile", linkageName: "zero_volatile", scope: !100, file: !100, line: 299, scopeLine: 299, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18)
!100 = !DIFile(filename: "mem.c3", directory: "/usr/local/lib/c3/std/core")
!101 = !DILocation(line: 69, column: 2, scope: !20)
!102 = !DILocation(line: 301, column: 30, scope: !99, inlinedAt: !101)
!103 = !DILocation(line: 301, column: 40, scope: !99, inlinedAt: !101)
!104 = distinct !DISubprogram(name: "update", linkageName: "std_hash_hmac$std.hash.md5.Md5$16$64$.Hmac.update", scope: !2, file: !2, line: 72, type: !21, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !53)
!105 = !DILocation(line: 73, column: 1, scope: !104)
!106 = !DILocalVariable(name: "self", arg: 1, scope: !104, file: !2, line: 72, type: !23)
!107 = !DILocation(line: 72, column: 21, scope: !104)
!108 = !DILocalVariable(name: "data", arg: 2, scope: !104, file: !2, line: 72, type: !46)
